
var NODE_NAMES={
    "code": 200,
    "message": "success",
    "data": {
        "000990": {
            "id": 56950330,
            "type": "company"
        }
    }
}

var TREE_NODES={
    "code": 200,
    "message": "success",
    "data": {
        "loadLayer": 4,
        "scaleRange": [
            0,
            200000,
            500000,
            1000000,
            2000000,
            3000000,
            4000000,
            5000000,
            5480000,
            6000000,
            7500000,
            8000000,
            8445080,
            10000000,
            11750000,
            12000000,
            12321300,
            15000000,
            16000000,
            19000000,
            20000000,
            24000000,
            30000000,
            34000000,
            40000000,
            42506300,
            50000000,
            57705900,
            60000000,
            61000000,
            65452200,
            66666667,
            70940000,
            71300000,
            75000000,
            80000000,
            83750000,
            86000000,
            100000000,
            105000000,
            138000000,
            150000000,
            153611000,
            200000000,
            250000000,
            260000000,
            300000000,
            305000000,
            915943092,
            1000000000,
            1801685982,
            2500000000,
            3156493600,
            6633266396,
            10977023408
        ],
        "companyMap": {
            "56950330": {
                "companyId": 56950330,
                "companyType": "其他上市股份有限公司",
                "establishDate": "1998-10-09",
                "industry": "制药/生物工程医疗/护理/卫生",
                "marketValue": "6633266396",
                "name": "诚志股份有限公司",
                "registrationCapital": "387683644",
                "representitive": "龙大伟",
                "scale": 6633266396,
                "scope": "本企业自产产品及相关技术的出口业务（国家限定公司经营或禁止出口的商品除外）；本企业的进料加工和“三来一补”业务；日用化学产品、专用化学用品(化学危险品除外)的开发、经营；咨询服务、物业管理、纸、纸制品、生活用纸、卫生系列产品的经营；食用油脂及油料的经营；医院投资管理；技术咨询、技术发开、技术服务、技术转让；液晶电子、信息功能材料产品、生物工程、医药中间体、汽车零配件、机械电子等产品的开发、经营；资产管理、资产受托管理、实业投资及管理、企业收购、兼并、资产重组的策划。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56950472": {
                "companyId": 56950472,
                "companyType": "其他上市股份有限公司",
                "establishDate": "1994-03-11",
                "industry": "",
                "marketValue": "3156493600",
                "name": "安徽安纳达钛业股份有限公司",
                "registrationCapital": "215020000",
                "representitive": "袁菊兴",
                "scale": 3156493600,
                "scope": "一般经营项目：生产和销售系列钛白粉及相关化工产品（不含危险品）。"
            },
            "56950834": {
                "companyId": 56950834,
                "companyType": "其他上市股份有限公司",
                "establishDate": "2001-11-13",
                "industry": "其他",
                "marketValue": "10977023408",
                "name": "吉林利源精制股份有限公司",
                "registrationCapital": "951215194",
                "representitive": "王民",
                "scale": 10977023408,
                "scope": "生产销售铝合金精密加工件、铝型材深加工部件；石油化工、电子电器、航空、航天、航海、汽车、轿车用铝合金部件；研发、制造铝合金轨道车辆、车头、车体、集装箱；生产销售铝合金型材、棒材、管材（包括无缝管）；制造各种铝型材产品及铝门窗；生产销售钢化玻璃、中空玻璃、夹胶玻璃、防弹玻璃和防火玻璃(物理工艺过程)；经营本企业自产产品及相关技术的出口业务（国家限定经营或禁止出口的商品除外）；经营本企业生产、科研所需的原辅材料、机械设备、仪器仪表、零配件及相关技术的进出口业务（国家限定经营或禁止的除外）；经营本企业的进料加工和“三来一补”业务#（以上经营项目：法律、法规和国务院决定禁止的，不得经营；许可经营项目凭有效许可证或批准文件经营）（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56959400": {
                "companyId": 56959400,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "1998-10-14",
                "industry": "银行",
                "name": "宁夏银行股份有限公司",
                "registrationCapital": "1801685982",
                "representitive": "道月泓",
                "scale": 1801685982,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据承兑和贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；外汇存款；外汇贷款；外汇汇款；外币兑换；国际结算；外汇担保；外汇票据的承兑和贴现；资信调查、咨询、见证业务；结汇、售汇业务；从事银行卡业务；经中国银行业监督管理机构等监管部门批准的其他业务。***"
            },
            "56959459": {
                "companyId": 56959459,
                "companyType": "国有有限责任公司",
                "establishDate": "1992-08-26",
                "industry": "",
                "name": "清华控股有限公司",
                "registrationCapital": "2500000000",
                "representitive": "徐井宏",
                "scale": 2500000000,
                "scope": "资产管理；资产受托管理；实业投资及管理；企业收购、兼并、资产重组的策划；科技、经济及相关业务的咨询及人员培训；投资、投资管理、投资咨询；技术开发、技术咨询、技术推广、技术服务；高科技企业孵化。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "56964709": {
                "companyId": 56964709,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-08-07",
                "industry": "金融/投资/证券",
                "name": "银川经济技术开发区投资控股有限公司",
                "registrationCapital": "305000000",
                "representitive": "卢新理",
                "scale": 305000000,
                "scope": "开发区的建设经营；土地开发经营；高科技项目等产业投资、文化传播产业投资，证券投资、资产受托管理；资产、资本经营；咨询。"
            },
            "56965263": {
                "companyId": 56965263,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-09-26",
                "industry": "",
                "name": "启迪(江西)发展有限公司",
                "registrationCapital": "70940000",
                "representitive": "庄宁",
                "scale": 70940000,
                "scope": "高新技术开发、转让、咨询、服务、人才培训；物业管理；装饰装修；工程管理。（依法须经批准的项目，经相关部门批准后方可开展经营活动）."
            },
            "56965264": {
                "companyId": 56965264,
                "companyType": "非国有有限责任公司",
                "establishDate": "2001-10-30",
                "industry": "金融/投资/证券 医疗/护理/卫生",
                "name": "北京诚志瑞华医院投资管理有限公司",
                "registrationCapital": "20000000",
                "representitive": "徐东",
                "scale": 20000000,
                "scope": "投资管理；投资咨询；技术咨询、技术转让、技术服务。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "56965265": {
                "companyId": 56965265,
                "companyType": "其他有限责任公司",
                "establishDate": "1997-04-25",
                "industry": "其他",
                "name": "石家庄永生华清液晶有限公司",
                "registrationCapital": "60000000",
                "representitive": "张喜民",
                "scale": 60000000,
                "scope": "液晶材料及辅助材料、化学产品、化学试剂批发、零售；液晶材料及辅助材料生产经营，本企业生产科研所需的原辅材料及相关技术的进口业务和本企业自产产品及相关技术的出口业务"
            },
            "56965266": {
                "companyId": 56965266,
                "companyType": "分公司",
                "establishDate": "1998-10-16",
                "industry": "",
                "name": "诚志股份有限公司草珊瑚分公司",
                "registrationCapital": "0",
                "representitive": "徐小虹",
                "scale": 0,
                "scope": "生产、销售牙膏系列产品（凭有效许可证经营）及其他日用化学用品；技术咨询、技术开发、技术服务、技术转让（以上项目依法需经批准的项目，需经相关部门批准后方可开展经营活动）"
            },
            "56965267": {
                "companyId": 56965267,
                "companyType": "非国有有限责任公司",
                "establishDate": "2000-12-26",
                "industry": "新能源",
                "name": "诚志生命科技有限公司",
                "registrationCapital": "260000000",
                "representitive": "徐东",
                "scale": 260000000,
                "scope": "饮料（固体饮料类）生产、销售（凭许可证在有效期内经营）；保健食品:粉剂（力搏士(注册商标)D-核糖冲剂）生产、销售（许可证有效期至2017年11月11日止）；复配食品添加剂生产、销售（许可证有效期至2018年04月22日止）；生产、销售环保节能产品；技术开发、技术推广、技术转让、技术咨询、技术服务；化工产品（易制毒及危险品除外）销售；自营和代理各类商品和技术的进出口。（依法须经批准的项目，经相关部门批准后方可开展经营活动）**"
            },
            "56967401": {
                "companyId": 56967401,
                "companyType": "非国有有限责任公司",
                "establishDate": "2001-11-13",
                "industry": "",
                "name": "辽源市利源装潢工程有限公司",
                "registrationCapital": "10000000",
                "representitive": "王民",
                "scale": 10000000,
                "scope": "制作安装保温节能铝门窗、玻璃幕墙、室内外装潢（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56967402": {
                "companyId": 56967402,
                "companyType": "非国有有限责任公司",
                "establishDate": "2001-04-06",
                "industry": "",
                "name": "辽源利源铝型材收购有限公司",
                "registrationCapital": "500000",
                "representitive": "王民",
                "scale": 500000,
                "scope": "废铝收购、自用、不允许外销（外省市）（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56967403": {
                "companyId": 56967403,
                "companyType": "非国有有限责任公司",
                "establishDate": "2014-10-14",
                "industry": "",
                "name": "天津利源轨道车辆制造有限公司",
                "registrationCapital": "30000000",
                "representitive": "王民",
                "scale": 30000000,
                "scope": "制造业；科学研究和技术服务业；建筑业。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56967404": {
                "companyId": 56967404,
                "companyType": "非国有有限责任公司",
                "establishDate": "2011-06-29",
                "industry": "",
                "name": "辽源利源工程机械施工有限公司",
                "registrationCapital": "5000000",
                "representitive": "王民",
                "scale": 5000000,
                "scope": "普通机械设备安装工程，地基与基础工程、土石方工程、公路路基施工工程（凭资质证经营）（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "56967405": {
                "companyId": 56967405,
                "companyType": "非国有有限责任公司",
                "establishDate": "2015-05-07",
                "industry": "",
                "name": "沈阳利源轨道交通装备有限公司",
                "registrationCapital": "30000000",
                "representitive": "王民",
                "scale": 30000000,
                "scope": "城市轨道交通设备、铁路机车车辆及动车组制造；铝型材加工；门窗、玻璃幕墙加工、安装；自营和代理各类商品和技术的进出口，但国家限定公司经营或禁止进出口的商品和技术除外。（依法须经批准的项目，经相关部门批准后方可开展经营活动。）"
            },
            "56967406": {
                "companyId": 56967406,
                "companyType": "其他",
                "establishDate": "2006-08-01",
                "industry": "",
                "name": "新企创业投资企业",
                "registrationCapital": "0",
                "representitive": "余晓阳",
                "scale": 0,
                "scope": "进行股权投资，具体投资方式包括新设企业、向已设立企业投资、接受已设立企业投资者股权转让。（出资总额：9425.501857万美元；必备投资者：NEW ENTEPRISE GI (MAURITIUS),LTD；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "56974737": {
                "companyId": 56974737,
                "companyType": "国有有限责任公司",
                "establishDate": "2006-01-23",
                "industry": "",
                "name": "丹东诚志医院投资管理有限公司",
                "registrationCapital": "42506300",
                "representitive": "徐东",
                "scale": 42506300,
                "scope": "医院投资、医院管理、医疗服务、医疗咨询（医疗卫生许可证有效期至2026年2月28日）；销售眼镜，验配眼镜（仅限下设分支机构经营）。"
            },
            "56974738": {
                "companyId": 56974738,
                "companyType": "其他有限责任公司",
                "establishDate": "2000-11-03",
                "industry": "",
                "name": "江西诚志油品新技术有限公司",
                "registrationCapital": "12000000",
                "representitive": "樊梅玲",
                "scale": 12000000,
                "scope": "添加剂、化学用品、润滑油、润滑脂、石腊开发、生产、销售；技术服务、技术咨询、技术转让、技术培训；国内贸易（未取得专项许可的项目除外）。"
            },
            "56974739": {
                "companyId": 56974739,
                "companyType": "国有有限责任公司",
                "establishDate": "1999-11-16",
                "industry": "",
                "name": "诚志股份有限公司草珊瑚生活用纸分公司",
                "registrationCapital": "0",
                "representitive": "钟寿椿",
                "scale": 0,
                "scope": "纸、纸制品、生活用纸、卫生巾系列产品的生产、销售。（以上项目国家有专项规定的除外）"
            },
            "56974740": {
                "companyId": 56974740,
                "companyType": "国有有限责任公司",
                "establishDate": "2000-04-16",
                "industry": "汽车及零配件",
                "name": "江西京鹰汽车新技术有限责任公司",
                "registrationCapital": "19000000",
                "representitive": "王金厚",
                "scale": 19000000,
                "scope": "汽车后视镜及相关的光学产品、电子产品、机械产品的科技开发、制造、批发、零售咨询服务、新技术咨询服务、机动车零配件销售、化工产品科技开发（法律、法规有专项规定的除外）※"
            },
            "56974741": {
                "companyId": 56974741,
                "companyType": "非国有有限责任公司上市",
                "establishDate": "2000-11-07",
                "industry": "其他行业",
                "name": "北京诚志利华科技发展有限公司",
                "registrationCapital": "300000000",
                "representitive": "徐东",
                "scale": 300000000,
                "scope": "物业管理；技术咨询、技术开发、技术服务、技术转让；专业承包；自有房屋租赁；货物进出口、技术进出口、代理进出口；经济贸易咨询；投资管理；企业管理；销售自行开发后的产品、文化用品、电子产品、汽车零配件、机械设备、化工产品（不含危险化学品及一类易制毒化学品）；企业策划。（依法须经批准的项目，经相关部门批准后方可开展经营活动）（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "56974742": {
                "companyId": 56974742,
                "companyType": "其他有限责任公司",
                "establishDate": "2006-01-23",
                "industry": "原材料和加工",
                "name": "青岛青迈高能电子辐照有限公司",
                "registrationCapital": "57705900",
                "representitive": "吕大龙",
                "scale": 57705900,
                "scope": "医疗器械的辐照消毒；成药的辐照灭菌；高分子材料的辐照加工；制造、批发、零售：复合材料、功能性高分子材料、辐照电线电缆、仪表线、再生丁基硫化胶制品、热缩管、热缩带、密封件、玻璃；货物进出口、技术进出口（法律、行政法规禁止的项目除外；法律、行政法规限制的项目取得许可证后方可经营）；辐照加工技术的研究开发。 （依法须经批准的项目，经相关部门批准后方可开展经营活动）。"
            },
            "56974743": {
                "companyId": 56974743,
                "companyType": "其他有限责任公司",
                "establishDate": "2003-09-03",
                "industry": "",
                "name": "山东诚志菱花生物工程有限公司",
                "registrationCapital": "50000000",
                "representitive": "江保安",
                "scale": 50000000,
                "scope": "L-谷氨酰胺系列产品及各种氨基酸产品的研发、生产和销售。(依法须经批准的项目，经相关部门批准后方可开展经营活动)"
            },
            "56974744": {
                "companyId": 56974744,
                "companyType": "非国有有限责任公司",
                "establishDate": "2003-04-02",
                "industry": "制药/生物工程",
                "name": "宁夏诚志万胜生物工程有限公司",
                "registrationCapital": "200000000",
                "representitive": "杨永森",
                "scale": 200000000,
                "scope": "玉米的收购和加工；玉米淀粉及其衍生物的生产和销售；D-核糖、L-精氨酸、L-谷氨酰胺、天门冬氨酸钙、缬氨酸、亮氨酸、异亮氨酸、瓜氨酸、鸟氨酸、茶氨酸、褐藻寡糖的生产和销售；氨基酸饲料添加剂、玉米蛋白饲料、胚芽、蛋白粉、纤维、玉米浆、有机肥料、无机复混肥料的生产及销售*****"
            },
            "56974745": {
                "companyId": 56974745,
                "companyType": "其他有限责任公司",
                "establishDate": "2010-11-23",
                "industry": "",
                "name": "福建德美股权投资有限公司",
                "registrationCapital": "250000000",
                "representitive": "苏松青",
                "scale": 250000000,
                "scope": "一般经营项目：非证券类股权投资及与股权投资有关的咨询服务；受托对非证券类股权投资管理及与股权投资有关的咨询服务；商务咨询；市场营销策划；资产委托管理；企业收购、兼并；资产重组的策划。(以上经营范围涉及许可经营项目的，应在取得有关部门的许可后方可经营)"
            },
            "56974746": {
                "companyId": 56974746,
                "companyType": "其他有限责任公司上市",
                "establishDate": "2011-12-07",
                "industry": "电子技术/半导体/集成电路",
                "name": "安徽今上显示玻璃有限公司",
                "registrationCapital": "83750000",
                "representitive": "涂勤华",
                "scale": 83750000,
                "scope": "一般经营项目：ITO导电玻璃、显示器玻璃、真空镀膜玻璃、手机屏幕玻璃、各种规格的模组、触摸屏、显示器以及相关玻璃配套设备及原辅材料的研发、生产和销售。（以上不含前置许可经营项目，涉及后置许可的凭许可证经营）。"
            },
            "56974747": {
                "companyId": 56974747,
                "companyType": "其他有限责任公司",
                "establishDate": "1994-02-26",
                "industry": "石油/化工/矿产/地质",
                "name": "北京清华永昌化工有限公司",
                "registrationCapital": "8445080",
                "representitive": "苏家璜",
                "scale": 8445080,
                "scope": "销售化工产品（不含危险化学品及一类易制毒化学品）。（未取得行政许可的项目除外）"
            },
            "56974766": {
                "companyId": 56974766,
                "companyType": "非国有有限责任公司",
                "establishDate": "2005-04-18",
                "industry": "制药/生物工程石油/化工/矿产/地质",
                "name": "石家庄诚志永华显示材料有限公司",
                "registrationCapital": "61000000",
                "representitive": "涂勤华",
                "scale": 61000000,
                "scope": "液晶电子、信息功能材料产品的生产、销售；相关技术材料、产品进出口业务、技术咨询；电子功能材料和器件的生产设备、辅助材料、试剂销售（法律、法规规定需专项审批的，在未批准前不得开展经营活动）"
            },
            "56980127": {
                "companyId": 56980127,
                "companyType": "非国有有限责任公司",
                "establishDate": "2014-02-21",
                "industry": "",
                "name": "东辽县辽东装饰材料销售有限公司",
                "registrationCapital": "500000",
                "representitive": "刘宇",
                "scale": 500000,
                "scope": "装饰材料批发、零售（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57005159": {
                "companyId": 57005159,
                "companyType": "其他有限责任公司",
                "establishDate": "2012-08-22",
                "industry": "",
                "name": "北京高能时代环境修复有限公司",
                "registrationCapital": "100000000",
                "representitive": "刘勇",
                "scale": 100000000,
                "scope": "专业承包；施工总承包；工程勘察设计；建设工程项目管理；固体废物污染治理；辐射污染治理；水污染治理；废气治理；大气污染治理；地质灾害治理；技术开发、技术转让、技术咨询、技术服务、技术推广；环境监测；工程和技术研究与试验发展；机械设备租赁。（依法须经批准的项目，经相关部门批准后方可开展经营活动。）（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57034381": {
                "companyId": 57034381,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司西塔支行",
                "registrationCapital": "0",
                "representitive": "薛军",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034393": {
                "companyId": 57034393,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司光明支行",
                "registrationCapital": "0",
                "representitive": "常文刚",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收复款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034396": {
                "companyId": 57034396,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司新城支行",
                "registrationCapital": "0",
                "representitive": "马继明",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034398": {
                "companyId": 57034398,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司湖滨支行",
                "registrationCapital": "0",
                "representitive": "周存斌",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034400": {
                "companyId": 57034400,
                "companyType": "分公司",
                "establishDate": "2003-02-24",
                "industry": "",
                "name": "宁夏银行股份有限公司中宁支行",
                "registrationCapital": "0",
                "representitive": "李永刚",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托贷款业务；经中国人民银行批准的其他业务*"
            },
            "57034401": {
                "companyId": 57034401,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "2011-07-15",
                "industry": "",
                "name": "隆德六盘山村镇银行股份有限公司",
                "registrationCapital": "40000000",
                "representitive": "薛贵宁",
                "scale": 40000000,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据承兑与贴现；从事同业拆借；从事银行卡业务；代理发行、代理兑付、承销政府债券；代理收付款项及代理保险业务；经银行业监督管理机构批准的其他业务。***"
            },
            "57034403": {
                "companyId": 57034403,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司利民支行",
                "registrationCapital": "0",
                "representitive": "姜涛",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034404": {
                "companyId": 57034404,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司凤凰支行",
                "registrationCapital": "0",
                "representitive": "贺玲",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034406": {
                "companyId": 57034406,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司科技支行",
                "registrationCapital": "0",
                "representitive": "刘刚",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034407": {
                "companyId": 57034407,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司东城支行",
                "registrationCapital": "0",
                "representitive": "闫志斌",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034409": {
                "companyId": 57034409,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司火车站支行",
                "registrationCapital": "0",
                "representitive": "陈少峰",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034411": {
                "companyId": 57034411,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司西城支行",
                "registrationCapital": "0",
                "representitive": "叶木",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034412": {
                "companyId": 57034412,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司永康支行",
                "registrationCapital": "0",
                "representitive": "朱季红",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收复款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034415": {
                "companyId": 57034415,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司新世纪支行",
                "registrationCapital": "0",
                "representitive": "高铭宏",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034416": {
                "companyId": 57034416,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司新华西街支行",
                "registrationCapital": "0",
                "representitive": "李世钢",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034423": {
                "companyId": 57034423,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司新市区支行",
                "registrationCapital": "0",
                "representitive": "郭永军",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034425": {
                "companyId": 57034425,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司开发区支行",
                "registrationCapital": "0",
                "representitive": "张彦军",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发放金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收复款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034427": {
                "companyId": 57034427,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司广场支行",
                "registrationCapital": "0",
                "representitive": "曹伟明",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034428": {
                "companyId": 57034428,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司民生支行",
                "registrationCapital": "0",
                "representitive": "哈晓刚",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034429": {
                "companyId": 57034429,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司中山支行",
                "registrationCapital": "0",
                "representitive": "张建明",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034430": {
                "companyId": 57034430,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司丽景支行",
                "registrationCapital": "0",
                "representitive": "周长军",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034432": {
                "companyId": 57034432,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司北京路支行",
                "registrationCapital": "0",
                "representitive": "陈志勇",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经中国人民银行批准的其他业务。***"
            },
            "57034434": {
                "companyId": 57034434,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司光华支行",
                "registrationCapital": "0",
                "representitive": "刘沪军",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57034439": {
                "companyId": 57034439,
                "companyType": "分公司",
                "establishDate": "1998-10-28",
                "industry": "",
                "name": "宁夏银行股份有限公司商城支行",
                "registrationCapital": "0",
                "representitive": "金国才",
                "scale": 0,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算；办理票据贴现；发行金融债券；代理发行、代理兑付、承销政府债券；买卖政府债券；从事同业拆借；提供担保；代理收付款项及代理保险业务；提供保管箱服务；办理地方财政信用周转使用金的委托存贷款业务；经人民银行批准的其他业务。***"
            },
            "57036415": {
                "companyId": 57036415,
                "companyType": "非国有有限责任公司",
                "establishDate": "1991-01-15",
                "industry": "仪器仪表/工业自动化",
                "name": "北京希必实机电技术有限公司",
                "registrationCapital": "1000000",
                "representitive": "单燕华",
                "scale": 1000000,
                "scope": "生产大功率气流扬声器产品和医疗检测器械及设备；销售自产产品。"
            },
            "57051988": {
                "companyId": 57051988,
                "companyType": "其他有限责任公司",
                "establishDate": "2004-09-22",
                "industry": "环保",
                "name": "北京实创环保发展有限公司",
                "registrationCapital": "100000000",
                "representitive": "赵玉华",
                "scale": 100000000,
                "scope": "房地产开发。（房地产开发企业资质证书有效期至2017年10月30日）；大气污染治理；技术服务、技术咨询；经济贸易咨询；物业管理。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "57082860": {
                "companyId": 57082860,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "1994-01-19",
                "industry": "银行",
                "name": "陕西杨凌农村商业银行股份有限公司",
                "registrationCapital": "200000000",
                "representitive": "李林",
                "scale": 200000000,
                "scope": "吸收公众存款；发放短期、中期和长期贷款；办理国内结算业务；办理票据承兑与贴现；代理发行、代理兑付、承销政府债券；买卖政府债券、金融债券；从事同业拆借；从事借记卡业务；代理收付款项及代理保险业务；提供保险箱服务；经中国银行业监督管理机构批准的其他业务。（以上经营范围凡涉及国家有专项专营规定的从其规定）（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57088657": {
                "companyId": 57088657,
                "companyType": "其他有限责任公司",
                "establishDate": "2002-03-25",
                "industry": "金融/投资/证券",
                "name": "深圳市银控投资有限公司",
                "registrationCapital": "16000000",
                "representitive": "陈小平",
                "scale": 16000000,
                "scope": "高科技项目产业投资；投资兴办实业（具体项目另行申报）；资产经营管理。（以上项目凡涉及到许可证管理的须凭许可证经营）；国内商业、物资供销业（不含专营、专控、专卖商品）；投资策划及信息咨询、企业经营管理咨询（不含限制项目）。"
            },
            "57088659": {
                "companyId": 57088659,
                "companyType": "其他有限责任公司",
                "establishDate": "2011-09-29",
                "industry": "",
                "name": "中农科城投资管理有限公司",
                "registrationCapital": "50000000",
                "representitive": "郝敬林",
                "scale": 50000000,
                "scope": "投资管理；投资咨询；企业管理；企业管理咨询；技术开发、技术咨询、技术服务、技术转让；货物进出口、代理进出口、技术进出口。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57088661": {
                "companyId": 57088661,
                "companyType": "非国有有限责任公司",
                "establishDate": "2006-07-10",
                "industry": "",
                "name": "湖南水木生物技术有限公司",
                "registrationCapital": "11750000",
                "representitive": "陈昊",
                "scale": 11750000,
                "scope": "植物种苗、水溶肥料、植物生长营养剂及农产品的开发、生产和销售；农产品收购；农业技术的推广、咨询；农用机械的开发、销售。(依法须经批准的项目，经相关部门批准后方可开展经营活动)"
            },
            "57088662": {
                "companyId": 57088662,
                "companyType": "其他有限责任公司",
                "establishDate": "2000-10-27",
                "industry": "金融/投资/证券",
                "name": "上海宁夏投资发展有限公司",
                "registrationCapital": "138000000",
                "representitive": "孙健",
                "scale": 138000000,
                "scope": "投资（除股权投资）、资产经营管理、生产资料和工业品贸易（除专项规定）、投资及商务咨询，房地产开发，从事货物进出口及技术进出口业务。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "57088663": {
                "companyId": 57088663,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-11-27",
                "industry": "",
                "name": "北京寰夏农业科技投资有限公司",
                "registrationCapital": "30000000",
                "representitive": "郝敬林",
                "scale": 30000000,
                "scope": "项目投资；资产管理；投资管理；技术开发、技术推广、技术转让、技术服务、技术咨询。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57088664": {
                "companyId": 57088664,
                "companyType": "其他有限责任公司",
                "establishDate": "2000-08-29",
                "industry": "",
                "name": "宁夏投资咨询有限公司",
                "registrationCapital": "10000000",
                "representitive": "周辉",
                "scale": 10000000,
                "scope": "国内外投资项目的咨询、论证、投资、开发、项目包装、策划、商业贸易(不含国家专控产品)及上述项目的中介服务。"
            },
            "57088665": {
                "companyId": 57088665,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-06-14",
                "industry": "",
                "name": "宁夏盛农投资管理有限公司",
                "registrationCapital": "10000000",
                "representitive": "周燕军",
                "scale": 10000000,
                "scope": "创业投资；企业管理；资产管理；投资咨询；企业管理咨询；企业形象策划；公共关系服务、提供点子、创意服务。**"
            },
            "57088672": {
                "companyId": 57088672,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "2007-12-14",
                "industry": "",
                "name": "宁夏森淼科技集团股份有限公司",
                "registrationCapital": "80000000",
                "representitive": "沈效东",
                "scale": 80000000,
                "scope": "林木种苗、种子（凭许可证经营），花卉、蔬菜等优新品种引进、培育与经营，工厂化育苗设施设备、生物农药和肥料的销售；经济林种植；果品、蔬菜的加工、销售与配送；农业新产品、新技术、新工艺的研发、推广与咨询服务。"
            },
            "57089609": {
                "companyId": 57089609,
                "companyType": "其他有限责任公司",
                "establishDate": "2006-03-01",
                "industry": "",
                "name": "江西诚志科技发展有限公司",
                "registrationCapital": "34000000",
                "representitive": "张喜民",
                "scale": 34000000,
                "scope": "稳定同位素碳-13，氮-15，氧-18及其标记化合物的研发、生产与销售；稳定同位素分离和标记技术的咨询与服务；经营气液传质高效填料；经营长寿命高精度屏蔽式计量泵；经营特种阀门（以上项目国家法律法规有专项规定的除外）"
            },
            "57091991": {
                "companyId": 57091991,
                "companyType": "其他有限责任公司",
                "establishDate": "2004-09-07",
                "industry": "",
                "name": "北京诚志玉泉医院投资管理有限公司",
                "registrationCapital": "12321300",
                "representitive": "徐东",
                "scale": 12321300,
                "scope": "医院的投资与管理（不含诊疗服务）；技术咨询、技术转让、技术服务。（1、不得以公开方式募集资金；2、不得公开交易证券类产品和金融衍生品；3、不得发放贷款；4、不得向所投资企业以外的其他企业提供担保；5、不得向投资者承诺投资本金不受损失或者承诺最低收益；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57091992": {
                "companyId": 57091992,
                "companyType": "分公司",
                "establishDate": "2002-08-02",
                "industry": "制药/生物工程石油/化工/矿产/地质",
                "name": "石家庄诚志永华显示材料有限公司元氏分公司",
                "registrationCapital": "0",
                "representitive": "王奎",
                "scale": 0,
                "scope": "液晶材料中间体生产销售、液晶材料销售"
            },
            "57091995": {
                "companyId": 57091995,
                "companyType": "其他有限责任公司",
                "establishDate": "2004-05-27",
                "industry": "",
                "name": "江西华清物业管理有限公司",
                "registrationCapital": "1000000",
                "representitive": "庄宁",
                "scale": 1000000,
                "scope": "物业管理；综合技术服务；咨询服务；小区劳务服务；企业食堂（不含凉菜、裱花蛋糕及生食海产品）（有效期至2017年10月30日）；装饰装修；停车服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）."
            },
            "57091996": {
                "companyId": 57091996,
                "companyType": "其他有限责任公司",
                "establishDate": "2011-06-30",
                "industry": "",
                "name": "北京至同思睿信息技术有限公司",
                "registrationCapital": "4000000",
                "representitive": "赵恒",
                "scale": 4000000,
                "scope": "技术开发、技术转让、技术咨询、技术服务；计算机系统服务；货物进出口、技术进出口、代理进出口。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57091998": {
                "companyId": 57091998,
                "companyType": "其他有限责任公司",
                "establishDate": "1994-09-15",
                "industry": "其他",
                "name": "北京诚大信业科技有限公司",
                "registrationCapital": "24000000",
                "representitive": "尤大江",
                "scale": 24000000,
                "scope": "电力自动化设计软件、交通软件、计算机软硬件、网络技术开发、技术转让、技术培训、技术服务、技术咨询；货物进出口、技术进出口、代理进出口。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57091999": {
                "companyId": 57091999,
                "companyType": "其他有限责任公司",
                "establishDate": "2013-06-04",
                "industry": "",
                "name": "福建省源丰实业有限公司",
                "registrationCapital": "86000000",
                "representitive": "黄祥雪",
                "scale": 86000000,
                "scope": "自营或代理各类商品及技术的进出口业务（但国家限定公司经营或禁止进出口的商品和技术除外）；化工产品（不含危险化学品）研发、销售；环保节能产品的研发、销售；信息产品技术开发、信息产品技术服务、信息产品技术转让；法律法规未规定许可的，自主选择经营项目开展经营活动。(以上经营范围涉及许可经营项目的，应在取得有关部门的许可后方可经营)"
            },
            "57092000": {
                "companyId": 57092000,
                "companyType": "其他有限责任公司",
                "establishDate": "1995-05-02",
                "industry": "",
                "name": "银河期货经纪有限公司",
                "registrationCapital": "30000000",
                "representitive": "陈先学",
                "scale": 30000000,
                "scope": "期货经纪业务；期货信息咨询、培训。"
            },
            "57092001": {
                "companyId": 57092001,
                "companyType": "其他有限责任公司",
                "establishDate": "1998-05-12",
                "industry": "计算机软件",
                "name": "北京艾克斯特科技有限公司",
                "registrationCapital": "24000000",
                "representitive": "王学顺",
                "scale": 24000000,
                "scope": "自营和代理各类商品及技术的进出口业务，但国家限定公司经营或禁止进出口的商品及技术除外；基础软件服务、应用软件服务；软件开发、销售；技术开发、技术服务、技术咨询；计算机系统服务。（未取得行政许可的项目除外）"
            },
            "57092002": {
                "companyId": 57092002,
                "companyType": "其他有限责任公司",
                "establishDate": "2014-04-17",
                "industry": "",
                "name": "珲春瀚华科技发展有限公司",
                "registrationCapital": "10000000",
                "representitive": "庄宁",
                "scale": 10000000,
                "scope": "技术转让；批发零售：化工产品（不含危险化学品）、煤炭、有色金属、矿产品；石油制品批发（不含成品油）；法律、法规允许的进出口贸易（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57092005": {
                "companyId": 57092005,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "2001-12-28",
                "industry": "其他行业",
                "name": "北京实创科技园开发建设股份有限公司",
                "registrationCapital": "915943092",
                "representitive": "陈晓智",
                "scale": 915943092,
                "scope": "中关村园区土地一级开发；房地产开发及销售商品房。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "57092006": {
                "companyId": 57092006,
                "companyType": "其他有限责任公司",
                "establishDate": "2014-07-15",
                "industry": "",
                "name": "石家庄诚志永胜电子科技有限公司",
                "registrationCapital": "15000000",
                "representitive": "涂勤华",
                "scale": 15000000,
                "scope": "电子材料研发、生产、销售及技术开发、技术咨询、技术转让、技术服务；建筑材料、化工产品（危险化学品及易制毒化学品除外）的批发、零售及进出口业务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57092008": {
                "companyId": 57092008,
                "companyType": "非国有有限责任公司",
                "establishDate": "2014-06-27",
                "industry": "石油/化工/矿产/地质",
                "name": "河北诚志永昌化工有限公司",
                "registrationCapital": "20000000",
                "representitive": "涂勤华",
                "scale": 20000000,
                "scope": "对水性高分子项目的投资建设（依法须经批准的项目，经相关部门批准后方可开展经营活动）。"
            },
            "57092009": {
                "companyId": 57092009,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-03-06",
                "industry": "",
                "name": "北京诚志永兴科技有限公司",
                "registrationCapital": "2000000",
                "representitive": "涂勤华",
                "scale": 2000000,
                "scope": "生产液晶行业专用的TFT-LCD（薄膜晶体管液晶显示器）有机溶剂混合料（环保主管部门批文有效期至2014年12月23日）；技术推广；销售自产产品。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57092010": {
                "companyId": 57092010,
                "companyType": "其他有限责任公司",
                "establishDate": "2013-05-13",
                "industry": "",
                "name": "福建省龙源泰实业有限公司",
                "registrationCapital": "71300000",
                "representitive": "何宁",
                "scale": 71300000,
                "scope": "按照对外贸易备案事项开展进出口业务，环保节能产品、液晶电子、信息功能材料产品、机械电子等产品的开发经营；法律法规未规定的，自主选择经营项目开展经营活动。(以上经营范围涉及许可经营项目的，应在取得有关部门的许可后方可经营)"
            },
            "57092011": {
                "companyId": 57092011,
                "companyType": "其他有限责任公司",
                "establishDate": "2005-08-29",
                "industry": "",
                "name": "宁夏宁丰粮油有限责任公司",
                "registrationCapital": "10000000",
                "representitive": "史惠荣",
                "scale": 10000000,
                "scope": "筹建。"
            },
            "57092012": {
                "companyId": 57092012,
                "companyType": "非国有有限责任公司",
                "establishDate": "2004-10-28",
                "industry": "",
                "name": "北京诚志永昌化工有限公司",
                "registrationCapital": "20000000",
                "representitive": "涂勤华",
                "scale": 20000000,
                "scope": "销售化工产品（不含危险化学品及一类易制毒化学品）。（未取得行政许可的项目除外）"
            },
            "57092013": {
                "companyId": 57092013,
                "companyType": "非国有有限责任公司",
                "establishDate": "2006-04-30",
                "industry": "",
                "name": "吴忠市万胜生物技术中心(有限公司)",
                "registrationCapital": "500000",
                "representitive": "万玉",
                "scale": 500000,
                "scope": "生物技术、生物制品的研发；科技信息的服务（以上不含国家专项审批项目）****"
            },
            "57092014": {
                "companyId": 57092014,
                "companyType": "非国有有限责任公司",
                "establishDate": "2009-01-13",
                "industry": "",
                "name": "北京诚志英华生物科技有限公司",
                "registrationCapital": "10000000",
                "representitive": "张喜民",
                "scale": 10000000,
                "scope": "经营保健食品（《卫生许可证》有效期至2016年11月28日）；销售医疗器械II、III类（以《医疗器械经营企业许可证》核定范围为准）（《医疗器械经营企业许可证》有效期至2019年03月04日）；技术开发、技术推广、技术转让、技术咨询、技术服务；销售自行开发后的产品、化工产品（不含危险化学品及一类易制毒化学品）；货物进出口、技术进出口、代理进出口。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "57092016": {
                "companyId": 57092016,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-06-08",
                "industry": "",
                "name": "北京迪斯泰信息咨询有限公司",
                "registrationCapital": "500000",
                "representitive": "涂勤华",
                "scale": 500000,
                "scope": "经济贸易咨询；投资咨询；企业管理咨询；企业策划、设计；公共关系服务；提供点子、创意服务；教育咨询。（未取得行政许可的项目除外）"
            },
            "57092019": {
                "companyId": 57092019,
                "companyType": "非国有有限责任公司",
                "establishDate": "2000-12-20",
                "industry": "制药/生物工程",
                "name": "江西诚志生物工程有限公司",
                "registrationCapital": "153611000",
                "representitive": "徐东",
                "scale": 153611000,
                "scope": "“食品添加剂：L-谷氨酰胺、D-核糖”生产销售、食品添加剂的科研、开发、制造、批发；α-熊果苷的生产销售；β-胸苷的生产销售；经营本企业自产产品及技术的进出口业务；代理各类商品和技术出口贸易；力搏士D--核糖冲剂、化妆品及化学用品批发（以上项目涉及前置许可的凭许可证经营）※"
            },
            "57104846": {
                "companyId": 57104846,
                "companyType": "非国有非上市股份有限公司",
                "establishDate": "2004-08-23",
                "industry": "农/林/牧/渔",
                "name": "陕西秦宝牧业股份有限公司",
                "registrationCapital": "75000000",
                "representitive": "史文利",
                "scale": 75000000,
                "scope": "牛羊的屠宰、分割、深加工、销售(全国工业产品生产许可证有效期至2015年9月13日）；饲料的收购、销售；牛的良种繁育与养殖；牛产品的进出口经营（国家禁止和限制公司进出口经营的商品和技术除外）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57104847": {
                "companyId": 57104847,
                "companyType": "非国有非上市股份有限公司",
                "establishDate": "2003-11-12",
                "industry": "环保",
                "name": "江苏新世纪江南环保股份有限公司",
                "registrationCapital": "150000000",
                "representitive": "徐俊生",
                "scale": 150000000,
                "scope": "环保脱硫脱硝装置的研发、设计、技术咨询；环保脱硫脱硝装置相关部件的研发、设计、生产、技术咨询服务；环保工程总承包、设计、施工（须行政审批后实施）相关材料和设备的采购；机械设备、电子仪器仪表、电器设备、钢材、金属制品、非金属制品的批发；从事脱硫、脱硝工程相关货物、技术和服务的进出口（不涉及国营贸易管理商品；涉及配额、许可证管理商品的，按国家有关规定办理申请）。（外资比例小于25%）（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57104851": {
                "companyId": 57104851,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "2007-11-01",
                "industry": "快速消费品(食品、饮料、化妆品)",
                "name": "承德怡达食品股份有限公司",
                "registrationCapital": "66666667",
                "representitive": "李志民",
                "scale": 66666667,
                "scope": "蜜饯、罐头（畜禽水产罐头、果蔬罐头）研发、生产；炒货食品及坚果制品（烘炒类、油炸类）（分装）生产；水果制品（水果干制品）（分装）生产；出口本企业自产产品；进口本企业生产所需的机械设备、零配件及原辅材料。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57104911": {
                "companyId": 57104911,
                "companyType": "非国有非上市股份有限公司",
                "establishDate": "2006-12-12",
                "industry": "快速消费品(食品、饮料、化妆品)",
                "name": "金果园老农(北京)食品股份有限公司",
                "registrationCapital": "65452200",
                "representitive": "张善京",
                "scale": 65452200,
                "scope": "加工分装果仁、蜜饯、水果干制品、炒货；批发兼零售预包装食品、散装食品；经营保健食品；普通货运；货物专用运输（冷藏保鲜）（道路运输许可证有效期至2016年3月31日）；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出票、电影票；货物进出口；信息咨询（不含中介服务）。（该企业于2010年10月13日由内资企业变更为外商投资企业。依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57104996": {
                "companyId": 57104996,
                "companyType": "非国有非上市股份有限公司",
                "establishDate": "2005-08-22",
                "industry": "批发/零售",
                "name": "上海爱婴室商务服务股份有限公司",
                "registrationCapital": "75000000",
                "representitive": "施琼",
                "scale": 75000000,
                "scope": "电子商务领域、计算机软件、网络系统等上述专业技术领域的技术开发、技术转让、技术咨询及技术服务，商务信息咨询（除经纪），市场营销服务；日用百货、电子产品、化工产品（除危险化学品、监控化学品、烟花爆竹、民用爆炸物品、易制毒化学品）、塑料制品、预包装食品（不含熟食卤味、冷冻冷藏）的批发、佣金代理（拍卖除外）、进出口及相关配套业务；自有家用电器的租赁业务。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "57184747": {
                "companyId": 57184747,
                "companyType": "合伙企业",
                "establishDate": "2014-09-03",
                "industry": "",
                "name": "北京中海实创投资管理中心(有限合伙)",
                "registrationCapital": "0",
                "representitive": "北京中海长益投资管理中心（有限合伙）（委派徐工为代表）",
                "scale": 0,
                "scope": "投资管理。（依法须经批准的项目，经相关部门批准后方可开展经营活动）（下期出资时间为2017年08月20日。）"
            },
            "57211580": {
                "companyId": 57211580,
                "companyType": "其他有限责任公司",
                "establishDate": "2003-03-17",
                "industry": "环保",
                "name": "北京中关村国际环保产业促进中心有限公司",
                "registrationCapital": "34000000",
                "representitive": "徐云",
                "scale": 34000000,
                "scope": "互联网信息服务；批发（非实物方式）预包装食品；技术开发；技术服务；货物进出口、技术进出口、代理进出口。（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57253418": {
                "companyId": 57253418,
                "companyType": "其他非上市股份有限公司",
                "establishDate": "1991-07-22",
                "industry": "",
                "name": "石家庄永生集团股份有限公司",
                "registrationCapital": "105000000",
                "representitive": "付新敏",
                "scale": 105000000,
                "scope": "建筑装饰材料（木材除外）、钢材、五金交电、服装鞋帽、日用百货、一般劳保用品、化妆品、洗涤用品、家用电器、电子产品、液晶材料、机电产品（不含汽车）、汽车配件、汽车装具的销售，房地产开发、物业管理、房屋租赁、酒店管理、展览展示。"
            },
            "57314392": {
                "companyId": 57314392,
                "companyType": "其他有限责任公司",
                "establishDate": "2007-12-17",
                "industry": "",
                "name": "北京中环园科技发展有限公司",
                "registrationCapital": "5000000",
                "representitive": "李忠辉",
                "scale": 5000000,
                "scope": "物业管理；城市园林绿化；技术开发、技术服务、技术培训；销售日用杂货、化妆品、针纺织品、服装、鞋帽、钟表、眼镜、箱、包；经济贸易咨询、企业管理咨询；承办展览展示活动 。(依法须经批准的项目，经相关部门批准后方可开展经营活动)（领取本执照后，应到住房城乡建设部、市园林绿化局取得行政许可。）"
            },
            "57389324": {
                "companyId": 57389324,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-05-10",
                "industry": "房地产开发",
                "name": "北京德成置地房地产开发有限公司",
                "registrationCapital": "100000000",
                "representitive": "栾京亮",
                "scale": 100000000,
                "scope": "房地产开发；土地开发整理；销售自行开发的商品房；房地产信息咨询（中介除外）；建设工程项目管理；投资管理；物业管理。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "57389338": {
                "companyId": 57389338,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-07-03",
                "industry": "房地产开发",
                "name": "北京德成兴业房地产开发有限公司",
                "registrationCapital": "200000000",
                "representitive": "栾京亮",
                "scale": 200000000,
                "scope": "房地产开发；建设工程项目管理。"
            },
            "57426524": {
                "companyId": 57426524,
                "companyType": "其他有限责任公司",
                "establishDate": "2003-12-02",
                "industry": "房地产开发",
                "name": "北京实创投资顾问有限责任公司",
                "registrationCapital": "1000000",
                "representitive": "赵玉华",
                "scale": 1000000,
                "scope": "从事房地产经纪业务；工程招标代理；法律、行政法规、国务院决定禁止的，不得经营；法律、行政法规、国务院决定规定应经许可的，经审批机关批准并经工商行政管理机关登记注册后方可经营；法律、行政法规、国务院决定未规定许可的，自主选择经营项目开展经营活动。"
            },
            "57426526": {
                "companyId": 57426526,
                "companyType": "非国有有限责任公司",
                "establishDate": "2005-03-30",
                "industry": "医疗/护理/卫生",
                "name": "北京诚志门诊部有限公司",
                "registrationCapital": "3000000",
                "representitive": "李涛",
                "scale": 3000000,
                "scope": "零售预包装食品（食品流通许可证有效期至2018年08月31日）；经营保健食品（食品卫生许可证有效期至2019年09月05日）；呼吸内科专业；消化内科专业；心血管内科专业；普通外科专业；妇科专业；眼科；中医科；耳鼻咽喉科；口腔内科专业；正畸专业；口腔修复专业；临床体液；血液专业；Ｘ线诊断专业；超声诊断专业；心电诊断专业（医疗机构执业许可证有效期至2020年12月31日）；零售预包装食品；（食品流通许可证有效期至2018年8月31日）；经营保健食品；（食品卫生许可证有效期至2019年9月5日）。（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57426528": {
                "companyId": 57426528,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-07-25",
                "industry": "房地产开发",
                "name": "北京实创上地佳园房地产开发有限公司",
                "registrationCapital": "10000000",
                "representitive": "吴世建",
                "scale": 10000000,
                "scope": "房地产项目开发；销售商品房 。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57426531": {
                "companyId": 57426531,
                "companyType": "其他有限责任公司",
                "establishDate": "2005-12-28",
                "industry": "",
                "name": "北京实创信通科技发展有限公司",
                "registrationCapital": "5480000",
                "representitive": "吕喜芹",
                "scale": 5480000,
                "scope": "法律、行政法规、国务院决定禁止的，不得经营；法律、行政法规、国务院决定规定应经许可的，经审批机关批准并经工商行政管理机关登记注册后方可经营；法律、行政法规、国务院决定未规定许可的，自主选择经营项目开展经营活动。（“实缴注册资本５４８万元，其中非专利技术出资２４８万元，为非专利‘东盟医药平台技术’ ”。）"
            },
            "57426532": {
                "companyId": 57426532,
                "companyType": "非国有有限责任公司",
                "establishDate": "2001-04-28",
                "industry": "其他",
                "name": "北京中关村永丰产业基地发展有限公司",
                "registrationCapital": "300000000",
                "representitive": "赵玉华",
                "scale": 300000000,
                "scope": "房地产开发。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "57426533": {
                "companyId": 57426533,
                "companyType": "其他有限责任公司",
                "establishDate": "2013-06-01",
                "industry": "",
                "name": "上海艾克斯特信息科技有限公司",
                "registrationCapital": "500000",
                "representitive": "孙自强",
                "scale": 500000,
                "scope": "信息科技、数码科技、计算机软硬件技术领域内的技术开发、技术转让、技术咨询、技术服务，广告的设计、制作、代理、发布，旅游咨询（不得从事旅行社业务），会务服务，展览展示服务，日用百货、家居用品、办公用品、衣服鞋帽、化妆品、电子产品、计算机、软件及辅助设备（除计算机信息系统安全专用产品）、通讯设备（除卫星电视广播地面接收设施）、工艺美术品的销售，电子商务（不得从事增值电信、金融业务）。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "57426534": {
                "companyId": 57426534,
                "companyType": "其他有限责任公司",
                "establishDate": "2003-06-05",
                "industry": "",
                "name": "北京艾克斯特工业智能技术有限公司",
                "registrationCapital": "8000000",
                "representitive": "尤大江",
                "scale": 8000000,
                "scope": "技术开发、技术转让、技术咨询、技术服务；基础软件服务。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57426536": {
                "companyId": 57426536,
                "companyType": "非国有有限责任公司",
                "establishDate": "1994-01-08",
                "industry": "建筑/建材/工程房地产",
                "name": "北京威凯建设发展有限责任公司",
                "registrationCapital": "1000000000",
                "representitive": "陈晓智",
                "scale": 1000000000,
                "scope": "房地产开发、危旧房改造；房屋拆除；经营销售商品房；家居装饰；房屋拆迁；房地产信息咨询（除中介服务）；销售百货、金属材料、民用建材、汽车配件、木材、建筑材料。"
            },
            "57426537": {
                "companyId": 57426537,
                "companyType": "非国有有限责任公司",
                "establishDate": "2014-05-13",
                "industry": "",
                "name": "珲春瀚华房地产开发有限公司",
                "registrationCapital": "10000000",
                "representitive": "庄宁",
                "scale": 10000000,
                "scope": "房地产开发与经营（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57426549": {
                "companyId": 57426549,
                "companyType": "非国有有限责任公司",
                "establishDate": "2005-05-19",
                "industry": "",
                "name": "北京艾克斯特数字技术有限公司",
                "registrationCapital": "1000000",
                "representitive": "戴强",
                "scale": 1000000,
                "scope": "技术开发、技术服务、技术咨询；基础软件服务、应用软件服务；计算机系统服务；销售计算机、软件及辅助设备。（未取得行政许可的项目除外）（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444497": {
                "companyId": 57444497,
                "companyType": "非国有有限责任公司",
                "establishDate": "2006-10-17",
                "industry": "",
                "name": "承德怡达仓储物流有限公司",
                "registrationCapital": "6000000",
                "representitive": "李志民",
                "scale": 6000000,
                "scope": "仓储（不含国家规定需要审批的品种及危险物品）、装卸、搬运、包装、流通加工、配送、普通货物运输***（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444498": {
                "companyId": 57444498,
                "companyType": "非国有有限责任公司",
                "establishDate": "2014-07-30",
                "industry": "",
                "name": "青州市怡达山楂食品有限公司",
                "registrationCapital": "200000",
                "representitive": "李志民",
                "scale": 200000,
                "scope": "蜜饯加工、销售（有效期限以许可证为准）(依法须经批准的项目，经相关部门批准后方可开展经营活动)。"
            },
            "57444500": {
                "companyId": 57444500,
                "companyType": "非国有有限责任公司",
                "establishDate": "2015-06-03",
                "industry": "",
                "name": "浙江爱婴室商贸有限公司",
                "registrationCapital": "50000000",
                "representitive": "施琼",
                "scale": 50000000,
                "scope": "一般经营项目：设计、制作、利用自有媒体发布各类广告；销售（含网上销售）：初级食用农产品、日用百货、服装、玩具、文教用品、电子产品、化工产品（除危险化学品、监控化学品、烟花爆竹、民用爆竹物品、易制毒化学品）、塑料制品、第一类医疗器械；摄影服务；健身服务；会务服务；展览展示服务；票务代理；经济信息咨询服务。"
            },
            "57444502": {
                "companyId": 57444502,
                "companyType": "分公司",
                "establishDate": "2012-04-09",
                "industry": "",
                "name": "上海爱婴室商务服务股份有限公司第一分公司",
                "registrationCapital": "0",
                "representitive": "施琼",
                "scale": 0,
                "scope": "商务信息咨询（除经纪）、日用百货、电子产品、化工产品（除危险化学品、监控化学品、烟花爆竹、民用爆炸物品、易制毒化学品）、塑料制品的批发。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "57444503": {
                "companyId": 57444503,
                "companyType": "其他有限责任公司",
                "establishDate": "2008-02-05",
                "industry": "",
                "name": "上海亲蓓母婴用品有限公司",
                "registrationCapital": "50000000",
                "representitive": "施琼",
                "scale": 50000000,
                "scope": "电子商务（不得从事增值电信、金融业务），设计、制作、利用自有媒体发布广告，会务服务，展览展示服务，食用农产品、日用百货、服装、玩具、文教用品、电子产品、化工产品（除危险化学品、监控化学品、烟花爆竹、民用爆炸物品、易制毒化学品）、塑料制品、一类医疗器械、家用电器的销售，商务信息咨询（除经纪），仓储（除危险品），第三方物流服务（不得从事运输）；普通货运；预包装食品（不含熟食卤味、冷冻冷藏）、乳制品（含婴幼儿配方乳粉）批发。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "57444504": {
                "companyId": 57444504,
                "companyType": "非国有有限责任公司",
                "establishDate": "2005-07-25",
                "industry": "",
                "name": "宝鸡秦宝良种牛繁育有限责任公司",
                "registrationCapital": "3000000",
                "representitive": "史文岐",
                "scale": 3000000,
                "scope": "奶牛饲养；肉牛良种繁育、育肥；技术咨询服务；饲料加工，优质牧草推广（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444505": {
                "companyId": 57444505,
                "companyType": "非国有有限责任公司",
                "establishDate": "2010-02-03",
                "industry": "",
                "name": "杨凌秦宝牛业有限公司",
                "registrationCapital": "40000000",
                "representitive": "史文利",
                "scale": 40000000,
                "scope": "良种牛繁育、养殖；饲料销售；优质牧草推广；有机肥生产、销售；牲畜粪便及污物污水处理；动物养殖技术培训、咨询、服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444506": {
                "companyId": 57444506,
                "companyType": "非国有有限责任公司",
                "establishDate": "2007-11-30",
                "industry": "",
                "name": "承德怡达农产品初加工有限公司",
                "registrationCapital": "8000000",
                "representitive": "李志民",
                "scale": 8000000,
                "scope": "农产品收购、初级加工、销售***"
            },
            "57444507": {
                "companyId": 57444507,
                "companyType": "非国有有限责任公司",
                "establishDate": "2008-12-04",
                "industry": "",
                "name": "宝鸡富农良种牛繁育有限公司",
                "registrationCapital": "3000000",
                "representitive": "姚志团",
                "scale": 3000000,
                "scope": "良种繁育(种牛除外)、肉牛育肥、饲养、技术咨询服务、优质牧草推广。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444508": {
                "companyId": 57444508,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-04-03",
                "industry": "",
                "name": "灵台县现代肉牛产业(园)有限公司",
                "registrationCapital": "60000000",
                "representitive": "方平",
                "scale": 60000000,
                "scope": "良种牛繁育、养殖，饲料销售，优质牧草推广，有机肥生产、销售，动物养殖技术培训、咨询服务，牲畜粪便及污物污水处理。"
            },
            "57444511": {
                "companyId": 57444511,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-04-18",
                "industry": "",
                "name": "延安·黄龙优质肉牛产业园有限责任公司",
                "registrationCapital": "20000000",
                "representitive": "赵晖",
                "scale": 20000000,
                "scope": "良种肉牛繁育、养殖、销售；饲料的生产销售；优质牧草推广；有机肥生产、销售；牲畜粪便及污物污水处理；动物养殖技术培训、咨询、服务等。"
            },
            "57444513": {
                "companyId": 57444513,
                "companyType": "非国有有限责任公司",
                "establishDate": "2010-08-19",
                "industry": "",
                "name": "杨凌秦宝食品有限公司",
                "registrationCapital": "6000000",
                "representitive": "史文利",
                "scale": 6000000,
                "scope": "肉制品加工技术的研究、开发；肉类产品的深加工及销售；肉类产品的进出口经营。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444537": {
                "companyId": 57444537,
                "companyType": "非国有有限责任公司",
                "establishDate": "2009-12-30",
                "industry": "",
                "name": "镇江江南环保科技有限公司",
                "registrationCapital": "2000000",
                "representitive": "徐俊生",
                "scale": 2000000,
                "scope": "大气污染治理环保技术的研发、转让；大气污染治理环保材料及设备的研发、制造、销售；环保设备的安装。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444540": {
                "companyId": 57444540,
                "companyType": "分公司",
                "establishDate": "2011-11-11",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司天桥店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444541": {
                "companyId": 57444541,
                "companyType": "非国有有限责任公司",
                "establishDate": "2005-06-03",
                "industry": "",
                "name": "南京新世纪环保工程运行有限公司",
                "registrationCapital": "10000000",
                "representitive": "徐俊生",
                "scale": 10000000,
                "scope": "环保工程系统及装置的运行、管理；硫酸铵的销售；复合肥、尿素的零售；自营和代理各类商品及技术的进出口业务（国家限定企业进出口的商品和技术除外、危险品除外）；装卸搬运服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57444542": {
                "companyId": 57444542,
                "companyType": "分公司",
                "establishDate": "2011-11-07",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司清河店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品；销售文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出票、电影票；货物进出口；信息咨询（不含中介服务）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444543": {
                "companyId": 57444543,
                "companyType": "分公司",
                "establishDate": "2011-11-28",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司朝内小街店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品；零售新鲜水果、文化用品、办公设备、机械设备、日用杂货、针纺织品、花卉、日用品、化妆品、旅游景点门票、文艺演出票、电影票；普通货运；经济信息咨询。(依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444544": {
                "companyId": 57444544,
                "companyType": "分公司",
                "establishDate": "2011-04-07",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司弘燕路店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444546": {
                "companyId": 57444546,
                "companyType": "分公司",
                "establishDate": "2011-08-05",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司小庄店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。(销售食品、道路货物运输以及依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444547": {
                "companyId": 57444547,
                "companyType": "分公司",
                "establishDate": "2011-05-09",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司石佛营店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。(销售食品、道路货物运输以及依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444548": {
                "companyId": 57444548,
                "establishDate": "2011-10-24",
                "industry": "",
                "name": "金果园老农(西安)商贸有限公司",
                "registrationCapital": "4000000",
                "representitive": "孙庆辉",
                "scale": 4000000,
                "scope": "许可经营项目：预包装食品，文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉的批发、零售（零售项目仅限分支机构经营）；信息咨询（不含中介服务，法律法规规定需办理行政许可的项目除外）。（涉及行政许可的项目，取得相关许可后再有效期内经营）"
            },
            "57444549": {
                "companyId": 57444549,
                "companyType": "分公司",
                "establishDate": "2011-01-12",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司皂君庙店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444550": {
                "companyId": 57444550,
                "companyType": "分公司",
                "establishDate": "2009-09-18",
                "industry": "快速消费品(食品、饮料、化妆品)",
                "name": "金果园老农(北京)食品股份有限公司销售分公司",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发（非实物方式）预包装食品。"
            },
            "57444551": {
                "companyId": 57444551,
                "companyType": "分公司",
                "establishDate": "2012-12-27",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司工体路店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444552": {
                "companyId": 57444552,
                "companyType": "分公司",
                "establishDate": "2010-09-09",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司朝阳望京店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品。销售文具用品、日用品、花卉。"
            },
            "57444553": {
                "companyId": 57444553,
                "companyType": "分公司",
                "establishDate": "2012-01-18",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司林萃路店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。(销售食品、道路货物运输以及依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444554": {
                "companyId": 57444554,
                "companyType": "分公司",
                "establishDate": "2011-05-30",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司方庄桥南店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品 。(依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444555": {
                "companyId": 57444555,
                "companyType": "分公司",
                "establishDate": "2012-02-23",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司望京阜荣街店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品（含其它）；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出门票、电影票；货物进出口；信息咨询（不含中介服务）。(销售食品、道路货物运输以及依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。)"
            },
            "57444556": {
                "companyId": 57444556,
                "companyType": "分公司",
                "establishDate": "2010-10-08",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司双井店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "批发兼零售预包装食品、散装食品；道路货物运输；销售水果、土产品、文化用品、办公设备、机械设备、日用杂货、百货、针纺织品、花卉、日化用品、化妆品、旅游景点门票、文艺演出票、电影票；货物进出口；信息咨询（不含中介服务）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444557": {
                "companyId": 57444557,
                "companyType": "分公司",
                "establishDate": "2010-09-17",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司建外店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品、散装食品。销售文具用品、日用杂货、针纺织品、花卉。"
            },
            "57444559": {
                "companyId": 57444559,
                "companyType": "分公司",
                "establishDate": "2013-09-18",
                "industry": "",
                "name": "金果园老农(北京)食品股份有限公司北三环西路店",
                "registrationCapital": "0",
                "representitive": "张善京",
                "scale": 0,
                "scope": "零售预包装食品（食品流通许可证有效期至2016年06月13日）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57444566": {
                "companyId": 57444566,
                "companyType": "非国有有限责任公司",
                "establishDate": "2013-03-04",
                "industry": "",
                "name": "南京新世纪江南环保科技发展有限公司",
                "registrationCapital": "80000000",
                "representitive": "徐俊生",
                "scale": 80000000,
                "scope": "大气污染治理环保技术研发、转让；大气污染治理环保材料及设备的研发、制造、销售和安装；新型金属复合材料制品、金属制品的加工、制造、销售和安装。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57529878": {
                "companyId": 57529878,
                "companyType": "非国有非上市股份有限公司",
                "establishDate": "2007-05-15",
                "industry": "互联网/电子商务互联网/电子商务",
                "name": "中网数据(北京)股份有限公司",
                "registrationCapital": "5000000",
                "representitive": "孙远根",
                "scale": 5000000,
                "scope": "数据处理（数据处理中的银行卡中心、PUE值在1.5以上的云计算数据中心除外）；技术开发、技术转让、技术咨询、技术服务；计算机系统服务；计算机维修；销售计算机、软件及辅助设备、电子产品、通讯设备。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57592879": {
                "companyId": 57592879,
                "companyType": "非国有有限责任公司",
                "establishDate": "2006-12-27",
                "industry": "",
                "name": "北京威凯体育文化发展有限公司",
                "registrationCapital": "7500000",
                "representitive": "季维刚",
                "scale": 7500000,
                "scope": "组织文化艺术交流活动（不含演出）；文艺创作；会议服务、承办展览展示活动；体育运动项目经营（不含高尔夫球场）。（依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动。）"
            },
            "57637764": {
                "companyId": 57637764,
                "companyType": "其他有限责任公司",
                "establishDate": "2002-05-16",
                "industry": "物业管理/商业中心",
                "name": "北京德成永信物业管理有限公司",
                "registrationCapital": "3000000",
                "representitive": "林建新",
                "scale": 3000000,
                "scope": "物业管理；机动车公共停车场服务；求职、用人登记，用人登记；介绍地区之间、单位之间的劳务输出与输入；介绍家政服务人员；介绍医疗陪护；劳动保障事务代理。（人力资源服务许可证有效期至2019年3月31日）。（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57672531": {
                "companyId": 57672531,
                "companyType": "非国有有限责任公司",
                "establishDate": "1996-11-18",
                "industry": "",
                "name": "北京羲和物业管理有限责任公司",
                "registrationCapital": "1000000",
                "representitive": "李灵",
                "scale": 1000000,
                "scope": "物业管理（含出租房屋）；销售开发后的产品、机械电子设备、金属材料、木材、百货、文化体育用品、五金交电、化工产品（不含危险化学品及一类易制毒化学品。）、工艺美术品、花卉、汽车配件、建筑材料；家居装饰；园林绿化；提供劳务服务；房地产咨询；体育健身；摄影；彩扩；经济贸易咨询；技术开发、咨询、服务、培训、转让；商业设施租赁；停车场经营；从事房地产经纪业务；热力供应。（依法须经批准的项目，经相关部门批准后方可开展经营活动）"
            },
            "57672532": {
                "companyId": 57672532,
                "companyType": "其他有限责任公司",
                "establishDate": "1993-06-02",
                "industry": "房地产开发",
                "name": "北京富利房地产开发有限责任公司",
                "registrationCapital": "30000000",
                "representitive": "陈晓智",
                "scale": 30000000,
                "scope": "房地产开发；专业承包；销售自行开发的商品房、建筑材料、金属材料、化工产品（不含一类易制毒化学品及危险化学品）、木材、机械电器设备；经济信息咨询。"
            },
            "57672533": {
                "companyId": 57672533,
                "companyType": "全民所有制",
                "establishDate": "1997-10-14",
                "industry": "建筑/建材/工程房地产",
                "name": "北京实创博威建筑设计院",
                "registrationCapital": "3000000",
                "representitive": "赵绪清",
                "scale": 3000000,
                "scope": "建筑工程设计，建筑工程技术咨询，装饰设计；城市园林绿化；室内家居装饰；房地产信息咨询。（未取得行政许可的项目除外）"
            },
            "57672557": {
                "companyId": 57672557,
                "companyType": "非国有有限责任公司",
                "establishDate": "2003-07-08",
                "industry": "",
                "name": "北京德成永兴餐饮有限公司",
                "registrationCapital": "1000000",
                "representitive": "孙锦山",
                "scale": 1000000,
                "scope": "中餐（含冷荤凉菜）、饮料、酒；技术服务。（法律、行政法规、国务院决定禁止的，不得经营；法律、行政法规、国务院决定规定应经许可的，经审批机关批准并经工商行政管理机关登记注册后方可经营；法律、行政法规、国务院决定未规定许可的，自主选择经营项目开展经营活动。）（其中实物出资为30.0万元）"
            },
            "57672558": {
                "companyId": 57672558,
                "companyType": "非国有有限责任公司",
                "establishDate": "2004-11-10",
                "industry": "",
                "name": "北京众生北清加油站有限公司",
                "registrationCapital": "1000000",
                "representitive": "徐雪峰",
                "scale": 1000000,
                "scope": "零售成品油；洗车服务；出租商业用房。（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57672559": {
                "companyId": 57672559,
                "companyType": "非国有有限责任公司",
                "establishDate": "2004-11-10",
                "industry": "",
                "name": "北京众生永丰加油站有限公司",
                "registrationCapital": "1000000",
                "representitive": "徐雪峰",
                "scale": 1000000,
                "scope": "零售成品油；洗车服务；出租商业用房。（企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。）"
            },
            "57672560": {
                "companyId": 57672560,
                "companyType": "非国有有限责任公司",
                "establishDate": "2006-12-06",
                "industry": "环保",
                "name": "北京永丰永续园林工程有限公司",
                "registrationCapital": "2000000",
                "representitive": "许继怀",
                "scale": 2000000,
                "scope": "法律、行政法规、国务院决定禁止的，不得经营；法律、行政法规、国务院决定规定应经许可的，经审批机关批准并经工商行政管理机关登记注册后方可经营；法律、行政法规、国务院决定未规定许可的，自主选择经营项目开展经营活动。"
            },
            "57672562": {
                "companyId": 57672562,
                "companyType": "其他有限责任公司",
                "establishDate": "2001-11-21",
                "industry": "石油/化工/矿产/地质",
                "name": "北京德成自然绿化工程有限公司",
                "registrationCapital": "1000000",
                "representitive": "柳仁萍",
                "scale": 1000000,
                "scope": "园林绿化工程；园林设计。(企业依法自主选择经营项目，开展经营活动；依法须经批准的项目，经相关部门批准后依批准的内容开展经营活动；不得从事本市产业政策禁止和限制类项目的经营活动。)"
            },
            "58120903": {
                "companyId": 58120903,
                "companyType": "其他有限责任公司上市",
                "establishDate": "2012-02-10",
                "industry": "商务服务业 - 商务服务业",
                "name": "上海赛佳企业管理有限公司",
                "registrationCapital": "5000000",
                "representitive": "贾志超",
                "scale": 5000000,
                "scope": "企业管理，资产管理，投资管理。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "58167702": {
                "companyId": 58167702,
                "companyType": "合伙企业上市",
                "establishDate": "2013-03-05",
                "industry": "商务服务业 - 商务服务业",
                "name": "上海恒岚投资管理合伙企业(有限合伙)",
                "registrationCapital": "0",
                "representitive": "上海赛佳企业管理有限公司",
                "scale": 0,
                "scope": "投资管理，资产管理，实业投资，企业管理咨询。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "58194627": {
                "companyId": 58194627,
                "companyType": "其他有限责任公司",
                "establishDate": "2011-07-21",
                "industry": "商务服务业 - 商务服务业",
                "name": "上海创恒投资管理有限公司",
                "registrationCapital": "5000000",
                "representitive": "贾志超",
                "scale": 5000000,
                "scope": "实业投资，投资管理，投资咨询（除金融、证券），企业管理，创业投资，资产管理，商务咨询，计算机、软件及辅助设备的销售（除计算机信息系统安全专用产品）及计算机软件的技术开发、技术咨询、技术转让、技术服务，燃料油（除危险化学品）、化工产品（除危险化学品、监控化学品、烟花爆竹、民用爆炸物品、易制毒化学品）、橡塑制品、金属材料、金属制品、机电设备、五金交电、机械设备、汽车配件、焦炭、钢材的销售，从事货物及技术的进出口业务。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】"
            },
            "58229859": {
                "companyId": 58229859,
                "name": "银川市商业银行股份有限公司新华西街支行"
            },
            "58229871": {
                "companyId": 58229871,
                "name": "银川市商业银行民族北街支行"
            },
            "58229909": {
                "companyId": 58229909,
                "name": "银川市商业银行股份有限公司西塔支行"
            },
            "58229961": {
                "companyId": 58229961,
                "name": "银川市商业银行利民支行"
            },
            "58230248": {
                "companyId": 58230248,
                "name": "银川市商业银行股份有限公司光华支行"
            },
            "58230427": {
                "companyId": 58230427,
                "name": "银川市商业银行上海路支行"
            },
            "58230487": {
                "companyId": 58230487,
                "name": "银川市商业银行股份有限公司湖滨支行"
            },
            "58230662": {
                "companyId": 58230662,
                "name": "宁夏银行股份有限公司石油城支行"
            },
            "58230667": {
                "companyId": 58230667,
                "name": "银川市商业银行新华支行"
            },
            "58230960": {
                "companyId": 58230960,
                "name": "银川市商业银行股份有限公司中山支行"
            },
            "58231041": {
                "companyId": 58231041,
                "name": "银川市商业银行股份有限公司新世纪支行"
            },
            "58231136": {
                "companyId": 58231136,
                "name": "银川市商业银行股份有限公司火车站支行"
            },
            "58231403": {
                "companyId": 58231403,
                "name": "银川市商业银行光明支行"
            },
            "58231430": {
                "companyId": 58231430,
                "name": "银川市商业银行西城支行"
            },
            "58231535": {
                "companyId": 58231535,
                "name": "银川市商业银行股份有限公司永康支行"
            },
            "58231574": {
                "companyId": 58231574,
                "name": "银川市商业银行开发区支行"
            },
            "58231627": {
                "companyId": 58231627,
                "name": "银川市商业银行股份有限公司上海路支行"
            },
            "58231745": {
                "companyId": 58231745,
                "name": "银川市商业银行股份有限公司中宁支行"
            },
            "58231823": {
                "companyId": 58231823,
                "name": "银川市商业银行北环支行"
            },
            "58231841": {
                "companyId": 58231841,
                "name": "银川市商业银行股份有限公司商城支行"
            },
            "58231894": {
                "companyId": 58231894,
                "name": "宁夏商业银行股份有限公司光华支行"
            },
            "58231917": {
                "companyId": 58231917,
                "name": "银川市商业银行股份有限公司凤凰支行"
            },
            "58232048": {
                "companyId": 58232048,
                "name": "银川市商业银行新市区支行"
            },
            "58232110": {
                "companyId": 58232110,
                "name": "银川市商业银行股份有限公司丽景支行"
            },
            "58232156": {
                "companyId": 58232156,
                "name": "银川市商业银行股份有限公司新市区支行"
            },
            "58232423": {
                "companyId": 58232423,
                "name": "银川市商业银行股份有限公司兴庆支行"
            },
            "58232453": {
                "companyId": 58232453,
                "name": "银川市商业银行新华西街支行"
            },
            "58232462": {
                "companyId": 58232462,
                "name": "银川市商业银行西门支行"
            },
            "58232519": {
                "companyId": 58232519,
                "name": "银川市商业银行新城支行"
            },
            "58232702": {
                "companyId": 58232702,
                "name": "银川市商业银行民生支行"
            },
            "58232911": {
                "companyId": 58232911,
                "name": "银川市商业银行东城支行"
            },
            "58233045": {
                "companyId": 58233045,
                "name": "银川市商业银行股份有限公司科技支行"
            },
            "58233166": {
                "companyId": 58233166,
                "name": "银川市商业银行股份有限公司西城支行"
            },
            "58233531": {
                "companyId": 58233531,
                "name": "银川市商业银行商城支行"
            },
            "58233608": {
                "companyId": 58233608,
                "name": "银川市商业银行股份有限公司光明支行"
            },
            "58233626": {
                "companyId": 58233626,
                "name": "银川市商业银行股份有限公司石油城支行"
            },
            "58233774": {
                "companyId": 58233774,
                "name": "银川市商业银行股份有限公司新华支行"
            },
            "58233882": {
                "companyId": 58233882,
                "name": "银川市商业银行股份有限公司中卫支行"
            },
            "58234025": {
                "companyId": 58234025,
                "name": "银川市商业银行广场支行"
            },
            "58234231": {
                "companyId": 58234231,
                "name": "银川市商业银行中山支行"
            },
            "58234446": {
                "companyId": 58234446,
                "name": "银川市商业银行西塔支行"
            },
            "58234525": {
                "companyId": 58234525,
                "name": "宁夏银行股份有限公司中卫支行"
            },
            "58234614": {
                "companyId": 58234614,
                "name": "银川市商业银行股份有限公司利民支行"
            },
            "58234636": {
                "companyId": 58234636,
                "name": "银川市商业银行湖滨支行"
            },
            "58234641": {
                "companyId": 58234641,
                "name": "银川市商业银行股份有限公司开发区支行"
            },
            "58234679": {
                "companyId": 58234679,
                "name": "银川市商业银行股份有限公司新城支行"
            },
            "58234737": {
                "companyId": 58234737,
                "name": "银川市商业银行兴庆支行"
            },
            "58235088": {
                "companyId": 58235088,
                "name": "银川市商业银行股份有限公司东城支行"
            },
            "58235330": {
                "companyId": 58235330,
                "name": "银川市商业银行科技支行"
            },
            "58235545": {
                "companyId": 58235545,
                "name": "银川市商业银行股份有限公司北环支行"
            },
            "58235645": {
                "companyId": 58235645,
                "name": "银川市商业银行丽景支行"
            },
            "58235704": {
                "companyId": 58235704,
                "name": "银川市商业银行永康支行"
            },
            "58235722": {
                "companyId": 58235722,
                "name": "银川市商业银行营业部"
            },
            "58235761": {
                "companyId": 58235761,
                "name": "银川市商业银行股份有限公司民生支行"
            },
            "58254101": {
                "companyId": 58254101,
                "name": "金果园老农(北京)食品有限公司海淀分公司"
            },
            "58254459": {
                "companyId": 58254459,
                "name": "金果园老农(北京)食品股份有限公司东直门外店"
            },
            "58254521": {
                "companyId": 58254521,
                "name": "金果园老农(北京)食品股份有限公司白石新桥店"
            },
            "58254601": {
                "companyId": 58254601,
                "name": "金果园老农(北京)食品股份有限公司白石新桥二店"
            },
            "58255022": {
                "companyId": 58255022,
                "name": "金果园老农(北京)食品股份有限公司太阳宫店"
            },
            "58255158": {
                "companyId": 58255158,
                "name": "金果园老农(北京)食品有限公司三里屯南路店"
            },
            "58255342": {
                "companyId": 58255342,
                "name": "金果园老农(北京)食品有限公司西四店"
            },
            "58255596": {
                "companyId": 58255596,
                "name": "宝鸡秦宝良种牛繁育有限公司"
            },
            "58255762": {
                "companyId": 58255762,
                "name": "金果园老农(北京)食品有限公司北太平庄店"
            },
            "58257034": {
                "companyId": 58257034,
                "name": "金果园老农(北京)食品股份有限公司北京站前街店"
            },
            "58257648": {
                "companyId": 58257648,
                "name": "金果园老农(北京)食品股份有限公司崇文门店"
            },
            "58258572": {
                "companyId": 58258572,
                "name": "金果园老农(北京)食品有限公司金宝街店"
            },
            "58258770": {
                "companyId": 58258770,
                "name": "金果园老农(北京)食品股份有限公司九棵树店"
            },
            "58259360": {
                "companyId": 58259360,
                "name": "金果园老农(北京)食品有限公司和平街店"
            },
            "58259404": {
                "companyId": 58259404,
                "name": "金果园老农(北京)食品有限公司蒋宅口店"
            },
            "60064643": {
                "companyId": 60064643,
                "companyType": "NormalCompany",
                "name": "重庆昊海投资有限公司"
            },
            "60064862": {
                "companyId": 60064862,
                "companyType": "FinancialProduct",
                "name": "国泰君安证券股份有限公司约定购回专用账户"
            },
            "60064888": {
                "companyId": 60064888,
                "companyType": "FinancialProduct",
                "name": "中国人寿保险股份有限公司-分红-个人分红-005L-FH002深"
            },
            "60065183": {
                "companyId": 60065183,
                "companyType": "FinancialProduct",
                "name": "诚志集合资产管理计划"
            }
        },
        "personMap": {
            "29191496": {
                "personID": 29191496,
                "personName": "官小欢"
            },
            "29191497": {
                "personID": 29191497,
                "personName": "吴强"
            },
            "29191498": {
                "personID": 29191498,
                "personName": "吴永红"
            }
        },
        "root": {
            "children": [
                {
                    "nid": "56959459",
                    "r": {
                        "shareholdingRatio": 38.01,
                        "type": 3
                    }
                },
                {
                    "children": [
                        {
                            "nid": "58120903",
                            "r": {
                                "type": 3
                            }
                        },
                        {
                            "nid": "58194627",
                            "r": {
                                "type": 3
                            }
                        }
                    ],
                    "nid": "58167702",
                    "r": {
                        "shareholdingRatio": 6.5,
                        "type": 3
                    }
                },
                {
                    "nid": "60064643",
                    "r": {
                        "shareholdingRatio": 6.5,
                        "type": 3
                    }
                },
                {
                    "nid": "60065183",
                    "r": {
                        "shareholdingRatio": 3.12,
                        "type": 3
                    }
                },
                {
                    "nid": "60064862",
                    "r": {
                        "shareholdingRatio": 2.24,
                        "type": 3
                    }
                },
                {
                    "nid": "57253418",
                    "r": {
                        "shareholdingRatio": 1.03,
                        "type": 3
                    }
                },
                {
                    "nid": "p29191496",
                    "r": {
                        "shareholdingRatio": 1.01,
                        "type": 3
                    }
                },
                {
                    "nid": "60064888",
                    "r": {
                        "shareholdingRatio": 0.57,
                        "type": 3
                    }
                },
                {
                    "nid": "p29191497",
                    "r": {
                        "shareholdingRatio": 0.44,
                        "type": 3
                    }
                },
                {
                    "nid": "p29191498",
                    "r": {
                        "shareholdingRatio": 0.39,
                        "type": 3
                    }
                },
                {
                    "nid": "56965266",
                    "r": {
                        "type": 2
                    }
                },
                {
                    "nid": "56974739",
                    "r": {
                        "type": 2
                    }
                },
                {
                    "children": [
                        {
                            "children": [
                                {
                                    "children": [
                                        {
                                            "nid": "57672532",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57592879",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672533",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672531",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57426536",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57389338",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57389324",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57637764",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672560",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672559",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672558",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672557",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57672562",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57426532",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57005159",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57211580",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57314392",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57051988",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57426528",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57426531",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57426524",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57529878",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57184747",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "57092005",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57091999",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092000",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "children": [
                                {
                                    "nid": "57426534",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57091996",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57426549",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57426533",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "57092001",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "children": [
                                {
                                    "children": [
                                        {
                                            "nid": "57426534",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57091996",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57426549",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57426533",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57092001",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "57091998",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57091996",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57036415",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "children": [
                                {
                                    "children": [
                                        {
                                            "nid": "56967403",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "56967405",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "56967401",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "56967404",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "56967402",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "56980127",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "56950834",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57444566",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444541",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444537",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57104847",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "58255596",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444508",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444505",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444511",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444513",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444507",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444504",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57104846",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57444502",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444503",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444500",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57104996",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57444506",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444497",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57444498",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57104851",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "57444551",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444542",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444550",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444540",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444556",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444547",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444543",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444549",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444559",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444557",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444544",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444552",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444554",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444555",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444553",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444546",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58255158",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58255762",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58259360",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58254101",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58259404",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58255342",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58258572",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58254459",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58258770",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58257034",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58255022",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58257648",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58254601",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "58254521",
                                            "r": {
                                                "type": 2
                                            }
                                        },
                                        {
                                            "nid": "57444548",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "57104911",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "56967406",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56974741",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "nid": "57092019",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092010",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57089609",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092014",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56965267",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974745",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "children": [
                                {
                                    "nid": "57034411",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034416",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034429",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034425",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034439",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034398",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034407",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034428",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034412",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034393",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034430",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034434",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034406",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034404",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034409",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034400",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034396",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034427",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034415",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034432",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034403",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034423",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "57034381",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231841",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234641",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231041",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233774",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58229859",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234679",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232156",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235761",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231535",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231136",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233626",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233045",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233166",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58229909",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235722",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231430",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234446",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232462",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230487",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231894",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234525",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230662",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230427",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232911",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234231",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235645",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231403",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234737",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58229961",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231823",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233531",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234025",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231574",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230667",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232453",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232519",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232048",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58229871",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232702",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235704",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234636",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235330",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231627",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235088",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233882",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231745",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230960",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232110",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58230248",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58233608",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58232423",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58231917",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58234614",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "nid": "58235545",
                                    "r": {
                                        "type": 2
                                    }
                                },
                                {
                                    "children": [
                                        {
                                            "nid": "56950472",
                                            "r": {
                                                "shareholdingRatio": 2.12,
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57082860",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088662",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088672",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088659",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088663",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088657",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088661",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088665",
                                            "r": {
                                                "type": 1
                                            }
                                        },
                                        {
                                            "nid": "57088664",
                                            "r": {
                                                "type": 1
                                            }
                                        }
                                    ],
                                    "nid": "56964709",
                                    "r": {
                                        "type": 1
                                    }
                                },
                                {
                                    "nid": "57034401",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "56959400",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092011",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092013",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56974744",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974746",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "children": [
                                {
                                    "nid": "57426537",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "57092002",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57091995",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56965263",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "nid": "57092012",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092008",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092006",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092009",
                            "r": {
                                "type": 1
                            }
                        },
                        {
                            "nid": "57092016",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56974766",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "nid": "57091992",
                            "r": {
                                "type": 2
                            }
                        }
                    ],
                    "nid": "56965265",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974742",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974743",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974737",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "children": [
                        {
                            "children": [
                                {
                                    "nid": "57426526",
                                    "r": {
                                        "type": 1
                                    }
                                }
                            ],
                            "nid": "57091991",
                            "r": {
                                "type": 1
                            }
                        }
                    ],
                    "nid": "56965264",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974740",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974738",
                    "r": {
                        "type": 1
                    }
                },
                {
                    "nid": "56974747",
                    "r": {
                        "type": 1
                    }
                }
            ],
            "nid": "56950330"
        }
    }
}





var DIAGRAM = {
    DATA:{
        URL:{
            BASE:"",
            TREE_NAMES:"",
            TREE_NODES:"",
            PAIR_NODES:"",
            NODE_NAMES:"",
            SENIORS_DETAIL:""
        },
        setUrl:function(url){
            $.extend(this.URL,url);//将传入的url对象中的的属性与this.URL中的属性合并，若key值相同则替换this.URL中的值，
        },
        SELECTOR: {
            PARENT_TREE: "#container",
            PARENT_FORCE: "#container",

            BASE_TREE: ".diagram-pannel-tree", //控制区域
            BASE_FORCE: ".diagram-pannel-force",
            BASE: ".diagram-pannel",

            TOOLTIP_TREE: "#tooltip_tree", //提示区域
            TOOLTIP_FORCE: "#tooltip_force", //提示区域

            COMPANYINFO: ".board",    //公司信息区域

            // SELECTOR_NODE: ".selecter",   //节点选择区域
            TYPEBOARD: ".typeBoard", //关系提示标签区域
        },
        CONST:{
            DURATION : 550,
            STROKE_WIDTH:3.5,
            CENTER_STROKE_WIDTH: 4,
            LINE_STROKE_WIDTH:1.5,
            SEED_RADIUS:6,
            CENTER_SCALE:6,
            TEXT_SIZE:12,
            TEXT_SIZE_ratio: 10,
            LOCAL_STORAGE_EXPIRE_DAYS:3,
            DEPTH_LENGTH:220,
            COLOR_INVEST:"#ffa23f",
            COLOR_STOCKHOLDER : "#a982be",
            COLOR_CHILD : "#ea4e5b",
            COLOR_ROOT :"#6ac3f7",
            SELECTOR_COMPANYNAME_WIDTH:"200px",
        },
        ERROR_MESSAGE:{
            COMPANYID_NULL: "公司ID不存在！",
            COMPANYID_DATA_NULL: "没有相应的公司数据！",
            STOCKID_NOT_FOUND: "根据股票ID/公司名称找不到公司ID！",
            STOCKID_NULL: "没有传入股票ID/公司名称！",
            STOCKID_REPEAT: "不能为同一公司！",
            CONNECT_ERR: "网络请求失败！",
            RELATION_NOT_FOUND: "公司关系不存在！"
        },
        VAR:{
            windowWidth:1024,
            windowHeight:968,
            eventScale:1, //当前svg放大比例，每当触发zoom时更新
            eventScale_force:1, //force图的svg放大比例
            linkCount: 0, //用于生成link的id属性（在path元素上生成id属性）
            nodeIdCount: 0, //用于生成node的id（在node绑定的data中加入id）
            tableAjax: null, //存放最近一次ajax请求
            companyId: 0,
            centerId: 0,

            selected: false,
            xBeforeDrag: 0,
            yBeforeDrag: 0,

            browserSupportMarker: true
        }
    },
    TOOL:{
        GET:function(url,success,error,always){
            $.get(url).success(function(data){
                 data = JSON.parse(data);//data其实是$get()方法返回的值，而ajax请求中服务器返回的是字符串，所以这里用JSON.parse()方法进行转换，之后将转换后的JSON数据传入success
                if(success) success.call(this,data);
            }).fail(function(e){
                // console.log(DIAGRAM.DATA.ERROR_MESSAGE.CONNECT_ERR+ ":" + e.status + "," + e.statusText);
                if(error) error.call(this);
            }).always(function(data){
                if(always) always.call(this,data);
            })
        },
        STORAGE:{
            setJson:function(name,value){
                var obj = {data:value,timestamp:new Date().getTime()};
                localStorage.setItem(name,JSON.stringify(obj));
            },
            getJson:function(name){
                var value = localStorage.getItem(name);
                if(!value || this.isExpired(value.timestamp)){
                    localStorage.removeItem(name);
                    return null;
                }else{
                    return JSON.parse(value).data;
                }
            },
            isExpired:function(time){
                var now = new Date().getTime();
                return (now - time)/1000/60/60/24 > DIAGRAM.DATA.CONST.LOCAL_STORAGE_EXPIRE_DAYS;
            }
        },
        NumberFormat:function(fSum){
            var re = new RegExp(/^(\d+)(\.\d+)?/); //判断是否是浮点数
            var strSum;
            var behind = "";
            if (re.test(fSum)){
                strSum = new String(fSum);
            } else {
                return "";
            }
            if(strSum.indexOf(".") > -1) {
                behind = strSum.split(".")[1];
                strSum = strSum.split(".")[0];
                if(behind != undefined){
                    behind = "0." + behind;
                    behind = Math.round(Number(behind)*100);
                }
            }
            var len;
            var result = "";
            var temp = "";
            len = strSum.length;
            while(len > 3){
                temp = ","+strSum.substring(len - 3,len);
                strSum = strSum.substring(0,len - 3);
                result = temp + result;
                len = strSum.length;
            }
            if(len > 0) {
                result = strSum + result;
            }
            if(behind!="" && behind !== undefined)
                result += "." + behind;
            return result;
        }
    },
    init:function(data){
        this.DETECT_BROWSER();
        DIAGRAM.DATA.setUrl(data.url);//给DATA.URL赋值
        DIAGRAM.setRP(data.RP);//给RP内容赋值
        DIAGRAM.DATA.SELECTOR.PARENT_TREE = data.container_tree;
        DIAGRAM.DATA.SELECTOR.PARENT_FORCE = data.container_force;
        return this;
    },
    RP:{
        TREE:{
            node_rightClick:true,
            moreInfo:false
        },
        TABINDEX:{
            TREE:null,
            FORCE:null
        },
        tree_moreInfo:function(){},
        changeTab:function(tabIndex){},
        goBack:function(){},
        dataErrorMsg: function(tab,content){},
        openNewCompany:function(companyName){}
    },
    setRP:function(rpdata){
        $.extend(this.RP,rpdata);
    },
    showForce:function(companyId1,companyId2){
        this.RP.changeTab(this.RP.TABINDEX.FORCE);
        if(companyId1 == undefined || companyId2 == undefined){
            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_NULL)
            return;
        }
        if($(DIAGRAM.DATA.SELECTOR.PARENT_FORCE).find(".diagram-bar").length == 0)
            this.FORCE.generate(companyId1, companyId2);
        else
            this.FORCE.DIAGRAM_FORCE.LOAD_DATA(companyId1, companyId2)
    },
    showTreeByStockIdOrName:function(stockId){
        if(stockId == undefined){
            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_NULL)
            return this;
        }
        var url = DIAGRAM.DATA.URL.NODE_NAMES.replace(/\{stockID\}/i,stockId);//将stockId 放进NODE_NAMES中，左边replace应该是用到了正则表达式，有空研究一下。
        //d3.json("../NODE_NAMES_0.json",function(d){
                 if(NODE_NAMES.data[stockId]){//data是获取到的json数据中的属性，
                 DIAGRAM.showTree(NODE_NAMES.data[stockId].id);//将得到的json中的id值传入showTree();
             }

        //})
        // DIAGRAM.TOOL.GET(url,function(d){
        //     /*if(!d.data || !d.data[stockId]){
        //      DIAGRAM.RP.dataErrorMsg(DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_DATA_NULL);
        //      return;
        //      }*/
        //     if(d.data[stockId]){//data是获取到的json数据中的属性，
        //         DIAGRAM.showTree(d.data[stockId].id);//将得到的json中的id值传入showTree();
        //     }
        //     else{
        //         DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_NOT_FOUND)
        //     }
        // },function(){DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_NOT_FOUND)});
        return this;
    },
    showTree: function(companyId){
        this.RP.changeTab(this.RP.TABINDEX.TREE);
        if(companyId == undefined){
            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_NULL)
            return;
        }
        if($(DIAGRAM.DATA.SELECTOR.PARENT_TREE).children().length == 0)//如果"#container1"中没有东西，则调用TREE中的generate方法，从头填补"#container1"中的内容，否则，LOAD_DATA加载数据。
            this.TREE.generate(companyId);
        else
            this.TREE.DIAGRAM_TREE.LOAD_DATA(companyId)
    },
    resizeDiagram:function(width,height){
        if(width !== undefined && height !== undefined){
            $(".diagram-pannel").children("svg").width(width).height(height);
        }else{
            var $parent = $(".diagram-pannel").parent().parent();
            DIAGRAM.DATA.VAR.windowWidth = $parent.width();
            DIAGRAM.DATA.VAR.windowHeight = $parent.height();
            $(".diagram-pannel").children("svg").width($parent.width()).height($parent.height());
            DIAGRAM.TREE.DIAGRAM_TREE.CENTER_NODE(DIAGRAM.TREE.DIAGRAM_TREE.root)
            //DIAGRAM.FORCE.DIAGRAM_FORCE.FIX_NODES();
            DIAGRAM.FORCE.DIAGRAM_FORCE.INIT_FORCE();
        }
    },
    showForceByStockIdOrName:function(stockId1,stockId2){
        if(stockId1 == undefined || stockId2 == undefined){
            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_NULL)
            return;
        }
        else if(stockId1 == stockId2){
            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_REPEAT)
            return;
        }
        var stockId = stockId1+";"+stockId2;
        var url = DIAGRAM.DATA.URL.NODE_NAMES.replace(/\{stockID\}/i,stockId);
        DIAGRAM.TOOL.GET(url,function(d){
            if(d.data && d.data[stockId1] && d.data[stockId2]){
                DIAGRAM.showForce(d.data[stockId1].id, d.data[stockId2].id);
            }
            else{
                DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.STOCKID_NOT_FOUND)
            }
        });
        return this;
    },
    TREE:{
        SVG:null,
        TOOLTIP_TREE: null,
        TYPEBOARD: null,
        SELECTOR_PROPORTION: null,
        SELECTOR_LAYER: null,
        COMPANYINFO:null,
        generate:function(companyId){
            this.INIT_FRAGMENT();//填补"#container1"中除了tree之外的其他元素
            // this.INIT_NODESELECTOR();
            this.LINSTENER_BIND();
            // this.initCompanyInfo();
            this.DIAGRAM_TREE.init(companyId);
        },
        INIT_FRAGMENT:function(){
            var selector = DIAGRAM.DATA.SELECTOR;
            var $parent = $(selector.PARENT_TREE);//
            $parent.html("");
            DIAGRAM.DATA.VAR.windowWidth = $parent.width();
            DIAGRAM.DATA.VAR.windowHeight = $parent.height();
            $parent.append("<div class='" + selector.BASE.replace(".","") + " " + selector.BASE_TREE.replace(".","") + "'></div>")
            var $base = $(selector.BASE_TREE);
            $base.append('<div class="typeBoardWrapper"><div class="' + selector.TYPEBOARD.replace(".","") + '"><div><div class="stockholder-color"></div><label>股东</label></div><div><div class="invest-color"></div><label>投资</label></div><div><div class="child-color"></div><label>子公司</label></div></div></div>')
            if(!DIAGRAM.DATA.VAR.browserSupportMarker){
                $base.append('<div class="IEReminder"><div class="reminder-content">IE浏览器下可能无法查看完整关系图谱，建议使用Chrome或火狐浏览器，获得最佳体验。</div></div>')
            }
            $base.append('<div class="treeDiagram-expend"><a class="expendSelecter">展开&nbsp;<i class="fa "></i></a></div>')
                .append('<div class="diagram-bar treeDiagram-bar"></div>')
                .append('<div class="' + selector.COMPANYINFO.replace(".","") + ' board1"><div class="company_name up"></div><div class="content"><div class="content-inner"><div class="info-top"><div class="co-type sub"><i></i><span>子公司</span></div><span class="sign">上市公司</span> </div><div class="info"><div class="representitive"><span>法定代表：</span></div><div class="registrationCapital"><span>注册资本：</span></div><div class="marketValue"><span>市值：</span></div><div class="establishDate"><span>成立日期：</span></div><div class="scope"><span>主营业务：</span></div></div><div class="info-blank" style="display: none;"><img src="img/new-ui/blank5.png"><p>暂无详细信息</p></div><div class="tables"><ul class="tab_list col3 clearfix"><li class="act shareholders">股东</li><li class="subcompanies">对外投资</li><li class="seniors">主要成员</li></ul><div class="table-wrapper"><div class="preloader"><span></span><span></span><span></span><span></span><span></span><span></span></div><table class="table-shareholders table table-bordered"><thead><tr><th class="left">名称</th><th style="width: 60px">持股比例</th></tr></thead><tbody></tbody></table><table class="table-subcompanies table table-bordered"><thead><tr><th class="left">名称</th><th style="width: 60px">持股比例</th></tr></thead><tbody></tbody></table><table class="table-seniors table table-bordered"><thead><tr><th class="left">姓名</th><th>角色</th></tr></thead><tbody></tbody></table></div></div></div><div class="board-btn"><span href="#123" class="blue-border-btn">查看图谱</span></div></div></div>')
                .append('<div class="loader-showbox"><div class="loader"><svg class="circular" viewBox="25 25 50 50"><circle class="path" cx="50" cy="50" r="20" fill="none" stroke-width="2" stroke-miterlimit="10"/></svg></div>')


            $(".treeDiagram-bar")
                .append('<span>关系层级：</span><div style="display: inline-block;width: 110px;position:relative;"><select class="selecter-layer"><option value="1">一度</option><option value="2">二度</option><option value="3">三度</option><option value="4">四度</option></select><div class="popDetail aUp" style="display: none;"><div class="popDetailInner"><p>当前公司关联节点过多，展示多层关系会影响查看速度和显示效果，建议选择需要研究的节点，逐步展开</p></div></div></div>')
                .append('<span>持股比例：</span><select class="selecter-proportion"><option value="0">大于0%</option><option value="5">大于5%</option><option value="20">大于20%</option><option value="50">大于50%</option></select>')
                .append('<select id="listed_company_or_not"><option value="0">显示全部</option><option value="1">只显示上市公司</option></select>')
                .append('<div><a class="reset-tree">重置</a>|<a class="foldSelecter"><i class="fa "></i>&nbsp;收起</a></div>');
            if(DIAGRAM.RP.TREE.moreInfo){
                $(".treeDiagram-bar").append('<div class="resetDiagram-pannel"><a class="tree_moreInfo">更多</a></div>');
            }
            this.TOOLTIP_TREE = d3.select(selector.BASE_TREE).append("div")
                .attr("id", DIAGRAM.DATA.SELECTOR.TOOLTIP_TREE.replace("#", ""))
                .style("opacity", 0);
            this.TYPEBOARD = $base.find(selector.TYPEBOARD);
            this.SELECTOR_PROPORTION = $base.find(selector.SELECTOR_PROPORTION);
            this.SELECTOR_LAYER = $base.find(selector.SELECTOR_LAYER);
            this.COMPANYINFO = $base.find(selector.COMPANYINFO);
            this.SVG = d3.select(selector.BASE_TREE).append("svg")
                .attr("width", DIAGRAM.DATA.VAR.windowWidth)
                .attr("height", DIAGRAM.DATA.VAR.windowHeight);
        },
        DIAGRAM_TREE:{
            diagonal:null,
            tree: null,
            zoomListener:null,
            svg: null,
            root:null,
            investmentRoot:null,
            quantile:null,
            stockFiltered:false,
            childFiltered:false,
            investFiltered:false,
            companyMap: null,
            personMap: null,
            relationMap: null,
            mouseupEventBlock: false,
            currentPropotion: 0,
            curListedCompanyState:0,
            NODE_INFO: function(id){
                if(id.indexOf("p") === 0){
                    return DIAGRAM.TREE.DIAGRAM_TREE.personMap[id.slice(1)];//返回对应id的个人的信息，人名的nid是以p开头
                }
                else{
                    return DIAGRAM.TREE.DIAGRAM_TREE.companyMap[id];//返回对应id的公司的信息
                }
            },
            ON_MOUSEDOWN: function(d){//鼠标左键按下的时候实时记录鼠标的坐标变化
                if(d3.event.which == 1){//对应为鼠标左键
                    DIAGRAM.DATA.VAR.xBeforeDrag = d3.event.pageX;//当前鼠标的坐标
                    DIAGRAM.DATA.VAR.yBeforeDrag = d3.event.pageY;
                }
            },
            ON_MOUSEUP: function(d){//相当于设置每一个节点的单击之后的功能，若节点不是根节点或者person还需要考虑节点的收缩和展开以及board的更新
                DIAGRAM.DATA.VAR.companyId = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).companyId;
                var thisObject = DIAGRAM.TREE.DIAGRAM_TREE;
                if(!thisObject.mouseupEventBlock && d3.event.which == 1 && Math.abs(DIAGRAM.DATA.VAR.xBeforeDrag - d3.event.pageX) < 2 && Math.abs(DIAGRAM.DATA.VAR.yBeforeDrag - d3.event.pageY) < 2){//保证鼠标事件是单击而不是拖动
                    thisObject.mouseupEventBlock = true;
                    setTimeout(function(){thisObject.mouseupEventBlock = false}, DIAGRAM.DATA.CONST.DURATION + 100);
                    $(".treeDiagram-bar .selecter-layer").val(1);
                    //$(".treeDiagram-bar .selecter-proportion").val(0);
                    if(d.nid.indexOf("p") > -1){
                        DIAGRAM.COMPANY_INFO.showInfo(d, ".board1", true);
                        return;
                    }
                    DIAGRAM.COMPANY_INFO.showInfo(d, ".board1");
                    if(d.nid !== DIAGRAM.TREE.DIAGRAM_TREE.root.nid){
                        thisObject.UPDATE_DIAGRAM(d);//进行节点的展开或者是收缩实现
                        if(!d._children || d._children.length === 0){
                            d.unfold = true;
                        }
                        else{
                            d.unfold = false;
                        }
                    }
                    thisObject.LOAD_MORE(d, $(this));//暂时来看，注掉应该不会影响
                }
            },
            init:function(companyId){
                this.INIT_DIAGONAL();
                this.INIT_TREE();
                this.INIT_ZOOM_LISTENER();
                this.INIT_SVG();
                this.LOAD_DATA(companyId);
            },
            INIT_DIAGONAL:function(){
                this.diagonal= d3.svg.diagonal().projection(function(d){
                    return [d.y, d.x];
                })
            },
            INIT_TREE:function(){
                this.tree = d3.layout.tree()
                    .separation(function(a, b) {
                        var aScale = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(a.nid).scale,
                            bScale = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(b.nid).scale;
                            console.log(aScale);
                            console.log(bScale);
                        var c = aScale + bScale + 3 + ((a.needsToBeExpended || b.needsToBeExpended) && a.parent != b.parent ? aScale/1.5 + 3.5 : 0) +  (a.needsToBeExpended && b.needsToBeExpended && a.parent != b.parent ? bScale/1.5 + 3.5 : 0);//???
                        return c;
                    });
            },
            INIT_ZOOM_LISTENER:function(){
                this.zoomListener = d3.behavior.zoom().scaleExtent([.3, 10])//缩放范围从0.3到10
                    .on("zoom", function () {
                        DIAGRAM.DATA.VAR.eventScale = d3.event.scale;
                        DIAGRAM.TREE.DIAGRAM_TREE.svg.attr("transform", "translate(" + d3.event.translate + ")" + " scale(" + DIAGRAM.DATA.VAR.eventScale + ")");
                        var eventScale = DIAGRAM.DATA.VAR.eventScale;
                        d3.selectAll(".node")
                            .attr("transform", function(d) {
                                if(d.depth == 0)
                                    return "translate(" + (d.y ) + "," + d.x + ")";
                                var distance;
                                distance = (DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS + DIAGRAM.DATA.CONST.CENTER_STROKE_WIDTH/2.5) / eventScale;
                                return "translate(" + (d.y +distance ) + "," + d.x + ")";
                            });
                        d3.selectAll(".node-text")
                            .attr("font-size", function(){
                                return DIAGRAM.DATA.CONST.TEXT_SIZE + "px";
                            })
                            .attr("transform", function(d){
                                if(d.depth == 0 )
                                    return "scale(" + 1/eventScale + ")";
                                var trans = DIAGRAM.DATA.CONST.SEED_RADIUS*DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale/eventScale * 2;
                                return d.r.type == 3 ? "scale(" + 1/eventScale + ")" : "translate(" + trans + ") scale(" + 1/eventScale + ")";
                            })
                        d3.selectAll(".btn-expend-btn")
                            .attr("dx",-5)
                            .attr("dy",12)
                            .attr("font-size", function(){
                                return DIAGRAM.DATA.CONST.TEXT_SIZE + "px";
                            })
                            .attr("transform", function(d){
                                var trans = DIAGRAM.DATA.CONST.SEED_RADIUS*DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale/eventScale * 2;
                                return "translate(" + (-5.2/eventScale) + ", " + (20/eventScale) + "),scale("+ 1/eventScale +")";
                                /*if(d.needsToBeExpended === 1)
                                 return "translate(" + (-5.2/eventScale) + ", " + (20/eventScale) + "),scale("+ 1/eventScale +")";
                                 else if(d.needsToBeExpended === 2)
                                 return "translate(" + (-5.2/eventScale) + ", " + (trans) + "),scale("+ 1/eventScale +")";*/
                            })
                        //.attr("transform", function(d){
                        //  if(d.depth == 0 )
                        //    return "scale(" + 1/eventScale + ")";
                        //  var trans = DIAGRAM.DATA.CONST.SEED_RADIUS*DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale/eventScale * 2;
                        //  return d.r.type == 3 ? "scale(" + 1/eventScale + ")" : "translate(" + trans + ") scale(" + 1/eventScale + ")";
                        //})
                        d3.selectAll(".node-circle")
                            .attr("r", function(d){
                                return DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS/eventScale;
                            })
                            .style("stroke-width", function(d){
                                if(d.depth == 0)
                                    return DIAGRAM.DATA.CONST.CENTER_STROKE_WIDTH / eventScale + "px";
                                return DIAGRAM.DATA.CONST.STROKE_WIDTH/eventScale + "px";
                            });
                        d3.selectAll(".link")
                            .attr("d", function(d){
                                return DIAGRAM.TREE.DIAGRAM_TREE.diagonal(d);
                            })
                            .style("stroke-width", function(d){
                                return DIAGRAM.DATA.CONST.LINE_STROKE_WIDTH/eventScale + "px"
                            })
                            .attr("transform", function(d){
                                var eventScale = DIAGRAM.DATA.VAR.eventScale;
                                var cons = DIAGRAM.DATA.CONST;
                                var radius = (cons.CENTER_SCALE * cons.SEED_RADIUS + cons.CENTER_STROKE_WIDTH/2) / eventScale;
                                var scaleX = (cons.DEPTH_LENGTH - radius ) / cons.DEPTH_LENGTH;
                                if(d.target.depth == 0){
                                    return "translate(" + -radius + ",0)scale(" + scaleX + ",1)"
                                }
                                else if(d.source.depth == 0){
                                    return "translate(" + radius + ",0)scale(" + scaleX + ",1)"
                                }
                            });
                        d3.selectAll(".link-text")
                            .attr("font-size", function(){
                                return (eventScale < 1 ? DIAGRAM.DATA.CONST.TEXT_SIZE_ratio : DIAGRAM.DATA.CONST.TEXT_SIZE_ratio/eventScale) + "px";
                            })
                            .attr("dy", 4/eventScale);
                    })
                    .translate([DIAGRAM.DATA.VAR.windowWidth / 2, DIAGRAM.DATA.VAR.windowHeight / 2]);
            },
            INIT_SVG:function(){
                this.svg = DIAGRAM.TREE.SVG
                    .call(this.zoomListener).on("dblclick.zoom", null)//禁用zoom缩放的双击功能
                    .append("g")
                    .attr("class", "knowledge-graph")
                    .attr("transform", "translate(" + DIAGRAM.DATA.VAR.windowWidth / 2 + "," + DIAGRAM.DATA.VAR.windowHeight / 2 + ")");
                this.svg.append("defs").append("marker")
                    .attr("id", "arrow-end-invest")//投资人
                    .attr("viewBox", "0 -5 10 10")//viewBox(xmin, ymin, width, height)控制取景范围
                    .attr("refX", 10)
                    .attr("refY", 0)
                    .attr("markerWidth", 6)
                    .attr("markerHeight", 6)
                    .attr("orient", "auto")
                    .append("svg:path")
                    .attr("fill", DIAGRAM.DATA.CONST.COLOR_INVEST)
                    .attr("d", "M0,-5L10,0L0,5");

                this.svg.append("defs").append("marker")
                    .attr("id", "arrow-end-stockholder")//股东
                    .attr("viewBox", "0 -5 10 10")
                    .attr("refX", 10)
                    .attr("refY", 0)
                    .attr("markerWidth", 6)
                    .attr("markerHeight", 6)
                    .attr("orient", "auto")
                    .append("svg:path")
                    .attr("fill", DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER)
                    .attr("d", "M0,-5L10,0L0,5");

                this.svg.append("defs").append("marker")
                    .attr("id", "arrow-end-child")//子公司
                    .attr("viewBox", "0 -5 10 10")
                    .attr("refX", 10)
                    .attr("refY", 0)
                    .attr("markerWidth", 6)
                    .attr("markerHeight", 6)
                    .attr("orient", "auto")
                    .append("svg:path")
                    .attr("fill", DIAGRAM.DATA.CONST.COLOR_CHILD)
                    .attr("d", "M0,-5L10,0L0,5");

                this.svg.append("defs").append("marker")
                    .attr("id", "arrow-end-root")//根
                    .attr("viewBox", "0 -5 10 10")
                    .attr("refX", 10)
                    .attr("refY", 0)
                    .attr("markerWidth", 6)
                    .attr("markerHeight", 6)
                    .attr("orient", "auto")
                    .append("svg:path")
                    .attr("fill", DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER)
                    .attr("d", "M0,-5L10,0L0,5");
            },
            LOAD_DATA: function(companyId){
                $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .loader-showbox").css("display", "none");//原来loader-showbox是加载的时候屏幕中间在一直转的圆圈
                $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").val(1);//令关系层级的值为一度
                //$(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-proportion").val(0);
                DIAGRAM.DATA.VAR.companyId = companyId;
                DIAGRAM.DATA.VAR.centerId = companyId;
                //d3.json("../TREE_NODES_0.json",function(data){
                    var data = jQuery.extend(true, {}, TREE_NODES); 
                    data = data.data;
                    if(!data || !data.companyMap){
                        DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_DATA_NULL);
                        return;
                    }
                    var thisObject = DIAGRAM.TREE.DIAGRAM_TREE;
                    thisObject.companyMap = data.companyMap;//数据中的公司
                    thisObject.personMap = data.personMap;//数据中的人名

                    if(data.scaleRange[0] == 0)//将传入的scaleRange里面的第一个0去掉
                        data.scaleRange.shift();
                    thisObject.quantile = d3.scale.quantile().domain(data.scaleRange).range([1,1.3,1.6,1.9,2.2,2.5,2.8,3.1,3.4,3.7,4.0,4.3]);//构建一个分位数比例尺。

                    thisObject.svg.selectAll(".node").remove();
                    thisObject.svg.selectAll(".link").remove();

                    DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(data.companyMap);//将公司的市值用quantile处理后放到它的scale属性中
                    DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(data.personMap);//给人名添加scale属性，应该都是0
                    thisObject.root = data.root;
                    if(!thisObject.root.r){
                        thisObject.root.r = {type: 0};//给root添加r属性并将其type设为0，独立于其他三种type
                    }
                    thisObject.NODE_INFO(thisObject.root.nid).scale = DIAGRAM.DATA.CONST.CENTER_SCALE;//设置中心节点大小
                    if(!thisObject.root.children)//当没有子节点时
                        thisObject.root.children = [];

                    if(thisObject.root.children.length === 1){//当只有一个子节点时
                        thisObject.root.children.push({hidden: true, nid: "temp", r: {type: 1}});
                        thisObject.companyMap["temp"] = {
                            "companyId":0,
                            "companyType":"-",
                            "establishDate":"-",
                            "industry":"-",
                            "name":"-",
                            "registrationCapital":"-",
                            "representitive":"-",
                            "scale":0,
                            "scope":"-"};
                    }

                    // thisObject.root.x0 = thisObject.root.x;
                    // thisObject.root.y0 = thisObject.root.y;
                    thisObject.investmentRoot =JSON.parse(JSON.stringify(thisObject.root));//先将thisObject.root转换为json形式的字符串，再将字符串转换为json数据格式
                    thisObject.investmentRoot.children = [];//将其子节点清除
                    thisObject.root.children = thisObject.root.children.filter(function(d){//对于每个元素，如果该函数返回 true，则元素会被包含在已筛选集合中；否则，会排除这个元素。
                        if(d.r && d.r.type == 3){
                            thisObject.investmentRoot.children.push(JSON.parse(JSON.stringify(d)));//将type等于3的节点放入投资人根中
                            return false;
                        }
                        return true;
                    });//这段执行完毕之后把root节点中的股东信息剔除并单独生成股东根节点

                    thisObject.SET_INDEX(thisObject.root, 0);
                    thisObject.SET_INDEX(thisObject.investmentRoot, 0);
                    thisObject.NODES_LIMIT(thisObject.root, 10);
                    thisObject.NODES_LIMIT(thisObject.investmentRoot, 10);
                    thisObject.root.children.forEach(thisObject.FOLD_NODES);//收缩孙节点，理解为初始时只显示子节点
                    if(thisObject.root._children2)
                        thisObject.root._children2.forEach(thisObject.FOLD_NODES);
                    thisObject.investmentRoot.children.forEach(thisObject.FOLD_NODES);
                    if(thisObject.investmentRoot._children2)
                        thisObject.investmentRoot._children2.forEach(thisObject.FOLD_NODES);

                    // unfold属性记录当前节点状态（展开/收缩），仅在这里，或在触发了点击事件或选择层级事件时会改变其的值，而进行持股筛选时不会改变其值。
                    // 作用是使持股比例筛选总是对图的“上一个状态”(如前所述，这个“状态”不会在筛选持股比例时被改变)进行筛选，避免混乱。
                    thisObject.root.unfold = true;
                    thisObject.investmentRoot.unfold = true;
                    thisObject.root.x0 = 0;
                    thisObject.DRAW(thisObject.root);
                    thisObject.CENTER_NODE(thisObject.root);//暂时不太理解
                    if($(".board1 .company_name").hasClass("up")){//class为up表示board处于收缩状态，此时触发click事件
                        $(".board1 .company_name").trigger("click")//trigger() 方法触发被选元素的指定事件类型。
                    }
                    $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .loader-showbox").css("display", "none");//将加载时的圆圈消除

                    if(data.loadLayer == 1){
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer option").css("display", "none");
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").css("background", "#f3f3f3").css("color", "#999");
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").mouseover(function() {
                            $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .popDetail").css("display", "block");
                        }).mouseout(function() {
                            $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .popDetail").css("display", "none");
                        })
                    }
                    else{
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").css("background", "#fff").css("color", "#404040");
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").unbind("mouseover").unbind("mouseout");
                        $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer option").css("display", "block");
                    }                 
                //});
                // DIAGRAM.TOOL.GET(DIAGRAM.DATA.URL.TREE_NODES.replace(/\{nodeID}/i,companyId).replace(/\{layer}/i,4).replace(/\{nodetype}/i,"company"), function(data) {
                //     data = data.data;
                //     if(!data || !data.companyMap){
                //         DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_DATA_NULL);
                //         return;
                //     }
                //     var thisObject = DIAGRAM.TREE.DIAGRAM_TREE;
                //     thisObject.companyMap = data.companyMap;
                //     thisObject.personMap = data.personMap;

                //     if(data.scaleRange[0] == 0)
                //         data.scaleRange.shift();
                //     thisObject.quantile = d3.scale.quantile().domain(data.scaleRange).range([1,1.3,1.6,1.9,2.2,2.5,2.8,3.1,3.4,3.7,4.0,4.3]);

                //     thisObject.svg.selectAll(".node").remove();
                //     thisObject.svg.selectAll(".link").remove();

                //     DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(data.companyMap);
                //     DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(data.personMap);
                //     thisObject.root = data.root;
                //     if(!thisObject.root.r){
                //         thisObject.root.r = {type: 0};
                //     }
                //     thisObject.NODE_INFO(thisObject.root.nid).scale = DIAGRAM.DATA.CONST.CENTER_SCALE;//设置中心节点大小
                //     if(!thisObject.root.children)
                //         thisObject.root.children = [];

                //     if(thisObject.root.children.length === 1){
                //         thisObject.root.children.push({hidden: true, nid: "temp", r: {type: 1}});
                //         thisObject.companyMap["temp"] = {
                //             "companyId":0,
                //             "companyType":"-",
                //             "establishDate":"-",
                //             "industry":"-",
                //             "name":"-",
                //             "registrationCapital":"-",
                //             "representitive":"-",
                //             "scale":0,
                //             "scope":"-"};
                //     }

                //     thisObject.root.x0 = thisObject.root.x;
                //     thisObject.root.y0 = thisObject.root.y;

                //     thisObject.investmentRoot = JSON.parse(JSON.stringify(thisObject.root));
                //     thisObject.investmentRoot.children = [];
                //     thisObject.root.children = thisObject.root.children.filter(function(d){
                //         if(d.r && d.r.type == 3){
                //             thisObject.investmentRoot.children.push(JSON.parse(JSON.stringify(d)));
                //             return false;
                //         }
                //         return true;
                //     });

                //     thisObject.SET_INDEX(thisObject.root, 0);
                //     thisObject.SET_INDEX(thisObject.investmentRoot, 0);
                //     thisObject.NODES_LIMIT(thisObject.root, 10);
                //     thisObject.NODES_LIMIT(thisObject.investmentRoot, 10);
                //     thisObject.root.children.forEach(thisObject.FOLD_NODES);
                //     if(thisObject.root._children2)
                //         thisObject.root._children2.forEach(thisObject.FOLD_NODES);
                //     thisObject.investmentRoot.children.forEach(thisObject.FOLD_NODES);
                //     if(thisObject.investmentRoot._children2)
                //         thisObject.investmentRoot._children2.forEach(thisObject.FOLD_NODES);

                //     // unfold属性记录当前节点状态（展开/收缩），仅在这里，或在触发了点击事件或选择层级事件时会改变其的值，而进行持股筛选时不会改变其值。
                //     // 作用是使持股比例筛选总是对图的“上一个状态”(如前所述，这个“状态”不会在筛选持股比例时被改变)进行筛选，避免混乱。
                //     thisObject.root.unfold = true;
                //     thisObject.investmentRoot.unfold = true;
                //     thisObject.root.x0 = 0;
                //     thisObject.DRAW(thisObject.root);
                //     thisObject.CENTER_NODE(thisObject.root);
                //     if($(".board1 .company_name").hasClass("up")){
                //         $(".board1 .company_name").trigger("click")
                //     }
                //     $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .loader-showbox").css("display", "none");

                //     if(data.loadLayer == 1){
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer option").css("display", "none");
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").css("background", "#f3f3f3").css("color", "#999");
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").mouseover(function() {
                //             $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .popDetail").css("display", "block");
                //         }).mouseout(function() {
                //             $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .popDetail").css("display", "none");
                //         })
                //     }
                //     else{
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").css("background", "#fff").css("color", "#404040");
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer").unbind("mouseover").unbind("mouseout");
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_TREE + " .selecter-layer option").css("display", "block");
                //     }
                // },function(){DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.CONNECT_ERR)});
            },
            DRAW:function(source){
                var levelWidth1 = [1];
                var levelWidth2 = [2];
                this.CHILD_COUNT(0, this.root, levelWidth1);//计算得到树中最多子节点的宽度
                this.CHILD_COUNT(0, this.investmentRoot, levelWidth2);

                var tree1 = this.tree.size([d3.max(levelWidth1) * 12, DIAGRAM.DATA.VAR.windowWidth]);

                var nodes = tree1.nodes(this.root),
                    links = tree1.links(nodes);

                var tree2 = this.tree.size([d3.max(levelWidth2) * 12, DIAGRAM.DATA.VAR.windowWidth]);
                var investmentNodes = tree2.nodes(this.investmentRoot),
                    investmentLinks = tree2.links(investmentNodes);

                investmentNodes.shift();//把它的根节点去掉，它与root中的根节点重复了
                if(investmentNodes && investmentNodes.length > 0)
                    nodes = nodes.concat(investmentNodes)//合并
                if(investmentLinks && investmentLinks.length > 0)
                    links = links.concat(investmentLinks);

                var minX, maxX, rootX;
                var count = 0;
                rootX=nodes[0].x;//by mingru.xia
                // nodes.forEach(function(d) {
                //     if(d.depth == 0){
                //         rootX = d.x;
                //     }
                // });
                links.forEach(function(d){
                    if(d.target.r.type == 3){//target是股东
                        if(count < 1){
                            minX = d.target.x;
                            maxX = d.target.x;
                            count++;
                        }
                        if(d.target.x < minX) minX = d.target.x;//找到所有股东节点中x值的最大值与最小值，注意：在实际显示的时候是Y方向上值
                        if(d.target.x > maxX) maxX = d.target.x;
                    }
                });
                //重新定义了所有节点在水平竖直方向上的坐标值
                nodes.forEach(function(d) {
                    d.y = d.depth * DIAGRAM.DATA.CONST.DEPTH_LENGTH;//重新定义各级节点在水平方向上的距离
                    if(d.r.type == 3){
                        d.y = -d.y;//将股东节点放到root的左边
                        d.x = d.x + (rootX - (maxX + minX)/2);//使所有的股东子节点在Y方向上相对根节点居中分布
                    }
                });
                //颠倒左侧path的方向(若不颠倒，path方向为从右向左，这样textpath会颠倒，且很难用transform转回来(因为旋转中心不是文字的中心));
                //强制将左侧第一层节点指向根节点所在位置(否则某些特殊情景下会出现link与根节点错开的情况)
                links.forEach(function(d){
                    if(d.target.r.type == 3){
                        var o = d.source;
                        d.source = d.target;
                        d.target = o;
                        if(d.source.depth == 1)
                            d.target.x = nodes[0].x;//必要的，不能去掉，相当于给investmentNode中的根节点重新定义坐标，它和root中的根节点的坐标不相同
                    }
                });
                var node = this.svg
                    .selectAll("g.node")
                    .data(nodes, function(d) {return d.id || (d.id = "generatedID_" + ++DIAGRAM.DATA.VAR.nodeIdCount);});//给 nodes中的每一个加上id
                var nodeEnter = node
                    .enter()
                    .append("g")
                    .attr("transform", function(){if(source.x0) return "translate(" + source.y0 + "," + source.x0 + ")";})//第一次执行的时候没有返回的translate。
                    .attr("class", function(d){
                        var className = "node";
                        if(d.hidden)
                            return "hidden";
                        if(d.depth==0){
                            className += " root";
                            DIAGRAM.COMPANY_INFO.showInfo(d, ".board1");//显示右边border中的公司信息。
                        }
                        if(d.r){
                            if(d.r.type == 1)
                                className += " invest";
                            else if(d.r.type == 3)
                                className += " stockholder";
                            else if(d.r.type == 2)
                                className += " child";
                        }
                        return className;
                    })
                    .on("mouseout", function(d) {
                        // $("#tooltip").css("pointer-events", "none");
                        DIAGRAM.TREE.TOOLTIP_TREE.transition()
                            .duration(200)
                            .style("opacity", 0);
                    })
                    .on("mouseover", function(d){
                        DIAGRAM.TREE.TOOLTIP_TREE.transition()
                            .duration(200)
                            .style("opacity", .9);
                        var node = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid);
                        DIAGRAM.TREE.TOOLTIP_TREE.html(node.name || node.personName)
                            .style("left", (d3.event.pageX + 10) + "px")
                            .style("top", (d3.event.pageY - $(window).scrollTop() - 28) + "px");//scroll top offset 指的是滚动条相对于其顶部的偏移。
                    });
                if(DIAGRAM.RP.TREE.node_rightClick){//设置节点的右击相关
                    node.on("contextmenu", function(d){
                        DIAGRAM.DATA.VAR.companyId = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).companyId;
                        var obj = {};
                        obj.selector = ".node>circle";//选择.node类的子元素circle
                        obj.callback = function(key) {
                            if(key == "forceDiagram")
                                DIAGRAM.showForce(DIAGRAM.DATA.VAR.companyId, DIAGRAM.DATA.VAR.centerId);
                        }
                        obj.items = {
                            "forceDiagram": {name: "与中心节点的关系图", icon: "fa-arrows-h"}
                        }
                        $.contextMenu(obj);
                    })
                };
                node
                    .transition()
                    .duration(DIAGRAM.DATA.CONST.DURATION)
                    .attr("transform", function(d) {
                        if(d.depth == 0){
                            return "translate(" + (d.y ) + "," + d.x + ")";//root点在原始位置
                        }
                        var distance;
                        distance = (DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS + DIAGRAM.DATA.CONST.CENTER_STROKE_WIDTH/2.5) / DIAGRAM.DATA.VAR.eventScale;
                        return "translate(" + (d.y +distance ) + "," + d.x + ")";//保证所有
                        //by mingru xia fix small bug;
                        // if(d.r)
                        // {
                        //     if(d.r.type==3)
                        //     {
                        //         return "translate(" + (d.y +distance ) + "," + d.x + ")";//保证所有
                        //     }
                        //     else if(d.r.type==2||d.r.type==1)
                        //     {
                        //         return "translate(" + (d.y -distance ) + "," + d.x + ")";//保证所有
                        //     }
                        // };
                    });

                var nodeExit = node.exit().transition()
                    .duration(DIAGRAM.DATA.CONST.DURATION)
                    .attr("transform", function(d) { return "translate(" + source.y + "," + source.x + ")"; })
                    .remove();

                nodeExit.select("circle")
                    .attr("r", 1e-6);

                nodeExit.select("text")
                    .style("fill-opacity", 1e-6);


                var currentLink = this.svg.selectAll(".link");
                var link = currentLink.data(links, function(d) {//这一段很重要，但我还不知道它是怎么实现的
                    if(d.source.r && d.source.r.type == 3){
                        return d.source.id;
                    }
                    return d.target.id;
                })
                link.enter().insert("path", "g")
                    .attr("id", function(d){
                        return "link_" + ++DIAGRAM.DATA.VAR.linkCount;
                    })
                    .attr("class", function(d){
                        if(d.target.hidden )
                            return "hidden";
                        return "link";
                    })
                    .attr("d", function(d) {
                        var o;
                        if(source.x0)
                            o = {x: source.x0, y: source.y0};
                        else
                            o = {x: 0, y: 0};
                        return DIAGRAM.TREE.DIAGRAM_TREE.diagonal({source: o, target: o});
                    })
                    .style("stroke-width", function(d){
                        return DIAGRAM.DATA.CONST.LINE_STROKE_WIDTH/DIAGRAM.DATA.VAR.eventScale + "px";
                    })
                    .style("stroke", function(d){
                        if(d.target.depth == 0 || (d.target.r && d.target.r.type == 3))
                            return DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER;
                        else if( d.target.r && d.target.r.type == 1)
                            return DIAGRAM.DATA.CONST.COLOR_INVEST;
                        else if( d.target.r && d.target.r.type ==  2)
                            return DIAGRAM.DATA.CONST.COLOR_CHILD;
                    })
                if(DIAGRAM.DATA.VAR.browserSupportMarker){
                    link.attr("marker-end", function(d){
                        if(d.target.depth == 0)
                            return "url("  + "#arrow-end-root)";
                        else if( d.target.r && d.target.r.type ==  3)
                            return "url("  + "#arrow-end-stockholder)";
                        else if( d.target.r && d.target.r.type == 1)
                            return "url("  + "#arrow-end-invest)";
                        else if( d.target.r && d.target.r.type == 2)
                            return "url("  + "#arrow-end-child)";
                    })
                }
                link
                    .transition()
                    .duration(DIAGRAM.DATA.CONST.DURATION)
                    .attr("d", DIAGRAM.TREE.DIAGRAM_TREE.diagonal)
                    .attr("transform", function(d){
                        var eventScale = DIAGRAM.DATA.VAR.eventScale;
                        var cons = DIAGRAM.DATA.CONST;
                        var radius = (cons.CENTER_SCALE * cons.SEED_RADIUS + cons.CENTER_STROKE_WIDTH/2) / eventScale;
                        var scaleX = (cons.DEPTH_LENGTH - radius ) / cons.DEPTH_LENGTH;
                        if(d.target.depth == 0){
                            return "translate(" + -radius + ",0)scale(" + scaleX + ",1)"//水平方向上的translate是将箭头尖显示出来，X方向上缩放一下
                        }
                        else if(d.source.depth == 0){
                            return "translate(" + radius + ",0)scale(" + scaleX + ",1)"
                        }
                    });

                link.exit().transition()
                    .duration(DIAGRAM.DATA.CONST.DURATION)
                    .attr("d", function(d) {
                        var o = {x: source.x, y: source.y};
                        return DIAGRAM.TREE.DIAGRAM_TREE.diagonal({source: o, target: o});
                    })
                    .remove();

                nodes.forEach(function(d) {
                    d.x0 = d.x;
                    d.y0 = d.y;
                });
                var circle = nodeEnter
                    .append("circle")
                    .classed("node-circle", true)//就是添加class
                    .attr("r", function(d){
                        return DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS/DIAGRAM.DATA.VAR.eventScale;
                    })
                    .style("stroke-width", function(d){
                        if(d.depth == 0)
                            return DIAGRAM.DATA.CONST.CENTER_STROKE_WIDTH/DIAGRAM.DATA.VAR.eventScale + "px";
                        return DIAGRAM.DATA.CONST.STROKE_WIDTH/DIAGRAM.DATA.VAR.eventScale + "px";
                    })
                    .on("mousedown", this.ON_MOUSEDOWN)
                    .on("mouseup", this.ON_MOUSEUP);//相当于给各个节点绑定单击后的事件

                var text = nodeEnter.append("text")
                    .classed("node-text", true)
                    .attr("dy", function(d){
                        if(d.depth == 0)
                            return "50px";
                        return "4px";
                    })
                    .attr("dx", function(d){
                        var radius = DIAGRAM.DATA.CONST.SEED_RADIUS * DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale;
                        if(d.depth == 0)
                            return (DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).name.length > 8 ? -55 : -40 ) + "px";
                        return (d.r && d.r.type == 3 ? (- 10 - radius) : (5 - radius)) + "px";
                    })
                    .attr("font-size", function(){
                        return (DIAGRAM.DATA.VAR.eventScale < 1 ? DIAGRAM.DATA.CONST.TEXT_SIZE : DIAGRAM.DATA.CONST.TEXT_SIZE/DIAGRAM.DATA.VAR.eventScale) + "px";
                    })
                    .attr("text-anchor", function(d) { return d.y < 0 ? "end" : "start"; })//设置文字的左对齐/右对齐
                    .attr("transform", function(d){
                        if(d.depth == 0 )
                            return "scale(" + 1/DIAGRAM.DATA.VAR.eventScale + ")";
                        var trans = DIAGRAM.DATA.CONST.SEED_RADIUS*DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale/DIAGRAM.DATA.VAR.eventScale * 2;
                        return d.r && d.r.type == 3 ? "scale(" + 1/DIAGRAM.DATA.VAR.eventScale + ")" : "translate(" + trans + ") scale(" + 1/DIAGRAM.DATA.VAR.eventScale + ")";
                    })
                    .attr("fill", function(d){
                        if(d.depth == 0)
                            return DIAGRAM.DATA.CONST.COLOR_ROOT
                        else if(d.r.type == 3)
                            return DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER;
                        else if(d.r.type == 1)
                            return DIAGRAM.DATA.CONST.COLOR_INVEST;
                        else if(d.r.type == 2)
                            return DIAGRAM.DATA.CONST.COLOR_CHILD;
                    })
                    .text(function(d) {
                        var name = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).name || DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).personName;
                        if(d.depth == 0)
                            return name.length < 9 ? name : ( name.slice(0,12) + "...");
                        return name.length < 7 ? name : ( name.slice(0,10) + "...");
                        // return companyMap[d.cid].companyId;
                    })
                    .on("mousedown", this.ON_MOUSEDOWN)
                    .on("mouseup", this.ON_MOUSEUP);//点击文字发生的事件与点击节点的一样

                d3.selectAll(".btn-expend-btn").remove();
                d3.selectAll(".node").each(function(d){//添加扩展节点的选项
                    if(d.needsToBeExpended){
                        var btn = d3.select(this)
                            .append('svg:text')
                            .attr("class", "btn-expend-btn")
                            .attr("dx",-5)
                            .attr("dy",12)
                            .attr("font-size",DIAGRAM.DATA.CONST.TEXT_SIZE)
                            .text("更多...")
                            .style("cursor","pointer")
                            .style("text-decoration", "underline")
                            .on("click", function(d){
                                DIAGRAM.TREE.DIAGRAM_TREE.EXPEND_MORE(d.parent, d.needsToBeExpended, 10);
                                // DIAGRAM.TREE.DIAGRAM_TREE.EXPEND_MORE(d.parent, d.needsToBeExpended, 10);
                                // DIAGRAM.TREE.DIAGRAM_TREE.EXPEND_MORE(d.parent, d.needsToBeExpended, 10);
                                // DIAGRAM.TREE.DIAGRAM_TREE.EXPEND_MORE(d.parent, d.needsToBeExpended, 10);
                            })
                            .on("mouseover", function(d) {
                                d3.event.stopPropagation();//该方法将停止事件的传播，
                                return null;
                            });
                    }
                });
                var eventScale = DIAGRAM.DATA.VAR.eventScale;
                d3.selectAll(".btn-expend-btn")
                    .attr("dx",-5)
                    .attr("dy",12)
                    .attr("transform", function(d){
                        var trans =DIAGRAM.DATA.CONST.SEED_RADIUS*DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(d.nid).scale/eventScale * 2;
                        return "translate(" + (-5.2/eventScale) + ", " + (20/eventScale) + "),scale("+ 1/eventScale +")";
                        /*if(d.needsToBeExpended === 1)
                         return "translate(" + (-5.2/eventScale) + ", " + (trans) + "),scale("+ 1/eventScale +")";
                         else if(d.needsToBeExpended === 2)
                         return "translate(" + (-5.2/eventScale) + ", " + (trans/eventScale) + "),scale("+ 1/eventScale +")";*/
                    });

                d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_TREE + " .link-text").remove();
                link.each(function(d){
                    var linkText = DIAGRAM.TREE.DIAGRAM_TREE.svg.append("text")
                        .attr("dx", function(){
                            var eventScale = DIAGRAM.DATA.VAR.eventScale;
                            var radius = DIAGRAM.DATA.CONST.CENTER_SCALE * DIAGRAM.DATA.CONST.SEED_RADIUS / eventScale;
                            if(d.source.r && d.source.r.type == 3){
                                if(d.target.depth == 0){
                                    return (DIAGRAM.DATA.CONST.DEPTH_LENGTH - radius) / 3;
                                }
                                else{
                                    return DIAGRAM.DATA.CONST.DEPTH_LENGTH / 3;
                                }
                            }
                            if(d.source.depth == 0){
                                var distance = Math.abs(d.source.x - d.target.x);
                                return Math.sqrt(distance * distance * 3.2  + (DIAGRAM.DATA.CONST.DEPTH_LENGTH - radius) * (DIAGRAM.DATA.CONST.DEPTH_LENGTH - radius) * 1.5) / 2 ;
                            }
                            else{
                                var distance = Math.abs(d.source.x - d.target.x);
                                return Math.sqrt(distance * distance * 3.2  + DIAGRAM.DATA.CONST.DEPTH_LENGTH * DIAGRAM.DATA.CONST.DEPTH_LENGTH * 1.5) / 2 ;
                            }
                        })
                        .attr("dy", 4/DIAGRAM.DATA.VAR.eventScale)
                        .attr("font-size", function(){
                            return (DIAGRAM.DATA.VAR.eventScale < 1 ? DIAGRAM.DATA.CONST.TEXT_SIZE_ratio : DIAGRAM.DATA.CONST.TEXT_SIZE_ratio/DIAGRAM.DATA.VAR.eventScale) + "px";
                        })
                        .attr("class", "link-text")
                        .append("textPath")
                        .attr("xlink:href",location.href + "#" + d3.select(this).attr("id"));

                    if((d.source.r && d.source.r.type == 3))
                        linkText.text(d.source.r.shareholdingRatio ? d.source.r.shareholdingRatio + "%" : "");
                    else if(d.target.r){
                        linkText.text(d.target.r.shareholdingRatio ? d.target.r.shareholdingRatio + "%" : "");
                    }
                });
            },
            CHILD_COUNT: function(level, n, levelWidth){
                if (n.children && n.children.length > 0) {
                    if (levelWidth.length <= level + 1) levelWidth.push(0);
                    levelWidth[level + 1] += n.children.length;
                    n.children.forEach(function(e){
                        levelWidth[level + 1] += DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO(e.nid).scale;
                    });
                    n.children.forEach(function(d){
                        DIAGRAM.TREE.DIAGRAM_TREE.CHILD_COUNT(level + 1, d, levelWidth);
                    });
                }
            },
            CENTER_NODE:function(source) {
                if((source._children && source._children.length > 0) || (source.children && source.children.length > 0) || source.depth == 0){
                    var scale = this.zoomListener.scale();
                    var x = -source.y0;
                    var y = -source.x0;
                    x = x * scale + DIAGRAM.DATA.VAR.windowWidth / 2;
                    y = y * scale + DIAGRAM.DATA.VAR.windowHeight / 2;
                    d3.select('.knowledge-graph').transition()
                        .duration(DIAGRAM.DATA.CONST.DURATION)
                        .attr("transform", "translate(" + x + "," + y + ")scale(" + scale + ")");
                    DIAGRAM.TREE.DIAGRAM_TREE.zoomListener.scale(scale);
                    DIAGRAM.TREE.DIAGRAM_TREE.zoomListener.translate([x, y]);
                }
            },
            /**
             * 将某一节点展开或收缩
             * 关于哪些节点会被展开：
             * 1、此节点的所有子节点都会被展开
             * 2、在此节点的所有子孙节点中，若某个节点之前被点击展开了，且未曾再次点击此节点收缩它的子节点，则这个节点的所有子节点也都会被展开
             * @param  {object} 节点
             */
            UPDATE_DIAGRAM: function(d) {
                var investmentRoot = DIAGRAM.TREE.DIAGRAM_TREE.investmentRoot;
                if ((d._children && d._children.length > 0) || (d.depth == 0 && investmentRoot._children && investmentRoot._children.length > 0)) {
                    if(d._children && d._children.length > 0){
                        if(!d.children)
                            d.children = [];
                        d.children = d.children.concat(d._children);
                        d._children = null;
                    }
                    if(d.depth == 0 && investmentRoot._children && investmentRoot._children.length > 0){
                        if(!investmentRoot.children)
                            investmentRoot.children = [];
                        investmentRoot.children = investmentRoot.children.concat(investmentRoot._children);
                        investmentRoot._children = null;
                    }
                } else if((d.children && d.children.length > 0) || (d.depth == 0 && investmentRoot.children && investmentRoot.children.length > 0)){
                    if(d.children && d.children.length > 0){
                        if(!d._children || d._children.length < 1)
                            d._children = [];
                        d._children = d._children.concat(d.children);
                        d.children = null;
                    }
                    if(d.depth == 0 && investmentRoot.children && investmentRoot.children.length > 0){
                        if(!investmentRoot._children)
                            investmentRoot._children = [];
                        investmentRoot._children = investmentRoot._children.concat(investmentRoot.children);
                        investmentRoot.children = null;
                    }
                }
                this.DRAW(d);

                this.CENTER_NODE(d);
            },
            /**
             * 将node的所有子孙收缩
             * @param node {object} 节点
             */
            FOLD_NODES: function(node){
                if(node.children && node.children.length > 0){
                    if(!node._children)
                        node._children = [];//添加_children属性
                    node._children = node._children.concat(node.children);
                    node.children = null;
                    node._children.forEach(DIAGRAM.TREE.DIAGRAM_TREE.FOLD_NODES);
                    if(node._children2)
                        node._children2.forEach(DIAGRAM.TREE.DIAGRAM_TREE.FOLD_NODES);
                }
            },
            /**
             * 将node的所有子节点展开（只展开一层）
             * @param node {object} 节点
             */
            EXPAND_NODES: function(node){
                if (node._children && node._children.length > 0) {
                    if(!node.children)
                        node.children = [];
                    node.children = node.children.concat(node._children);
                    node._children = null;
                }
                if (node._children2 && node._children2.length > 0) {
                    this.EXPEND_MORE(node, 1, (node._children2.length+1)/2);
                    this.EXPEND_MORE(node, 2, (node._children2.length+1)/2);
                }
                // if (node._children4 && node._children4.length > 0) {
                //     if(!node.children)
                //         node.children = [];
                //     node.children = node.children.concat(node._children);
                //     node._children = null;
                // }

            },
            /**
             * 将树中所有层级大于layerNum的节点收缩，所有层级小于等于layerNum的节点展开
             * @param node {object} 节点。外部调用时传入root
             * @param layerNum {number} 展示到第几层级
             */
            LAYER_FILTER: function(node, layerNum){
                if(layerNum > 0){
                    layerNum--;
                    this.EXPAND_NODES(node);
                    node.unfold = true;
                    if(node.children && node.children.length > 0){
                        node.children.forEach(function(d){
                            DIAGRAM.TREE.DIAGRAM_TREE.LAYER_FILTER(d, layerNum);
                        });
                    }
                }
                else if(layerNum === 0){
                    this.FOLD_NODES(node);
                    node.unfold = false;
                }
            },
            /**
             * 将图更新到所选当前层级的状态
             * @param layerNum {number} 展示到第几层级
             */
            SHOW_CURRENTLAYER: function(layerNum){
                if(this.root){
                    this.LAYER_FILTER(this.root, layerNum);
                    this.LAYER_FILTER(this.investmentRoot, layerNum);
                    this.DRAW(this.root);
                    this.CENTER_NODE(this.root);
                }
            },
            /**
             * 将图更新到所选当前层级
             * @param node {objec} 节点。外部调用时传入root。
             * @param num {number} 筛选掉持股比例小于等于num的节点。
             */
            PROPORTION_FILTER: function(node, num){
                if(node.unfold && node._children && node._children.length > 0){//确保节点在部分展开的情况下也能正常工作
                    node._children = node._children.filter(function(d){
                        if(d.r.shareholdingRatio > num){
                            if(!node.children)
                                node.children = [];
                            var bigIndex = node.children.every(function(n, index){
                                if(d.index < n.index){
                                    node.children.splice(index, 0, d); //把节点插入到它原来的位置
                                    return false;
                                }
                                return true;
                            });
                            //如果当前数组中所有node的index值都比node“d"小，则node"d"应该被插入至末尾
                            if(bigIndex)
                                node.children.push(d);
                            return false;
                        }
                        return true;
                    });

                }
                if(node.children && node.children.length > 0){
                    node.children = node.children.filter(function(d, index){
                        if(d.r.shareholdingRatio <= num){
                            if(!node._children)
                                node._children = [];
                            node._children.push(d);
                            // d.index = index; //记录节点当前在数组中的index(同时也是显示在树上时的index)
                            return false;
                        }
                        // //DIAGRAM.TREE.DIAGRAM_TREE.PROPORTION_FILTER(d, num);
                         return true;
                    });
                }
            },
            /**
             * 节点按照持股比例筛选并更新图
             * @param num {number} 筛选掉持股比例小于等于num的节点
             */
            SHOW_CURRENT_PROPORTION: function(num){
                if(this.root){
                    //this.PROPORTION_FILTER(this.root, num);
                    this.PROPORTION_FILTER(this.investmentRoot, num);
                    this.DRAW(this.root)
                    this.CENTER_NODE(this.root);
                }
            },
            SHOW_LISTED_COMPANY_OR_NOT: function(num){
                if(this.root){
                    this.LISTED_COMPANY_FILTER(this.root, num);
                    this.LISTED_COMPANY_FILTER(this.investmentRoot, num);
                    this.DRAW(this.root);
                    this.CENTER_NODE(this.root);
                }
            },
            LISTED_COMPANY_FILTER:function (node,num) {
                var tree=this;
                if((node.children&&node.children.length>0)||(node._children4&&node._children4.length>0))
                {
                    if((num==1&&tree.curListedCompanyState==2)||(num==2&&tree.curListedCompanyState==1))
                    {
                        if(!node.children)
                        {
                            node.children=[];
                            node.children=node._children4.splice(0,node._children4.length);
                        }
                        else if(!node._children4)
                        {
                            node._children4=[];
                            node._children4=node.children.splice(0,node.children.length);
                        }
                        else
                        {
                            var temp=node.children.splice(0,node.children.length);
                            node.children=node.children.concat(node._children4);
                            node._children4.length=0;
                            node._children4=node._children4.concat(temp);
                        }
                    };
                    if((num==0&&tree.curListedCompanyState==1)||(num==0&&tree.curListedCompanyState==2))
                    {
                        if(!node.children)
                        {
                            node.children=[];
                            node.children=node._children4.splice(0,node._children4.length);
                        }
                        else if(!node._children4)
                        {
                            node._children4=[];
                        }
                        else
                        {
                            node._children4=node._children4.filter(function (d4) {
                                var maxIndex=node.children.every(function (d, i) {
                                    if(d4.index<d.index)
                                    {
                                        node.children.splice(i,0,d4);
                                        return false;
                                    }
                                    return true;
                                });
                                if(maxIndex)
                                {
                                    node.children.push(d4);
                                }
                                return false;
                            });
                        }
                    };
                    node.children=node.children.filter(function(d, i) {
                        if((num==1&&tree.curListedCompanyState==0)||(num==2&&tree.curListedCompanyState==0))
                        {
                            if(num==1&&tree.curListedCompanyState==0)
                            {
                                if(tree.NODE_INFO(d.nid).companyType && tree.NODE_INFO(d.nid).companyType.indexOf("上市") > -1)
                                    return true;
                            }
                            if(num==2&&tree.curListedCompanyState==0)
                            {
                                if(!tree.NODE_INFO(d.nid).companyType || tree.NODE_INFO(d.nid).companyType.indexOf("上市")<0)
                                    return true;
                            }
                            if(!node._children4)
                                node._children4=[];
                            node._children4.push(d);
                            return false;
                        }
                        else
                        {
                          return true;
                        }
                    });
                }


                if((node.children&&node.children.length>0)&&(num!=2))
                {
                    node.children.forEach(function (d) {
                        DIAGRAM.TREE.DIAGRAM_TREE.LISTED_COMPANY_FILTER(d,num);
                    });
                }
            },
            TYPE_FOLD: function(node, type){
                var atLeastOneNodeFolded = false;
                if(node.children && node.children.length > 0){
                    node.children = node.children.filter(function(d){
                        if(d.r.type == type){
                            if(!node._children3)
                                node._children3 = [];
                            node._children3.push(d);
                            atLeastOneNodeFolded = true;
                            return false;
                        }
                        if(atLeastOneNodeFolded || DIAGRAM.TREE.DIAGRAM_TREE.TYPE_FOLD(d, type))
                            atLeastOneNodeFolded = true;
                        return true;
                    });
                }
                return atLeastOneNodeFolded;
            },
            TYPE_EXPEND: function(node, type){
                var atLeastOneNodeEXPANDED = false;
                if(node.unfold && node._children3 && node._children3.length > 0){
                    node._children3 = node._children3.filter(function(d){
                        if(d.r.type == type){
                            if(!node.children)
                                node.children = [];
                            var bigIndex = node.children.every(function(n, index){
                                if(d.index < n.index){
                                    node.children.splice(index, 0, d); //把节点插入到它原来的位置
                                    return false;
                                }
                                return true;
                            });
                            //如果当前数组中所有node的index值都比node“d"小，则node"d"应该被插入至末尾
                            if(bigIndex)
                                node.children.push(d);
                            atLeastOneNodeEXPANDED = true;
                            return false;
                        }
                        return true;
                    });
                }
                var a;
                if(node.children){
                    node.children.forEach(function(d){
                        a = DIAGRAM.TREE.DIAGRAM_TREE.TYPE_EXPEND(d, type)
                    })
                }
                if(a || atLeastOneNodeEXPANDED)
                    return true;
                return false;
            },
            FOLD_CURRENT_TYPE: function(typeNum){
                var atLeastOneNodeFolded_root, atLeastOneNodeFolded_investmentRoot;
                if(this.root){
                    atLeastOneNodeFolded_root = this.TYPE_FOLD(this.root, typeNum);
                    atLeastOneNodeFolded_investmentRoot = this.TYPE_FOLD(this.investmentRoot, typeNum);
                    this.DRAW(this.root)
                    this.CENTER_NODE(this.root);
                }
                return atLeastOneNodeFolded_root || atLeastOneNodeFolded_investmentRoot;
            },
            EXPEND_CURRENT_TYPE: function(typeNum){
                var atLeastOneNodeEXPANDED_root, atLeastOneNodeEXPANDED_investmentRoot;
                if(this.root){
                    atLeastOneNodeEXPANDED_root = this.TYPE_EXPEND(this.root, typeNum);
                    atLeastOneNodeEXPANDED_investmentRoot = this.TYPE_EXPEND(this.investmentRoot, typeNum);
                    this.DRAW(this.root)
                    this.CENTER_NODE(this.root);
                }
                return atLeastOneNodeEXPANDED_root || atLeastOneNodeEXPANDED_investmentRoot;
            },
            SET_RELATION:function(r, relationName){
                r.children.forEach(function(d){
                    d.relation = relationName;
                    d.company.scale = Math.random() * .75 + .2 ;
                    d.proportion = (Math.random() * 100).toFixed(1) + "%";
                    if(d.children.length>0){
                        DIAGRAM.TREE.DIAGRAM_TREE.SET_RELATION(d, relationName)
                    }
                });
            },
            // convertData: function(data){
            //     this.root = {};
            //     this.root = data;
            //     // this.root.children = [];
            //     // data.children.forEach(function(r){
            //     //     DIAGRAM.TREE.DIAGRAM_TREE.root.children = DIAGRAM.TREE.DIAGRAM_TREE.root.children.concat(r.children);
            //     // });
            // },
            LEVEL_NODES_COUNT: function(level, n, levelWidth) {
                if(n.children && n.children.length > 0) {
                    if(levelWidth.length <= level + 1) levelWidth.push(0);

                    levelWidth[level+1] += n.children.length;
                    n.children.forEach(function(d) {
                        this.LEVEL_NODES_COUNT(level + 1, d, levelWidth);
                    });
                }
            },
            GET_MAX_DEPTH: function(node){
                var maxDepth = 0;
                node.data().forEach(function(d){
                    if(d.depth > maxDepth)
                        maxDepth = d.depth;
                });
                return maxDepth;
            },
            // CONVERT_SCALE: function(d, nodes){
            //     this.companyMap[d.cid].scale = DIAGRAM.TREE.DIAGRAM_TREE.quantile(this.companyMap[d.cid].scale || 0);
            //     if(d.children){
            //         d.children.forEach(function(c){
            //             DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(c, nodes);
            //         });
            //     }
            // },
            CONVERT_SCALE: function(companies){
                for(var prop in companies){
                    companies[prop].scale = DIAGRAM.TREE.DIAGRAM_TREE.quantile(companies[prop].scale || 0);//company有个scale属性
                }
            },
            /**
             * 给每个节点添加index属性(index记录节点在数组中的位置，同时也表示节点在树上的位置)
             * @param node {object} 节点
             * @param index {number} 节点的index属性的值
             */
            SET_INDEX: function(node, index){
                node.index = index;
                if(node.children){
                    node.children.forEach(function(d, i){
                        DIAGRAM.TREE.DIAGRAM_TREE.SET_INDEX(d, i);
                    });
                }
            },
            /**
             *递归地判断每一个节点的子节点个数，超过limit,就将多出的节点折叠
             * @param node {object} 节点
             * @param limit {number}
             */
            NODES_LIMIT: function(node, limit){
                if(node.children){
                    node.children.forEach(function(n){
                        DIAGRAM.TREE.DIAGRAM_TREE.NODES_LIMIT(n, limit);
                    });
                    if(node.children.length > limit){
                        node._children2 = node.children;
                        node.children = node.children.slice(0,limit);
                        node._children2 = node._children2.slice(-node._children2.length+limit);//保存limit之外的节点
                        this.SET_EXPEND(node);
                    }
                }
            },
            /**
             * 设置节点的needsToBeExpended属性
             * 执行DRAW()的时候，如果needsToBeExpended属性为1/2，就会在它上方/下方append一个添加按钮
             * @param node {object} 节点
             */
            SET_EXPEND: function(node){
                node.children.forEach(function(n){
                    n.needsToBeExpended = 0;
                });
                //node的子节点中，上部是否有被折叠起来的节点
                if(node._children2[0].index < node.children[0].index){
                    node.children[0].needsToBeExpended = 1;
                }
                //node的子节点中，下部是否有被折叠起来的节点
                if(node._children2[node._children2.length-1].index > node.children[node.children.length-1].index){
                    node.children[node.children.length-1].needsToBeExpended = 2;
                }
            },
            /**
             * 展开被NODES_LIMIT()折叠起来的点
             * @param node {object} 节点
             * @param topOrBtm {number} =1：展开上方；=2：展开下方
             * @param num {number} 要展开的节点个数
             */
            EXPEND_MORE: function(node, topOrBtm, num){
                if(topOrBtm === 1 && num > 0){
                    var firstChildren = node.children[0];
                    node._children2.reverse().filter(function(n){
                        if(n.index < firstChildren.index && num > 0){
                            node.children.unshift(n);
                            num--;
                            return false
                        }
                        return true;
                    });
                    node._children2.reverse();
                }
                else if(topOrBtm === 2 && num > 0){
                    var lastChildren = node.children[node.children.length-1];
                    node._children2.filter(function(n){
                        if(n.index > lastChildren.index && num > 0){
                            node.children.push(n);
                            num--;
                            return false
                        }
                        return true;
                    });
                }
                this.SET_EXPEND(node);
                this.DRAW(node);
            },
            LOAD_MORE: function(d, $node){
                if(d.depth < 4 && (!d.children || d.children.length === 0) && (!d._children || d._children.length === 0)){
                    DIAGRAM.TOOL.GET(DIAGRAM.DATA.URL.TREE_NODES.replace(/\{nodeID}/i,d.nid).replace(/\{layer}/i,1).replace(/\{nodetype}/i,"company"), function(data) {
                        data = data.data;
                        if(!data || !data.companyMap){
                            DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.COMPANYID_DATA_NULL);
                            return;
                        }
                        DIAGRAM.TREE.DIAGRAM_TREE.CONVERT_SCALE(data.companyMap);
                        for(var prop in data.companyMap){
                            if(!DIAGRAM.TREE.DIAGRAM_TREE.companyMap[prop]){
                                data.companyMap[prop].scale = data.companyMap[prop].scale;
                                DIAGRAM.TREE.DIAGRAM_TREE.companyMap[prop] = data.companyMap[prop];
                            }
                        }
                        for(var prop in data.relationMap){
                            DIAGRAM.TREE.DIAGRAM_TREE.relationMap[prop] = data.relationMap[prop];
                        }

                        if(d.r && d.r.type == 3)
                            DIAGRAM.TREE.DIAGRAM_TREE.INSERT_NODES(d, data.root.children, "left");
                        else if(d.r)
                            DIAGRAM.TREE.DIAGRAM_TREE.INSERT_NODES(d, data.root.children, "right");
                        DIAGRAM.TREE.DIAGRAM_TREE.SET_INDEX(d, d.index);
                        DIAGRAM.TREE.DIAGRAM_TREE.NODES_LIMIT(d, 10);
                        DIAGRAM.TREE.DIAGRAM_TREE.PROPORTION_FILTER(d, DIAGRAM.TREE.DIAGRAM_TREE.currentPropotion);
                        DIAGRAM.TREE.DIAGRAM_TREE.DRAW(d);
                        DIAGRAM.TREE.DIAGRAM_TREE.CENTER_NODE(d);
                        DIAGRAM.TREE.DIAGRAM_TREE.SHOW_BOTTOM_TOOLTIP(d, $node);
                    },function(){DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.TREE, DIAGRAM.DATA.ERROR_MESSAGE.CONNECT_ERR)});
                }
                else{
                    this.SHOW_BOTTOM_TOOLTIP(d, $node);
                }
            },
            SHOW_BOTTOM_TOOLTIP: function(d, $node){
                if((!d.children || d.children.length == 0) && (!d._children || d._children.length == 0)){
                    $node.tooltip({title:'暂无下层关系',
                        'container': DIAGRAM.DATA.SELECTOR.BASE_TREE,
                        'placement': 'bottom',
                        'trigger' : 'manual'
                    });
                    $node.tooltip('show');
                    setTimeout(function(){$node.tooltip('destroy');}, 1200);
                }
            },
            INSERT_NODES: function(d, nodes, where){
                if(!d.children)
                    d.children = [];
                if(where === "right" && d.r.type != 3){
                    nodes.forEach(function(n){
                        if( n.r.type != 3)
                            d.children.push(n)
                    });
                }
                else if(where === "left" && d.r.type == 3){
                    nodes.forEach(function(n){
                        if( n.r.type == 3)
                            d.children.push(n)
                    });
                }
            }
        },
        LINSTENER_BIND:function(){
            $(".treeDiagram-bar .selecter-proportion").on("change", function(e){//持股比例
                DIAGRAM.TREE.DIAGRAM_TREE.SHOW_CURRENT_PROPORTION($(this).val());
                DIAGRAM.TREE.DIAGRAM_TREE.currentPropotion = $(this).val();
            });
            $(".treeDiagram-bar .selecter-layer").on("change", function(e){//关系层级
                DIAGRAM.TREE.DIAGRAM_TREE.SHOW_CURRENTLAYER($(this).val());
                $(".treeDiagram-bar .selecter-proportion").val(0);
                $(".treeDiagram-bar #listed_company_or_not").val(0);
            });
            // added by mingru.xia
            $(".treeDiagram-bar #listed_company_or_not").on("change", function(e){//上市公司显示与否
                DIAGRAM.TREE.DIAGRAM_TREE.SHOW_LISTED_COMPANY_OR_NOT($(this).val());
                DIAGRAM.TREE.DIAGRAM_TREE.curListedCompanyState = $(this).val();
            });
            if(DIAGRAM.RP.TREE.moreInfo){
                $(".treeDiagram-bar .tree_moreInfo").on("click", function(){
                    DIAGRAM.RP.tree_moreInfo();
                });
            }
            $(".treeDiagram-bar .reset-tree").on("click", function(e){//tree的重置按钮
                $(".treeDiagram-bar .selecter-proportion").val(0);
                $(".treeDiagram-bar .selecter-layer").val(1);
                $(".treeDiagram-bar #listed_company_or_not").val(0);
                DIAGRAM.TREE.DIAGRAM_TREE.zoomListener.scale(1);
                DIAGRAM.DATA.VAR.eventScale = 1;
                DIAGRAM.TREE.DIAGRAM_TREE.LOAD_DATA(DIAGRAM.TREE.DIAGRAM_TREE.root.nid);
            });
            $(".treeDiagram-bar .foldSelecter").on("click", function(e){//tree的收起按钮
                $(".treeDiagram-bar").animate({width:'toggle'},300);//设置不可见
                setTimeout(function(){
                    $(".treeDiagram-expend .expendSelecter").toggle(200)//显示展开
                }, 200)
            });
            $(".treeDiagram-expend .expendSelecter").on("click", function(e){//tree的展开按钮
                $(".treeDiagram-expend .expendSelecter").toggle(300);
                $(".treeDiagram-bar").animate({width:'toggle'},350);//设置为可见使用toggle可以切换其隐藏显示属性
            });

            $(".board1 .company_name").on("click", function(event){
                if($(".board1 .content").css("display") == "none"){
                    $(".board1 .content").slideDown(300, function(){
                        $(".board1 .company_name").removeClass("up")
                        $(".board1 .company_name").addClass("down")
                    });
                }
                else{
                    $(".board1 .content").slideUp(300, function(){
                        $(".board1 .company_name").removeClass("down")
                        $(".board1 .company_name").addClass("up")
                    });
                }
            });
            $(".board1 .tables ul li").on("click",function(d){
                $(".board1 .tables ul li").removeClass("act");
                $(d.target).addClass("act");
                //$(d.target).parents("li").addClass("active");
                var which;
                if($(d.target).hasClass("shareholders"))
                    which = "shareholders";
                else if($(d.target).hasClass("subcompanies"))
                    which = "subcompanies";
                else if($(d.target).hasClass("seniors"))
                    which = "seniors";
                DIAGRAM.COMPANY_INFO.getTableInfo(which, ".board1");
            })

            $(DIAGRAM.DATA.SELECTOR.BASE_TREE + " .typeBoard > div").on("click", function(e){
                var thisObject = DIAGRAM.TREE.DIAGRAM_TREE;
                if($(this).children("div").attr("class") == "stockholder-color"){
                    if(!thisObject.stockFiltered){
                        thisObject.stockFiltered = thisObject.FOLD_CURRENT_TYPE(3);
                    }
                    else{
                        thisObject.stockFiltered = !thisObject.EXPEND_CURRENT_TYPE(3);
                    }
                }
                else if($(this).children("div").attr("class") == "invest-color"){
                    if(!thisObject.investFiltered){
                        thisObject.investFiltered = thisObject.FOLD_CURRENT_TYPE(1);
                    }
                    else{
                        thisObject.investFiltered = !thisObject.EXPEND_CURRENT_TYPE(1);
                    }
                }
                else if($(this).children("div").attr("class") == "child-color"){
                    if(!thisObject.childFiltered){
                        thisObject.childFiltered = thisObject.FOLD_CURRENT_TYPE(2);
                    }
                    else{
                        thisObject.childFiltered = !thisObject.EXPEND_CURRENT_TYPE(2);
                    }
                }
            });
        },
    },
    FORCE:{
        TOOLTIP_FORCE: null,
        COMPANYINFO: null,
        generate: function(companyId1, companyId2){
            this.INIT_FRAGMENT();
            this.DIAGRAM_FORCE.init(companyId1, companyId2);
            this.LINSTENER_BIND();
        },
        INIT_FRAGMENT: function(){
            var $parent = $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE);
            $parent.html("");
            DIAGRAM.DATA.VAR.windowWidth = $parent.width();//container2的高和宽
            DIAGRAM.DATA.VAR.windowHeight = $parent.height();
            $parent.append("<div class='" + DIAGRAM.DATA.SELECTOR.BASE.replace(".","") + " " + DIAGRAM.DATA.SELECTOR.BASE_FORCE.replace(".","") + "'></div>")
            $(DIAGRAM.DATA.SELECTOR.BASE_FORCE)
                .append('<div class="typeBoardWrapper"><div class="typeBoard"><div><i class="fa fa-long-arrow-right invest-color" aria-hidden="true"></i><label>投资</label></div><div><i class="fa fa-long-arrow-right child-color" aria-hidden="true"></i><label>子公司</label></div></div></div>')
                .append('<div class="forceDiagram-expend"><a class="expendSelecter">展开&nbsp;<i class="fa fa-angle-double-right"></i></a></div>')
                .append('<div class="diagram-bar forceDiagram-bar"></div>')
                .append('<div class="' + DIAGRAM.DATA.SELECTOR.COMPANYINFO.replace(".","") + ' board2"><div class="company_name up"></div><div class="content"><div class="content-inner"><div class="info-top"><span class="sign">上市公司</span> </div><div class="info"><div class="representitive"><span>法定代表：</span></div><div class="registrationCapital"><span>注册资本：</span></div><div class="marketValue"><span>市值：</span></div><div class="establishDate"><span>成立日期：</span></div><div class="scope"><span>主营业务：</span></div></div><div class="info-blank" style="display: none;"><img src="img/new-ui/blank5.png"><p>无公司信息</p></div><div class="tables"><ul class="tab_list col3 clearfix"><li class="act shareholders">股东</li><li class="subcompanies">对外投资</li><li class="seniors">主要成员</li></ul><div class="table-wrapper"><div class="preloader"><span></span><span></span><span></span><span></span><span></span><span></span></div><table class="table-shareholders table table-bordered"><thead><tr><th class="left">名称</th><th style="width: 60px">持股比例</th></tr></thead><tbody></tbody></table><table class="table-subcompanies table table-bordered"><thead><tr><th class="left">名称</th><th style="width: 60px">持股比例</th></tr></thead><tbody></tbody></table><table class="table-seniors table table-bordered"><thead><tr><th class="left">姓名</th><th>角色</th></tr></thead><tbody></tbody></table></div></div></div><div class="board-btn"><span href="#123" class="blue-border-btn">查看图谱</span></div></div></div>')
                .append('<div class="loader-showbox"><div class="loader"><svg class="circular" viewBox="25 25 50 50"><circle class="path" cx="50" cy="50" r="20" fill="none" stroke-width="2" stroke-miterlimit="10"/></svg></div>');
            $(".forceDiagram-bar")
                .append('<span>关系层级：</span><select class="selecter-layer"><option value="0">全部</option><option value="1">一度</option><option value="2">二度</option><option value="3">三度</option><option value="4">四度</option></select>')
                .append('<span style="display: none">持股比例：</span><select style="display: none" class="selecter-proportion"><option value="0">大于0%</option><option value="5">大于5%</option><option value="20">大于20%</option><option value="50">大于50%</option></select>')
                .append('<div><a class="reset-force">重置</a>|<a class="foldSelecter"><i class="fa fa-angle-double-left"></i>&nbsp;收起</a></div>')
                .append('<div class="resetDiagram-pannel"><a class="resetDiagram">后退</a></div>');
            this.TOOLTIP_FORCE = d3.select(DIAGRAM.DATA.SELECTOR.BASE_FORCE)
                .append("div")
                .attr("id", DIAGRAM.DATA.SELECTOR.TOOLTIP_FORCE.replace("#", ""))
                .style("opacity", 0);
            $(".board2 .content").css("display", "none");
            $(".board2 .company_name").removeClass("down")
                .addClass("up");
        },
        DIAGRAM_FORCE: {
            force: null,
            drag: null,
            svg: null,
            zoomListener: null,
            forceGroup: null,
            controlGroup: null,
            link: null,
            node: null,
            marker: null,
            relations: {},
            data: null,
            force_data:null,
            layer: 0, //所选层级
            quantile: null,
            arrowEndIdCount:0,
            arrowStartIdCount:0,
            clickCount: 0,
            companyMap: null,
            personMap: null,
            reLocationIverval: null,
            reLocationTimeout: null,
            companyId1: null,
            companyId2: null,
            lastTypeClicked: null,
            NODE_INFO: function(id){
                if(id.indexOf("p") > -1){
                    return DIAGRAM.FORCE.DIAGRAM_FORCE.personMap[id.slice(1)];
                }
                else{
                    return DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[id];
                }
            },
            init: function(companyId1, companyId2){
                this.INIT_FORCE();
                this.INIT_DRAG();
                this.INIT_ZOOM_LISTENER();
                this.INIT_SVG();
                this.LOAD_DATA(companyId1, companyId2);
            },
            INIT_FORCE: function(){
                this.force = d3.layout.force()
                    .size([DIAGRAM.DATA.VAR.windowWidth, DIAGRAM.DATA.VAR.windowHeight])
                    .charge(-600)
                    .linkStrength(0.2)//指定连接线的坚硬度，值的范围为[ 0 , 1 ]，值越大越坚硬。其直观感受是：
                                      // 值为1，则拖动一个顶点A，与之相连的顶点会与A保持linkDistance设定的距离运动
                                      //值为0，则拖动一个顶点A，与之相连的顶点不会运动，连接线会被拉长
                    .on("tick", this.tick);
            },
            INIT_DRAG: function(){
                this.drag = this.force.drag()//drag()就是force绑定的事件
                    .on("dragstart", function(d){
                        d3.event.sourceEvent.stopPropagation();//阻止事件冒泡到父元素，阻止任何父事件处理程序被执行。必须得有，不然会force图整体发生拖拽行为
                        DIAGRAM.DATA.VAR.xBeforeDrag = d.x;
                        DIAGRAM.DATA.VAR.yBeforeDrag = d.y;
                        var addtion = DIAGRAM.FORCE.DIAGRAM_FORCE.data.links.length;
                        if(addtion < 800){
                            clearInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval);//clearInterval() 方法可取消由 setInterval() 设置的 timeout。clearInterval() 方法的参数必须是由 setInterval() 返回的 ID 值。
                            clearTimeout(DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationTimeout);//清除setTimeout()设置的延时。
                            DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval = setInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.drawPathText, 300 + addtion);//drag事件开始的时候每隔一段时间调用一次drawPathText函数
                        }
                    })
                    .on("dragend", function(d){
                        if(Math.abs(DIAGRAM.DATA.VAR.xBeforeDrag - d.x) > 4 || Math.abs(DIAGRAM.DATA.VAR.yBeforeDrag - d.y) > 4){
                            d3.select(this).classed("fixed", d.fixed = true);
                        }
                        DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationTimeout = setTimeout(function(){
                            clearInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval);
                        }, 1000);
                    });
            },
            INIT_ZOOM_LISTENER: function(){
                this.zoomListener = d3.behavior.zoom().scaleExtent([.3, 10]).center([DIAGRAM.DATA.VAR.windowWidth / 2, DIAGRAM.DATA.VAR.windowHeight / 2])
                    .on("zoom", function () {

                        DIAGRAM.DATA.VAR.eventScale_force = d3.event.scale;
                        DIAGRAM.FORCE.DIAGRAM_FORCE.forceGroup.attr("transform", "translate(" + d3.event.translate + ")" + " scale(" + d3.event.scale + ")");
                        var eventScale = DIAGRAM.DATA.VAR.eventScale_force;
                        d3.selectAll(".force-text")
                            .attr("font-size", function(){
                                return DIAGRAM.DATA.CONST.TEXT_SIZE + "px";
                            })
                            .attr("transform", function(d){
                                var trans = DIAGRAM.DATA.CONST.SEED_RADIUS * DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).scale/eventScale;
                                return "translate(" + trans + ") scale(" + 1/eventScale + ")";
                            });
                        d3.selectAll(".node-force > circle")
                            .attr("r", function(d){
                                return DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS/eventScale;
                            })
                            .style("stroke-width", function(d){
                                return DIAGRAM.DATA.CONST.STROKE_WIDTH/eventScale + "px";
                            });
                        d3.selectAll(".link-force")
                            .style("stroke-width", function(d){
                                return DIAGRAM.DATA.CONST.LINE_STROKE_WIDTH/eventScale + "px";
                            });
                        d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text")
                            .attr("font-size", function(){
                                return (eventScale < 1 ? DIAGRAM.DATA.CONST.TEXT_SIZE_ratio : DIAGRAM.DATA.CONST.TEXT_SIZE_ratio/eventScale) + "px";
                            })
                            .attr("dy", 4/eventScale);
                        d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-force").attr("d", function(d, i) {
                            // Total difference in x and y from source to target
                            var diffX = (d.target.x - d.source.x);
                            var diffY = (d.target.y - d.source.y);
                            // Length of path from center of source node to center of target node
                            var pathLength = Math.sqrt((diffX * diffX) + (diffY * diffY));

                            // x and y distances from center to outside edge of target node
                            var offsetTargetX = (diffX * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.target.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;
                            var offsetTargetY = (diffY * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.target.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;

                            var offsetSourceX = (diffX * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.source.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;
                            var offsetSourceY = (diffY * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.source.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;

                            return "M" +
                                (d.source.x+offsetSourceX) + "," +
                                (d.source.y+offsetSourceY) + "L" +
                                (d.target.x- offsetTargetX) + "," +
                                (d.target.y-offsetTargetY);
                        });
                    });
            },
            INIT_SVG: function(){
                this.svg = d3.select(DIAGRAM.DATA.SELECTOR.BASE_FORCE).append("svg")
                    .attr("width", DIAGRAM.DATA.VAR.windowWidth)
                    .attr("height", DIAGRAM.DATA.VAR.windowHeight)
                    .call(this.zoomListener).on("dblclick.zoom", null);//给svg绑定缩放功能并且取消双击缩放的事件

                this.forceGroup = this.svg.append("g")
                    .classed("mainDiagram", true);

                this.link = this.forceGroup.selectAll(".link-force");
                this.node = this.forceGroup.selectAll(".node-force");
            },
            FIX_NODES:function(){
                var thisObject = DIAGRAM.FORCE.DIAGRAM_FORCE;
                var data = this.force_data.data;
                thisObject.companyMap = data.companyMap;
                thisObject.personMap = data.personMap;

                if(data.scaleRange[0] == 0)
                    data.scaleRange.shift();
                thisObject.quantile = d3.scale.quantile().domain(data.scaleRange).range([1,1.3,1.6,1.9,2.2,2.5,2.8,3.1,3.4,3.7,4.0]);

                thisObject.relations = thisObject.deriveOrders(data);
                var result = thisObject.convertData(data);//这两步用于从原始json数据里面生成force图所需要的nodes和links
                var count = 0;
                result.nodes.forEach(function(n){
                    if(n.root){
                        if(count === 0){
                            n.x = DIAGRAM.DATA.VAR.windowWidth * 0.15;//定义左边根节点的坐标
                            n.y = DIAGRAM.DATA.VAR.windowHeight / 2;
                            count++;
                        }
                        else{
                            n.x = DIAGRAM.DATA.VAR.windowWidth * 0.85;//定义右边根节点的坐标
                            n.y = DIAGRAM.DATA.VAR.windowHeight / 2;
                        }
                    }
                    else{
                        n.x = DIAGRAM.DATA.VAR.windowWidth * (Math.random() * .5 + .25);//Math.random()返回的数值是介于0～1之间
                        n.y = DIAGRAM.DATA.VAR.windowHeight * (Math.random() * .5 + .25);//
                    }
                });
                thisObject.data = result;
                thisObject.setScale(thisObject.data);
                thisObject.DRAW(result);
            },
            LOAD_DATA: function(companyId1, companyId2){
                $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .selecter-layer").val(0);
                $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .selecter-proportion").val(0);
                $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .loader-showbox").css("display", "block");
                this.companyId1 = companyId1;
                this.companyId2 = companyId2;
                d3.json("../PAIR_NODES.json",function(data){
                    DIAGRAM.FORCE.DIAGRAM_FORCE.force_data = data;
                    DIAGRAM.FORCE.DIAGRAM_FORCE.FIX_NODES();
                     if($(".board2 .company_name").hasClass("up")){
                         $(".board2 .company_name").trigger("click")
                     }
                     $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .loader-showbox").css("display", "none");
                });
                // DIAGRAM.TOOL.GET(DIAGRAM.DATA.URL.PAIR_NODES
                //     .replace(/\{source}/i, companyId1)
                //     .replace(/\{target}/i, companyId2)
                //     .replace(/\{sourcetype}/i, "company")
                //     .replace(/\{targettype}/i, "company"), function(data){
                //     if(!data.data || !data.data.relations || data.data.relations.length < 1){
                //         DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.RELATION_NOT_FOUND);
                //         $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .loader-showbox").css("display", "none");
                //         return;
                //     }
                //     DIAGRAM.FORCE.DIAGRAM_FORCE.force_data = data;
                //     DIAGRAM.FORCE.DIAGRAM_FORCE.FIX_NODES();
                //     if($(".board2 .company_name").hasClass("up")){
                //         $(".board2 .company_name").trigger("click")
                //     }
                //     $(DIAGRAM.DATA.SELECTOR.PARENT_FORCE + " .loader-showbox").css("display", "none");
                // },function(){DIAGRAM.RP.dataErrorMsg(DIAGRAM.RP.TABINDEX.FORCE, DIAGRAM.DATA.ERROR_MESSAGE.CONNECT_ERR)});
            },
            DRAW: function(result){
                DIAGRAM.FORCE.DIAGRAM_FORCE.zoomListener.scale(1);
                DIAGRAM.FORCE.DIAGRAM_FORCE.zoomListener.translate([0,0]);
                DIAGRAM.DATA.VAR.eventScale_force = 1;
                if(DIAGRAM.FORCE.DIAGRAM_FORCE.forceGroup)
                    DIAGRAM.FORCE.DIAGRAM_FORCE.forceGroup.attr("transform", "translate(" + 0 + ")" + " scale(" + 1 + ")");
                var companyMap = this.companyMap,
                    relationMap = this.relationMap;
                d3.selectAll(".mainDiagram").html("");
                this.link = this.forceGroup.selectAll(".link-force");
                this.node = this.forceGroup.selectAll(".node-force");

                this.force
                    .nodes(result.nodes)
                    .links(result.links).on("tick", function(){
                        DIAGRAM.FORCE.DIAGRAM_FORCE.link.attr("d", function(d) {
                            if(d.source.x > d.target.x) {
                                var o = d.source;
                                d.source = d.target;
                                d.target = o;
                                if (!d.isReversed) {
                                    d.isReversed = true;
                                    $(this).attr("marker-start", function(d) {
                                        return $(this).attr("_marker-start");//attr() 方法返回被选元素的属性值。
                                    });
                                    $(this).attr("marker-end", "");
                                } else {
                                    d.isReversed = false;
                                    $(this).attr("marker-end", function(d) {
                                        return $(this).attr("_marker-end");
                                    });
                                    $(this).attr("marker-start", "");
                                }

                            } else {
                                if (d.isReversed) {
                                    $(this).attr("marker-start", function(d) {
                                        return $(this).attr("_marker-start");
                                    });
                                    $(this).attr("marker-end", "");
                                } else {
                                    $(this).attr("marker-end", function(d) {
                                        return $(this).attr("_marker-end");
                                    });
                                    $(this).attr("marker-start", "");
                                }
                            }
                            // Total difference in x and y from source to target
                            var diffX = (d.target.x - d.source.x);
                            var diffY = (d.target.y - d.source.y);
                            // Length of path from center of source node to center of target node
                            var pathLength = Math.sqrt((diffX * diffX) + (diffY * diffY));

                            // x and y distances from center to outside edge of target node
                            var offsetTargetX = (diffX * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.target.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;
                            var offsetTargetY = (diffY * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.target.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;

                            var offsetSourceX = (diffX * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.source.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;
                            var offsetSourceY = (diffY * (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.source.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS+DIAGRAM.DATA.CONST.STROKE_WIDTH)/DIAGRAM.DATA.VAR.eventScale_force) / pathLength;
                            return "M" +
                                (d.source.x+offsetSourceX) + "," +//这一块相当于设置path中的那个直线，保证直线距离每个node点的相对位置不变。
                                (d.source.y+offsetSourceY) + "L" +
                                (d.target.x- offsetTargetX) + "," +
                                (d.target.y-offsetTargetY);
                        });

                        DIAGRAM.FORCE.DIAGRAM_FORCE.node
                            .attr("transform", function(d) {
                                return "translate(" + d.x + "," + d.y + ")";
                            });
                    })
                    .start();

                var linkIdCount = 0;
                this.link = this.link.data(result.links)
                    .enter().append("svg:path")
                    .attr("class", function(d){
                        var c = "link-force";
                        if(!d.r || d.r.type == 1)
                            c += " invest";
                        else if(d.r.type == 2)
                            c += " child";
                        return c;
                    })
                    .attr("id", function(d){
                        return "link-force_" + linkIdCount++;
                    })
                    .style("stroke-width", function(d){
                        return DIAGRAM.DATA.CONST.LINE_STROKE_WIDTH/DIAGRAM.DATA.VAR.eventScale_force + "px";
                    });
                if(DIAGRAM.DATA.VAR.browserSupportMarker){
                    d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " defs").remove();
                    this.link.attr("marker-end", function(d){
                        DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                            .append("defs")
                            .append("marker")
                            .attr("id", "arrow-end-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowEndIdCount)
                            .attr("class", "arrow-default")
                            .attr("viewBox", "0 -5 10 10")
                            .attr("refX", 5)
                            .attr("refY", 0)
                            .attr("markerWidth", 5)
                            .attr("markerHeight", 5)
                            .attr("orient", "auto")
                            .append("svg:path")
                            .attr("d", "M0,-5L10,0L0,5");

                        return "url(" + location.href + "#arrow-end-" + DIAGRAM.FORCE.DIAGRAM_FORCE.arrowEndIdCount + ")";
                    });
                    this.link.attr("_marker-end", function(d){ return $(this).attr("marker-end"); });//姑且当link包含_marker-end属性，现在相当于复制marker-end属性的内容给他。
                    this.link.attr("marker-start", function(d) {
                        //if (typeof d.isReversed === "undefined") {
                            DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                                .append("defs")
                                .append("marker")
                                .attr("id", "arrow-start-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount)
                                .attr("class", "arrow-default")
                                .attr("viewBox", "0 -5 10 10")
                                .attr("refX", 0)
                                .attr("refY", 0)
                                .attr("markerWidth", 5)
                                .attr("markerHeight", 5)
                                .attr("orient", "auto")
                                .append("svg:path")
                                .attr("d", "M10,-5L0,0L10,5");
                        // } else {
                        //     DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                        //         .append("defs")
                        //         .append("marker")
                        //         .attr("id", "arrow-start-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount)
                        //         .attr("class", "arrow-default")
                        //         .attr("viewBox", "0 -5 10 10")
                        //         .attr("refX", 0)
                        //         .attr("refY", 0)
                        //         .attr("markerWidth", 5)
                        //         .attr("markerHeight", 5)
                        //         .attr("orient", "auto")
                        //         .append("svg:path")
                        //         .attr("d", "M10,-5L0,0L10,5");
                        // }


                        return "url(" + location.href + "#arrow-start-" + DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount + ")";
                    });
                    this.link.attr("_marker-start", function(d){ return $(this).attr("marker-start"); });
                }
                this.node = this.node.data(result.nodes)
                    .enter().append("g")
                    .attr("class", "node-force")
                    .on("mouseover", function(d){
                        DIAGRAM.FORCE.TOOLTIP_FORCE.transition()
                            .duration(200)
                            .style("opacity", .9);
                        var node = DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid);
                        DIAGRAM.FORCE.TOOLTIP_FORCE.html(node.name || node.personName)
                            .style("left", (d3.event.pageX + 7) + "px")
                            .style("top", (d3.event.pageY - $(window).scrollTop() - 28) + "px");
                    })
                    .on("mouseout", function(d) {
                        DIAGRAM.FORCE.TOOLTIP_FORCE.transition()
                            .duration(500)
                            .style("opacity", 0);
                    })
                    .on("mouseup", function(d){
                        DIAGRAM.FORCE.DIAGRAM_FORCE.clickCount++;
                        if(d3.event.target.nodeName === "circle"){// && DIAGRAM.FORCE.DIAGRAM_FORCE.layer//事件发生在nodeName名字为“circle”的标签上
                            if(Math.abs(DIAGRAM.DATA.VAR.xBeforeDrag - d.x) < 3 || Math.abs(DIAGRAM.DATA.VAR.yBeforeDrag - d.y) < 3){
                                if(d.selected){
                                    d.selected = false;
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.currentLayerView();
                                }
                                else {
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.forceGroup.selectAll(".node-force").classed("selected", false).data().forEach(function(n){
                                        n.selected = false;//给所有节点添加selected属性，并将其置为false；
                                    });
                                    d.selected = true;
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.currentLayerView();//显示当前层的一些节点路径
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.lightPaths(d, this);//根据你的点击点亮对应的路径
                                }
                            }
                        }
                        if(DIAGRAM.FORCE.DIAGRAM_FORCE.clickCount === 2){
                            d3.select(this).classed("fixed", d.fixed = false);
                            DIAGRAM.FORCE.DIAGRAM_FORCE.clickCount = 0;
                        }
                        DIAGRAM.DATA.VAR.companyId = d.nid;
                        setTimeout(function(){DIAGRAM.FORCE.DIAGRAM_FORCE.clickCount = 0;},200);
                        if(d.nid.indexOf("p") > -1){
                            DIAGRAM.COMPANY_INFO.showInfo(d, ".board2", true);
                            return;
                        }
                        DIAGRAM.COMPANY_INFO.showInfo(d, ".board2");

                    })
                    // .on("dblclick", function(d){
                    //     d3.select(this).classed("fixed", d.fixed = false);
                    // })
                    .call(this.drag);

                this.node.append("circle")
                    .attr("r", function(d){
                        return DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS/DIAGRAM.DATA.VAR.eventScale_force;
                    })
                    .attr("stroke-width", DIAGRAM.DATA.CONST.STROKE_WIDTH/DIAGRAM.DATA.VAR.eventScale_force);
                this.node.append("text")
                    .attr("dx", function(d){
                        return d.root ? (DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).name.length > 8 ? -50 : -40 ) : DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).scale * DIAGRAM.DATA.CONST.SEED_RADIUS + 10
                    })
                    .attr("dy", function(d){ return d.root ? 40 : 5 })
                    .classed("force-text", true)
                    .classed("hidden", function(d){ return !d.root})
                    .text(function(d){return DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).name.length > 8 ? DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).name.slice(0,8) + ".." : DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO(d.nid).name});

                this.node.filter(function(n){ return n.root === true; })
                    .classed("fixed", true)
                    .classed("root", true);

                this.node.each(function(d){
                    if(d.root){
                        DIAGRAM.DATA.VAR.companyId = d.nid;
                        DIAGRAM.COMPANY_INFO.showInfo(d, ".board2");
                    }
                });
                //层级选择下拉框只展示到当前图拥有的最大层级。例：某图中只存在二度和三度关系，则该下拉框选项为“一度”、“二度”、“三度
                $(".forceDiagram-bar .selecter-layer > option").css("display", "block");
                $(".forceDiagram-bar .selecter-layer > option").each(function(index, e){
                    if(index > DIAGRAM.FORCE.DIAGRAM_FORCE.relations["maxOrder"]){
                        $(this).css("display", "none");
                    }
                })
                var addtion = DIAGRAM.FORCE.DIAGRAM_FORCE.data.links.length;
                if(addtion < 800){
                    clearInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval);
                    DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval = setInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.drawPathText, 300 + addtion);
                    setTimeout(function(){
                        clearInterval(DIAGRAM.FORCE.DIAGRAM_FORCE.reLocationIverval);
                    }, 5000);
                }
                else{
                    setTimeout(DIAGRAM.FORCE.DIAGRAM_FORCE.drawPathText, 5000);
                }
                DIAGRAM.FORCE.DIAGRAM_FORCE.drawPathText();
            },
            drawPathText: function(hideAll){
                var relationMap = DIAGRAM.FORCE.DIAGRAM_FORCE.relationMap;
                // DIAGRAM.FORCE.DIAGRAM_FORCE.force.stop();
                // d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text").remove();
                DIAGRAM.FORCE.DIAGRAM_FORCE.link.each(function(d){
                    var hidden = true, hiddenByP= true, hiddenByT = true;
                    d3.selectAll(".link-text[path_id='" + $(this).attr("id") + "']").each(function(){
                        hidden = d3.select(this).classed("hidden");
                        hiddenByP = d3.select(this).classed("hidden-by-proportion_filter");
                        hiddenByT = d3.select(this).classed("hidden-by-type_filter");
                        d3.select(this).remove();
                    });
                    var linkText = DIAGRAM.FORCE.DIAGRAM_FORCE.forceGroup.append("text")
                        .attr("dx", function(){
                            var a = d.source.x - d.target.x, b = d.source.y - d.target.y;
                            return Math.sqrt( a * a + b * b ) / 2 - 15;
                        })
                        .attr("dy", 4)
                        .attr("font-size", function(){
                            /*return DIAGRAM.DATA.CONST.TEXT_SIZE + "px";*/
                            return (DIAGRAM.DATA.VAR.eventScale_force < 1 ? DIAGRAM.DATA.CONST.TEXT_SIZE_ratio : DIAGRAM.DATA.CONST.TEXT_SIZE_ratio/DIAGRAM.DATA.VAR.eventScale_force) + "px";
                        })
                        .attr("class", "link-text")
                        .classed("hidden", hidden)
                        .classed("hidden-by-proportion_filter", hiddenByP)
                        .classed("hidden-by-type_filter", hiddenByT)
                        .attr("path_id", d3.select(this).attr("id"))
                        .append("textPath")
                        .attr("xlink:href","#" + d3.select(this).attr("id"));
                    linkText.text(d.r && d.r.shareholdingRatio ? d.r.shareholdingRatio + "%" : "");
                });
                if(hideAll){
                    d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text").classed("hidden", true);
                    d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text").classed("hidden-by-proportion_filter", false);
                    d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text").classed("hidden-by-type_filter", false);

                }
            },
            tick: function(){
                DIAGRAM.FORCE.DIAGRAM_FORCE.link.attr("x1", function(d) { return d.source.x; })
                    .attr("y1", function(d) { return d.source.y; })
                    .attr("x2", function(d) { return d.target.x; })
                    .attr("y2", function(d) { return d.target.y; });
                DIAGRAM.FORCE.DIAGRAM_FORCE.node.attr("transform", function(d) { return "translate(" + d.x + "," + d.y + ")"; });

            },
            lightPaths: function(d, thisNode){
                if(this.relations){
                    var paths = this.forceGroup.selectAll(".link-force");
                    var pathsFind = [];
                    if(this.layer == 0) {   //全部
                        this.relations.forEach(function(e){
                            e.forEach(function(p){
                                var find = false;
                                p.forEach(function(l){
                                    if(l.split(" ").indexOf(d.nid.toString()) > -1)//split() 方法用于把一个字符串分割成字符串数组。
                                        find = true;
                                });
                                if(find)
                                    pathsFind.push(p);//在所有的路径中找到path中包含d.nid也就是当前节点的path
                            });
                        })
                    }else {
                        this.relations[this.layer].forEach(function(p){
                            var find = false;
                            p.forEach(function(l){
                                if(l.split(" ").indexOf(d.nid.toString()) > -1)
                                    find = true;
                            });
                            if(find)
                                pathsFind.push(p);
                        });
                    }

                    var linksInPaths = [];//相当于去重，保证绘制的path的不重复性
                    pathsFind.forEach(function(p){
                        p.forEach(function(l){
                            if(linksInPaths.indexOf(l) < 0)
                                linksInPaths.push(l);
                        });
                    });

                    //找到图中所有需要高亮的边
                    var p = paths.filter(function(path){
                        var lightThis = false;
                        linksInPaths.every(function(l){
                            l = l.split(" ");
                            if((path.source.nid == l[0] && path.target.nid == l[1]) || (path.source.nid == l[1] && path.target.nid == l[0])){
                                lightThis = true;
                                //return false;
                            }
                            //return true;
                        });
                        return lightThis;
                    });

                    var nodesFind = []; //所有需要高亮的点的id
                    pathsFind.forEach(function(p){
                        p.forEach(function(l){
                            l = l.split(" ");
                            if(nodesFind.indexOf(l[0]) < 0)
                                nodesFind.push(l[0]);
                            if(nodesFind.indexOf(l[1]) < 0)
                                nodesFind.push(l[1]);
                        });
                    });

                    var nodesOutOfP = this.forceGroup.selectAll(".node-force")
                        .filter(function(d){
                            return nodesFind.indexOf(d.nid.toString()) < 0;
                        });//去掉没有点亮的节点
                    if(p[0].length > 0){//表示筛选后的path里面不为空的话
                        this.forceGroup.selectAll(".link-force")
                            .classed("selected", false)
                            .attr("marker-end", "")
                            .attr("marker-start", "");
                        this.forceGroup.selectAll(".node-force").classed("unselected", false);//去掉class  "unselected"
                        this.forceGroup.selectAll(".node-force").classed("selected", true);//添加class "selected"
                        this.forceGroup.selectAll(".node-force>text").classed("hidden", false)
                        nodesOutOfP
                            .classed("unselected", true)
                            .classed("selected", false)
                            .selectAll("text").classed("hidden", true);

                        d3.selectAll(".lightArrow").remove();
                        p.classed("selected", true)
                            .attr("_marker-end", function(d){
                                DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                                    .append("defs")
                                    .attr("class", "lightArrow")
                                    .append("marker")
                                    .attr("id", "arrow-end-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowEndIdCount)
                                    .attr("class", function(){
                                        if(d.r.type == 1)
                                            return "arrow-selected-invest";
                                        else if(d.r.type == 2)
                                            return "arrow-selected-child";
                                    })
                                    .attr("viewBox", "0 -5 10 10")
                                    .attr("refX", 5)
                                    .attr("refY", 0)
                                    .attr("markerWidth", 5)
                                    .attr("markerHeight", 5)
                                    .attr("orient", "auto")
                                    .append("svg:path")
                                    .attr("d", "M0,-5L10,0L0,5");
                                return "url(" + location.href + "#arrow-end-" + DIAGRAM.FORCE.DIAGRAM_FORCE.arrowEndIdCount + ")";
                            })
                            .attr("marker-end", function(d) {
                                if (d.isReversed) {
                                    return "";
                                } else {
                                    return $(this).attr("_marker-end");
                                }
                            })
                            .attr("_marker-start", function(d){
                                if (typeof d.isReversed === "undefined") {
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                                        .append("defs")
                                        .attr("class", "lightArrow")
                                        .append("marker")
                                        .attr("id", "arrow-start-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount)
                                        .attr("class", function(){
                                            if(d.r.type == 1)
                                                return "arrow-selected-invest";
                                            else if(d.r.type == 2)
                                                return "arrow-selected-child";
                                        })
                                        .attr("viewBox", "0 -5 10 10")
                                        .attr("refX", 0)
                                        .attr("refY", 0)
                                        .attr("markerWidth", 5)
                                        .attr("markerHeight", 5)
                                        .attr("orient", "auto")
                                        .append("svg:path")
                                        .attr("d", "M10,-5L0,0L10,5");
                                } else {
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.marker = DIAGRAM.FORCE.DIAGRAM_FORCE.svg
                                        .append("defs")
                                        .attr("class", "lightArrow")
                                        .append("marker")
                                        .attr("id", "arrow-start-" + ++DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount)
                                        .attr("class", function(){
                                            if(d.r.type == 1)
                                                return "arrow-selected-invest";
                                            else if(d.r.type == 2)
                                                return "arrow-selected-child";
                                        })
                                        .attr("viewBox", "0 -5 10 10")
                                        .attr("refX", 0)
                                        .attr("refY", 0)
                                        .attr("markerWidth", 5)
                                        .attr("markerHeight", 5)
                                        .attr("orient", "auto")
                                        .append("svg:path")
                                        .attr("d", "M10,-5L0,0L10,5");
                                }

                                return "url(" + location.href + "#arrow-start-" + DIAGRAM.FORCE.DIAGRAM_FORCE.arrowStartIdCount + ")";
                            })
                            .attr("marker-start", function(d) {
                                if (d.isReversed) {
                                    return $(this).attr("_marker-start");
                                } else {
                                    return "";
                                }
                            })
                            .classed("unselected", false);
                        p.each(function(){
                            d3.selectAll(".link-text[path_id='" + $(this).attr("id") + "']").each(function(d){
                                d3.select(this).classed("hidden", false);
                            });
                        });
                        // d3.select(thisNode).classed("selected", true)
                    }
                }
            },
            currentLayerView: function(){
                if(this.layer == 0){
                    DIAGRAM.FORCE.DIAGRAM_FORCE.DRAW( DIAGRAM.FORCE.DIAGRAM_FORCE.data);
                    return;
                }
                d3.selectAll(".link-force").classed("hidden", false);
                d3.selectAll(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .link-text").classed("hidden", true);
                this.forceGroup.selectAll(".link-force")
                    .classed("selected", false)
                    .attr("marker-end", "url(" + location.href + "#arrow-end)")
                    .attr("marker-start", "url(" + location.href + "#arrow-start)")
                    .attr("_marker-end", "url(" + location.href + "#arrow-end)")
                    .attr("_marker-start", "url(" + location.href + "#arrow-start)");
                this.forceGroup.selectAll(".node-force")
                    .classed("unselected", false)
                    .classed("selected", false);
                this.forceGroup.selectAll(".node-force text").classed("hidden", function(d){ return !d.root})
                var nodesIdInlayer = [];
                var linksInlayer = [];
                if(this.relations[this.layer]){
                    this.relations[this.layer].forEach(function(p){
                        p.forEach(function(l){
                            var twoNodes = l.split(" ");
                            if(nodesIdInlayer.indexOf(twoNodes[0]) < 0)
                                nodesIdInlayer.push(twoNodes[0]);
                            if(nodesIdInlayer.indexOf(twoNodes[1]) < 0)
                                nodesIdInlayer.push(twoNodes[1]);
                            if(linksInlayer.indexOf(l) < 0)
                                linksInlayer.push(l);
                        });
                    });
                }
                var layerNodes = this.forceGroup.selectAll(".node-force")
                    .classed("unselected", true)
                    .filter(function(d){
                        return nodesIdInlayer.indexOf(d.nid.toString()) > -1;
                    });
                layerNodes.classed("unselected", false);
                var layerPaths = this.forceGroup.selectAll(".link-force")
                    .classed("unselected", true)
                    .filter(function(path,i){
                        var linkFind = false;
                        var source = path.source.nid;
                        var target = path.target.nid;
                        linksInlayer.every(function(l){
                            l = l.split(" ");
                            if((source == l[0] && target == l[1]) || (source == l[1] && target == l[0])){
                                linkFind = true;
                                return false;
                            }
                            return true;
                        });
                        // if(linkFind){
                        //     d3.selectAll("textpath[path_id='" + $(this).attr("id") + "']").classed("hidden", false)
                        // }
                        // else{
                        //     d3.selectAll("textpath[path_id='" + $(this).attr("id") + "']").classed("hidden", true)
                        // }
                        return linkFind;
                    });
                layerPaths.classed("unselected", false);
            },
            convertData: function(data){
                var result = {};
                result.nodes = [];
                result.links = [];
                // result.nodes.push({companyId: data.target.companyId, name: data.target.name, fixed: true, root: true});
                // result.nodes.push({companyId: data.source.companyId, name: data.source.name, fixed: true, root: true});
                data.relations.forEach(function(l){
                    l.paths.forEach(function(p){
                        p.forEach(function(r){
                            var sourceFindInNodes = false;
                            var targetFindInNodes = false;
                            result.nodes.forEach(function(n){
                                if(n.nid == r.sid)
                                    sourceFindInNodes = true;
                                if(n.nid == r.tid)
                                    targetFindInNodes = true;
                            });
                            if(!sourceFindInNodes){
                                var node = {};
                                if(r.sid == data.sid || r.sid == data.tid){
                                    node.fixed = true;
                                    node.root = true;
                                    // DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[r.sid].fixed = true;
                                    // DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[r.sid].root = true;
                                }
                                node.nid = r.sid;
                                result.nodes.push(node);
                            }
                            if(!targetFindInNodes){
                                var node = {};
                                if(r.tid == data.tid || r.tid == data.sid){
                                    node.fixed = true;
                                    node.root = true;
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[r.tid].fixed = true;
                                    DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[r.tid].root = true;
                                }
                                node.nid = r.tid;
                                result.nodes.push(node);
                            }
                        });
                    });
                });

                data.relations.forEach(function(l){
                    l.paths.forEach(function(p){
                        p.forEach(function(r){
                            var relationFindInLinks = false;
                            result.links.forEach(function(link){
                                if(link.source && link.target && result.nodes[link.source].nid == r.sid && result.nodes[link.target].nid == r.tid)
                                    relationFindInLinks = true;
                            });
                            if(!relationFindInLinks){
                                var link = {};
                                result.nodes.forEach(function(n, Nindex){
                                    if(n.nid == r.sid)
                                        link.source = Nindex;
                                    if(n.nid == r.tid)
                                        link.target = Nindex;
                                });
                                link.r = r.r;
                                result.links.push(link);
                            }
                        });
                    });
                });
                return result;
            },
            deriveOrders: function(data){
                var result = [];
                result["maxOrder"] = 0;
                data.relations.forEach(function(o){
                    result[o.order] = [];
                    o.paths.forEach(function(p){
                        var path = [];
                        p.forEach(function(l){
                            path.push(l.sid + " " + l.tid);
                        });
                        result[o.order].push(path);
                    });
                    if(o.order > result["maxOrder"])
                        result["maxOrder"] = o.order;
                });
                return result;
            },
            setScale: function(){
                this.data.nodes.forEach(function(d){
                    var c = DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap[d.nid];
                    if(c.scale)
                        c.scale = DIAGRAM.FORCE.DIAGRAM_FORCE.quantile(c.scale);
                    else{
                        c.scale = 0;
                        c.scale = DIAGRAM.FORCE.DIAGRAM_FORCE.quantile(c.scale);
                    }
                });
            },
            PROPORTION_FILTER: function(n){
                d3.selectAll(".link-force").classed("hidden-by-proportion_filter" ,function(d){
                    if(!d.r || !d.r.shareholdingRatio || d.r.shareholdingRatio > n){
                        d3.selectAll(".link-text[path_id='" + $(this).attr("id") + "']").classed("hidden-by-proportion_filter", false)
                        return false;
                    }
                    else{
                        d3.selectAll(".link-text[path_id='" + $(this).attr("id") + "']").classed("hidden-by-proportion_filter", true)
                        return true;
                    }
                });
                this.ISOLATED_NODES_JUDGE();
            },
            TYPE_FILTER: function(type){
                d3.selectAll(".link-force").classed("hidden-by-type_filter",function(d){
                    var hasType = d3.select(this).classed(type);
                    d3.selectAll(".link-text[path_id='" + $(this).attr("id") + "']").each(function(){
                        d3.select(this).classed("hidden-by-type_filter",function(d){
                            return !hasType;
                        });
                    });
                    return !hasType;
                });
                this.ISOLATED_NODES_JUDGE();
            },
            ISOLATED_NODES_JUDGE: function(){
                d3.selectAll(".node-force").classed("hidden-isolated", function(n){
                    if(d3.select(this).classed("root"))
                        return false;
                    var isIsolated = true, isOutofLayer = true;
                    d3.selectAll(".link-force").each(function(l){
                        if(l.source.nid == n.nid || l.target.nid == n.nid){
                            if(!d3.select(this).classed("unselected")
                                && !d3.select(this).classed("hidden")
                                && !d3.select(this).classed("hidden-by-proportion_filter")
                                && !d3.select(this).classed("hidden-by-type_filter")){
                                isIsolated = false;
                            }
                            if(!d3.select(this).classed("unselected")){
                                isOutofLayer = false;
                            }
                        }
                    });
                    if(isOutofLayer)
                        return false;
                    return isIsolated;
                });
            },
        },
        LINSTENER_BIND:function(){
            $(".forceDiagram-bar .selecter-proportion").on("change", function(e){
                DIAGRAM.FORCE.DIAGRAM_FORCE.PROPORTION_FILTER($(this).val());
            });
            $(".forceDiagram-bar .selecter-layer").on("change", function(e){
                DIAGRAM.FORCE.DIAGRAM_FORCE.layer = $(this).val();
                DIAGRAM.FORCE.DIAGRAM_FORCE.currentLayerView();
                $(".forceDiagram-bar .selecter-proportion").val(0);
            });
            $(".forceDiagram-bar .reset-force").on("click", function(e){
                DIAGRAM.FORCE.DIAGRAM_FORCE.layer = 0;
                DIAGRAM.FORCE.DIAGRAM_FORCE.zoomListener.scale(1);
                DIAGRAM.FORCE.DIAGRAM_FORCE.zoomListener.translate([0,0]);
                DIAGRAM.DATA.VAR.eventScale_force = 1;
                DIAGRAM.FORCE.DIAGRAM_FORCE.LOAD_DATA(DIAGRAM.FORCE.DIAGRAM_FORCE.companyId1,DIAGRAM.FORCE.DIAGRAM_FORCE.companyId2);
            });
            $(".forceDiagram-bar .resetDiagram").on("click", function(e){
                DIAGRAM.RP.goBack();
            });
            $(".forceDiagram-bar .foldSelecter").on("click", function(e){
                $(".forceDiagram-bar").animate({width:'toggle'},300);
                setTimeout(function(){
                    $(".forceDiagram-expend .expendSelecter").toggle(200)
                }, 175)
            });
            $(".forceDiagram-expend .expendSelecter").on("click", function(e){
                $(".forceDiagram-expend .expendSelecter").toggle(100);
                $(".forceDiagram-bar").animate({width:'toggle'},300);
            });

            $(".board2 .tables ul").on("click",function(d){
                $(".board2 .tables ul li").removeClass("act");
                $(d.target).addClass("act");
                $(d.target).parents("li").addClass("active");
                var which;
                if($(d.target).hasClass("shareholders"))
                    which = "shareholders";
                else if($(d.target).hasClass("subcompanies"))
                    which = "subcompanies";
                else if($(d.target).hasClass("seniors"))
                    which = "seniors";
                DIAGRAM.COMPANY_INFO.getTableInfo(which, ".board2");
            });
            $(".board2 .company_name").on("click", function(event){
                if($(".board2 .content").css("display") == "none"){
                    $(".board2 .content").slideDown(300, function(){
                        $(".board2 .company_name").removeClass("up")
                        $(".board2 .company_name").addClass("down")
                    });
                }
                else{
                    $(".board2 .content").slideUp(300, function(){
                        $(".board2 .company_name").removeClass("down")
                        $(".board2 .company_name").addClass("up")
                    });
                }
            });
            $(".board2 .blue-border-btn").on("click", function(){
                DIAGRAM.showTree(DIAGRAM.DATA.VAR.companyId);
            });

            $(DIAGRAM.DATA.SELECTOR.BASE_FORCE + " .typeBoard > div").on("click", function(e){
                var thisObject = DIAGRAM.FORCE.DIAGRAM_FORCE;
                if($(this).children("i").hasClass("invest-color")){
                    if(thisObject.lastTypeClicked == "invest"){
                        thisObject.TYPE_FILTER("");
                        thisObject.lastTypeClicked = "";
                    }
                    else{
                        thisObject.TYPE_FILTER("invest");
                        thisObject.lastTypeClicked = "invest";
                    }
                }
                else if($(this).children("i").hasClass("child-color")){
                    if(thisObject.lastTypeClicked == "child"){
                        thisObject.TYPE_FILTER("");
                        thisObject.lastTypeClicked = "";
                    }
                    else{
                        thisObject.TYPE_FILTER("child");
                        thisObject.lastTypeClicked = "child";
                    }
                }
            });
        },
    },
    COMPANY_INFO:{
        infoPannel:null,
        showInfo:function(d, whichBoard, isPerson){
            var nodeInfo;
            var info = $(whichBoard + " .info");
            var infoBlank = $(whichBoard + " .info-blank");
            if(whichBoard === ".board1") {//tree图
                nodeInfo = DIAGRAM.TREE.DIAGRAM_TREE.NODE_INFO;
            } else if(whichBoard === ".board2") {//force图
                nodeInfo = DIAGRAM.FORCE.DIAGRAM_FORCE.NODE_INFO;
            }
            // $(DIAGRAM.DATA.SELECTOR.COMPANYINFO).css("display", "block");
            var name = nodeInfo(d.nid).name || nodeInfo(d.nid).personName;//得到name
            $(whichBoard + " .company_name").html(name.slice(0, 16)+(name.length>16?"...":""));//截取名字字符串的前17个字符，之后的用...代替
            $(whichBoard + " .company_name").attr("title",name);//更改company_name类的title
            $(whichBoard + " .info").children().each(function(index, c){
                if($(c).children("span:nth-child(2)"))
                    $(c).children("span:nth-child(2)").remove();//初始化，先删除之前的相应信息
            });
            $(whichBoard + " #foldScope").remove();//scope的内容，即主营业务的内容
            $(whichBoard + " #unfoldScope").remove();//scope的内容，即主营业务的内容（展开）
            if (!(nodeInfo(d.nid).marketValue || nodeInfo(d.nid).registrationCapital || nodeInfo(d.nid).representitive || nodeInfo(d.nid).establishDate || nodeInfo(d.nid).scope)) {
                infoBlank.css("display", "block");//如果上述的公司内的信息都不存在的话则将info面板隐藏，用infoBlank面板来显示信息
                info.css("display", "none");
            } else {
                info.css("display", "block");
                infoBlank.css("display", "none");
                if(nodeInfo(d.nid).marketValue){//表示有市值的就显示市值，没市值的就显示注册资本
                    $(whichBoard + " .marketValue").append("<span>" +  (DIAGRAM.TOOL.NumberFormat(nodeInfo(d.nid).marketValue/10000) + "万元") + "</span>")
                    $(whichBoard + " .marketValue").css("display", "block");
                    $(whichBoard + " .registrationCapital").css("display", "none");
                }
                else{
                    $(whichBoard + " .registrationCapital").append("<span>" + (nodeInfo(d.nid).registrationCapital ? (DIAGRAM.TOOL.NumberFormat(nodeInfo(d.nid).registrationCapital/10000) + "万元") : "暂无") + "</span>")
                    $(whichBoard + " .marketValue").css("display", "none");
                    $(whichBoard + " .registrationCapital").css("display", "block");
                }
                $(whichBoard + " .representitive").append("<span>" +  (nodeInfo(d.nid).representitive ? nodeInfo(d.nid).representitive : "暂无") + "</span>")
                $(whichBoard + " .establishDate").append("<span>" + (nodeInfo(d.nid).establishDate ? nodeInfo(d.nid).establishDate : "暂无") + "</span>")
                $(whichBoard + " .scope").append("<span id='foldScope'>" + (nodeInfo(d.nid).scope ? (nodeInfo(d.nid).scope.length > 67 ? nodeInfo(d.nid).scope.substr(0, 67).concat("...&nbsp;&nbsp;<a id='unfoldScopea'>展开</a>") : nodeInfo(d.nid).scope): "暂无") + "</span><span id='unfoldScope' style='display: none;'>" + nodeInfo(d.nid).scope + "&nbsp;&nbsp;<a id='foldScopea'>收起</a></span>")
                $(whichBoard + " #unfoldScopea").click(function() {//通过点击展开与收缩切换不同的显示内容
                    $(whichBoard + " #foldScope").css("display", "none");//id='foldScope'表示折叠情况下的经营范围显示内容
                    $(whichBoard + " #unfoldScope").css("display", "inline");//id='unfoldScope'表示展开情况下的经营范围显示内容
                })
                $(whichBoard + " #foldScopea").click(function() {
                    $(whichBoard + " #unfoldScope").css("display", "none");
                    $(whichBoard + " #foldScope").css("display", "inline");
                })
            }
            if(d.r && d.r.type != 0){
                if(d.r.type == 1){
                    $(whichBoard + " .co-type.sub span").html("投资公司");
                    $(whichBoard + " .co-type.sub").css("color", DIAGRAM.DATA.CONST.COLOR_INVEST);
                    $(whichBoard + " .co-type.sub i").css("background", DIAGRAM.DATA.CONST.COLOR_INVEST)
                }
                else if(d.r.type == 2){
                    $(whichBoard + " .co-type.sub span").html("子公司");
                    $(whichBoard + " .co-type.sub").css("color", DIAGRAM.DATA.CONST.COLOR_CHILD);
                    $(whichBoard + " .co-type.sub i").css("background", DIAGRAM.DATA.CONST.COLOR_CHILD)
                }
                else if(d.r.type == 3){
                    $(whichBoard + " .co-type.sub span").html("股东");
                    $(whichBoard + " .co-type.sub").css("color", DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER);
                    $(whichBoard + " .co-type.sub i").css("background", DIAGRAM.DATA.CONST.COLOR_STOCKHOLDER)
                }
            }
            else{
                $(whichBoard + " .co-type.sub span").html("研究公司");
                $(whichBoard + " .co-type.sub").css("color", DIAGRAM.DATA.CONST.COLOR_ROOT);
                $(whichBoard + " .co-type.sub i").css("background", DIAGRAM.DATA.CONST.COLOR_ROOT)
    }
            if(nodeInfo(d.nid).companyType && nodeInfo(d.nid).companyType.indexOf("上市") > -1){//直接找到companyType中的上市公司，之后的需求可以参考这里
                $(whichBoard + " .sign").html("上市公司");
            }
            else{
                $(whichBoard + " .sign").html("非上市公司");
            }
            if(isPerson){
                $(whichBoard + " .tables").addClass("isPerson");
                $(whichBoard + " .sign").addClass("isPerson");
                $(whichBoard + " .board-btn").unbind("click");
                $(whichBoard + " .board-btn").addClass("isPerson");
                $(whichBoard + " .info-blank p").html("股东信息敬请期待");
                return;
            }
            $(whichBoard + " .tables").removeClass("isPerson");
            $(whichBoard + " .sign").removeClass("isPerson");//added by mingru.xia fix a bug here
            $(whichBoard + " .board-btn").removeClass("isPerson");
            $(whichBoard + " .info-blank p").html("暂无详细信息");
            $(DIAGRAM.DATA.SELECTOR.BASE + " .board-btn").unbind("click").on("click",function(){
                DIAGRAM.RP.openNewCompany(nodeInfo(d.nid).name);
                //var openUrl = DIAGRAM.DATA.URL.NAME_SEARCH.replace(/\{companyName\}/i,companyMap[d.cid].name)
                //window.open(openUrl);
            })
            $(whichBoard + " .tables ul .shareholders").trigger("click");
        },
        showInfo_force:function(d, whichBoard){
            var companyMap = DIAGRAM.FORCE.DIAGRAM_FORCE.companyMap;

            $(DIAGRAM.DATA.SELECTOR.COMPANYINFO).css("display", "block");
            $(whichBoard + " .company_name").html(companyMap[d.nid].name.slice(0, 16));
            $(whichBoard + " .info").children().each(function(index, c){
                if($(c).children("span:nth-child(2)"))
                    $(c).children("span:nth-child(2)").remove();
            });
            if(d.marketValue){
                $(whichBoard + " .marketValue").append("<span>" +  (d.marketValue/10000 + "万元") + "</span>")
                $(whichBoard + " .registrationCapital").css("display", "none");
            }
            else{
                $(whichBoard + " .registrationCapital").append("<span>" + (d.registrationCapital ? d.registrationCapital/10000 + "万元" : "暂无") + "</span>")
            }
            $(whichBoard + " .representitive").append("<span>" +  (d.representitive ? d.representitive : "暂无") + "</span>")
            $(whichBoard + " .establishDate").append("<span>" + (d.establishDate ? d.establishDate : "暂无") + "</span>")
            $(whichBoard + " .scope").append("<span>" + (d.scope ? d.scope : "暂无") + "</span>")

            $(".board2 .tables ul .shareholders").trigger("click");
        },
        getTableInfo: function(whichTable, whichBoard){
            $(whichBoard + " .preloader").css("display", "block");
            $(whichBoard + " .table-wrapper table").css("display", "none");
            if(DIAGRAM.DATA.VAR.tableAjax) DIAGRAM.DATA.VAR.tableAjax.abort();

            var localData = DIAGRAM.TOOL.STORAGE.getJson("treeDiagram-tableInfo-" + whichTable +"_" + DIAGRAM.DATA.VAR.companyId);
            if(localData){
                this.fillTable(whichTable, localData, whichBoard);
            }
            else{
                var field ;
                switch(whichTable){
                    case "shareholders":
                        field = "incompany";
                        break;
                    case "subcompanies":
                        field = "outcompany";
                        break;
                    case "seniors":
                        field = "member";
                        break;
                }
                DIAGRAM.DATA.VAR.tableAjax =
                    DIAGRAM.TOOL.GET(DIAGRAM.DATA.URL.COMPANY_DETAIL.replace(/\{nodeID}/i, DIAGRAM.DATA.VAR.companyId).replace(/\{nodetype}/i, "company").replace(/\{field}/i, field), function(data){
                        if(data.data){
                            DIAGRAM.TOOL.STORAGE.setJson("treeDiagram-tableInfo-" + whichTable +"_" + DIAGRAM.DATA.VAR.companyId, data.data.datalist);
                            DIAGRAM.COMPANY_INFO.fillTable(whichTable, data.data.datalist, whichBoard);
                        }else{
                            $(whichBoard + " .preloader").css("display", "none");
                            DIAGRAM.COMPANY_INFO.fillTable(whichTable,undefined,whichBoard);
                        }
                    },function(){
                        $(whichBoard + " .preloader").css("display", "none");
                        DIAGRAM.COMPANY_INFO.fillTable(whichTable,undefined,whichBoard);
                    });
            }
        },
        fillTable: function(whichTable, data, whichBoard){
            $(whichBoard + " .table-wrapper .table tbody").html("");
            $(whichBoard + " .table-wrapper .table tbody").next().remove();
            $("#moreLines").parent().remove();
            if(!data || data.code<0 || data.length == 0) {
                //TODO 展示没有信息的图
                var collength = $(whichBoard + " .table-wrapper .table-" + whichTable + " th").size();
                $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left" colspan="'+collength+'">对不起，没有相关数据...</td></tr>');
                $(whichBoard + " .table-wrapper .table-" + whichTable).css("display", "table");
                $(whichBoard + " .preloader").css("display", "none");
                return;
            }
            if (data.length > 5) {
                for (var i = 0; i < 5; i++) {
                    if (whichTable === "shareholders" || whichTable == "subcompanies") {
                        if (data && data[0].nodeName !== undefined) {
                            $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + data[0].nodeName + '</td><td>' + (data[0].ratio ? (data[0].ratio + "%") : "暂无") + "</td></tr>");
                        }
                        data.shift();
                    }
                    else if (whichTable == "seniors") {
                        if (data && data[0].name !== undefined) {
                            $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + data[0].name + '</td><td>' + (data[0].position.replace(/(?:^;+)/, "").replace(/(?:;+$)/, "").replace(/(?:;+)/, ",") || "暂无") + "</td></tr>");
                        }
                        data.shift();
                    }
                }
                $(whichBoard + " .table-wrapper").append("<div style='text-align: right; font-size: 12px;'><a id='moreLines'>更多...</a></div>");
                $("#moreLines").click(function () {
                    if (data.length <= 5) {
                        if (whichTable === "shareholders" || whichTable == "subcompanies") {
                            data.forEach(function (d) {
                                if (d && d.nodeName !== undefined) {
                                    $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + d.nodeName + '</td><td>' + (d.ratio ? (d.ratio + "%") : "暂无") + "</td></tr>");
                                }
                            });
                        }
                        else if (whichTable == "seniors") {
                            data.forEach(function (d) {
                                if (d && d.name !== undefined) {
                                    $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + d.name + '</td><td>' + (d.position.replace(/(?:^;+)/, "").replace(/(?:;+$)/, "").replace(/(?:;+)/, ",") || "暂无") + "</td></tr>");
                                }
                            });
                        }
                        $(this).parent().remove();
                    } else {
                        for (var i = 0; i < 5; i++) {
                            if (whichTable === "shareholders" || whichTable == "subcompanies") {
                                if (data && data[0].nodeName !== undefined) {
                                    $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + data[0].nodeName + '</td><td>' + (data[0].ratio ? (data[0].ratio + "%") : "暂无") + "</td></tr>");
                                }
                                data.shift();
                            }
                            else if (whichTable == "seniors") {
                                if (data && data[0].name !== undefined) {
                                    $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + data[0].name + '</td><td>' + (data[0].position.replace(/(?:^;+)/, "").replace(/(?:;+$)/, "").replace(/(?:;+)/, ",") || "暂无") + "</td></tr>");
                                }
                                data.shift();
                            }
                        }
                    }

                })
            } else {
                if (whichTable === "shareholders" || whichTable == "subcompanies") {
                    data.forEach(function (d) {
                        if (d && d.nodeName !== undefined) {
                            $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + d.nodeName + '</td><td>' + (d.ratio ? (d.ratio + "%") : "暂无") + "</td></tr>");
                        }
                    });
                }
                else if (whichTable == "seniors") {
                    data.forEach(function (d) {
                        if (d && d.name !== undefined) {
                            $(whichBoard + " .table-wrapper .table-" + whichTable + " tbody").append('<tr><td class="left">' + d.name + '</td><td>' + (d.position.replace(/(?:^;+)/, "").replace(/(?:;+$)/, "").replace(/(?:;+)/, ",") || "暂无") + "</td></tr>");
                        }
                    });
                }
            }
            $(whichBoard + " .table-wrapper .table-" + whichTable).css("display", "table");
            $(whichBoard + " .preloader").css("display", "none");
        }
    },
    DETECT_BROWSER: function(){
        function detect(){
            var ua= navigator.userAgent, tem,
                M= ua.match(/(opera|chrome|safari|firefox|msie|trident(?=\/))\/?\s*(\d+)/i) || [];
            if(/trident/i.test(M[1])){
                tem=  /\brv[ :]+(\d+)/g.exec(ua) || [];
                return 'MSIE '+(tem[1] || '');
            }
            if(M[1]=== 'Chrome'){
                tem= ua.match(/\b(OPR|Edge)\/(\d+)/);
                if(tem!= null) return tem.slice(1).join(' ').replace('OPR', 'Opera');
            }
            M= M[2]? [M[1], M[2]]: [navigator.appName, navigator.appVersion, '-?'];
            if((tem= ua.match(/version\/(\d+)/i))!= null) M.splice(1, 1, tem[1]);
            return M.join(' ');
        }
        var result = detect();
        if(result.indexOf("MSIE") > -1)
            DIAGRAM.DATA.VAR.browserSupportMarker = false;
    },
}
